{"name": "Stacja pomiarowa na LK2 (zch)", "gauges": "", "gauges2": "", "statuses": "", "url": "https://thingspeak.com//channels/19819", "author": "14971", "disc": "Test pomiarów za pomocą Lan Kontrolera V2.", "tags": ["LK","temperature","humidity","","Lankontroler"], "shares": "0", "charts": ["/apps/plugins/6609","/apps/plugins/6608","/apps/plugins/6732","/apps/plugins/6614","/apps/plugins/9480","/apps/plugins/9477","/apps/plugins/9294","/apps/plugins/13537"], "comments": [{"author": "NOVUSCCTV", "creation_time": "over 3 years ago", "text": "Cześć, próbuje zrobić pluginy dla GSM Kontroler, podzielicie się swoim kodem?"},{"author": "14971", "creation_time": "over 3 years ago", "text": "WitamJa używam LankontroleraV2, składnia jest pewnie taka sama.Które konkretnie pluginy chciałbyś użyć?"},{"author": "NOVUSCCTV", "creation_time": "over 3 years ago", "text": "Poszukuję tego zegara, którym wyświetlasz temperatury, fajnie jest zrobiony w przeciwieństwie do tego co aktualnie posiadam. Swoją drogą wykresy też są nie głupie."},{"author": "14971", "creation_time": "over 3 years ago", "text": "W poniższych linkach są pliki tekstowe, w nich znajdują się kody z komentarzami w kluczowych miejscach. https://dl.dropboxusercontent.com/u/30363436/ThingSpeak/css%20Temperatura%20wewn%C4%99trzna%201.txt  https://dl.dropboxusercontent.com/u/30363436/ThingSpeak/JavaScript%20Temperatura%20wewn%C4%99trzna%201.txt Skopiuj te pliki i otwórz w notatniku, zawartość wklej odpowiednio w oknach css oraz javascript w nowo utworzonym pluginie Google Gauge. Kolory wartości ostrzegawczych wziąłem z tej strony http://pl.wikipedia.org/wiki/Kolory_w_Internecie  Pozd.Zdzisław"},{"author": "NOVUSCCTV", "creation_time": "over 3 years ago", "text": "Dzięki, powalcze sobie z tym.Pozdrawiam"},{"author": "NOVUSCCTV", "creation_time": "over 3 years ago", "text": "Jeszcze raz dziękuję, udało mi się na Twoich plikach to ogarnąć. Jeszcze pytanie odnośnie wykresów, jak stworzyłeś legendę do wykresu?"},{"author": "14971", "creation_time": "over 3 years ago", "text": "W kodzie wykresu, sekcja javascript jest taka linia jak:legend: { enabled: true }, zmieniasz false na true i tak właśnie włącza się legendę. Pozdr.Zdzisław"},{"author": "mycha169", "creation_time": "about 2 years ago", "text": "Bardzo podobają mi się twoje Mierniki temperatury. Utworzyłem jeden , ale jest dostępny tylko na kanale prywatnym.. Natomiast wiedzę że twój jest dostępny w sekcji Publicznej .. Jak to zrobiłeś ?"},{"author": "sliver001", "creation_time": "almost 3 years ago", "text": "Cześć.Czy mógłbyś podzielić się tez kodem dla wykresu temperatury zewnetrzne/wewnetrznej 24h?Nie mogę sobie z nim dać rady..."},{"author": "14971", "creation_time": "almost 3 years ago", "text": "wklej do okienka javascript zawartość mojego plugina, wpisz swoje ID i API KEY tak gdzie napisałem https://dl.dropboxusercontent.com/u/30363436/ThingSpeak/wykres_24h.txt"},{"author": "sliver001", "creation_time": "almost 3 years ago", "text": "Dzięki za odzew:) ale coś mi nie działa...  Dodałem jako nowy plugin 'Chart With Multiple Series ' i w kleiłem kod do java. Co wpisać w oknach html i css?"},{"author": "14971", "creation_time": "almost 3 years ago", "text": "Cześć Czy możesz sprecyzować co Ci nie działa, czego używasz do wysyłania danych?Istotne jest wpisanie poprawnej informacji w tym poleceniu:var series_1_field_number = i tu wpisz z ktorego kanalu ma pokazać dane;"},{"author": "14971", "creation_time": "almost 3 years ago", "text": "udostępnię Ci jeszcze moje kody z sekcji html i csshttps://dl.dropboxusercontent.com/u/30363436/ThingSpeak/HTML.txt  https://dl.dropboxusercontent.com/u/30363436/ThingSpeak/CSS.txt"},{"author": "14971", "creation_time": "almost 3 years ago", "text": "Zrobiłem dla testu kolejny wykres, na tym kodzie który Ci udostępniłem, zmieniłem tylko kolory.Tak się prezentuje: https://thingspeak.com/apps/plugins/25104"},{"author": "michaltrych", "creation_time": "almost 3 years ago", "text": "Czy ktoś może podpowiedzieć, jak zrobić wykresy  w dwóch rzędach?"},{"author": "14971", "creation_time": "almost 3 years ago", "text": "Nie za bardzo rozumiem o co pytasz, podaj jakiś przykład do swojego pytania."},{"author": "michaltrych", "creation_time": "over 2 years ago", "text": "Gdzieś mi zniknęły Twoje linki, dobrze, że mam kopie... tak czy inaczej przydały się, kanału nie widać, bo działałem testowo na drugim. Takie rzeczy mi się urodziły:https://thingspeak.com/apps/plugins/38929 https://thingspeak.com/apps/plugins/38935 Także chyba to co chchciałem to jest. problem w tym, że nie mam możłiowści zaznaczenia pod pluginem make public, mam tylko save i delete i tym samym,  pokazać te wizualizacje mogę tylko na profilu priv.  na publicznym nie mam wogóle do wyboru tych pluginó w  wizualizacji i dziwne, że jak próbuję stworzyć nowy plugin, też nie mam make publić na dole...  jutro powalczę jeszcze  - dzisiaj pół dnia bawiłem się z czujnikami, bo w lk 1.,2 nie można zmieniać kolejność - wyszukuje po adresach i taka jest kolejność."},{"author": "14971", "creation_time": "over 2 years ago", "text": "Trochę dziwne, zniknęło dużo komentarzy które były powyżej."},{"author": "14971", "creation_time": "over 2 years ago", "text": "Linki nie działają, jest komunikat: The author made this visualization private. Czy masz zaznaczony w ustawianiach kanału (Channel Settings) na samym dole checbox Make Public?."},{"author": "michaltrych", "creation_time": "over 2 years ago", "text": "już zaczynam mieć dość... stary kanał usunąłem, bo robiłem testy na nowym... stąd nie działa pierwszyu link. Teraz mam tak, że nie mogę pluginu zaznaczyć jako publić, bo nie mam takiej opcji ( jest ale w kanale) nawet jak chcę edytować dowolny plugin, to na dole brakuje opcji która wcześnie j była, przez to pewnie nic nie wyświetla... Kanał mam zaznaczony jako public. http://zapodaj.net/55dca6ea579bd.jpg.html http://zapodaj.net/53563153294da.jpg.html http://zapodaj.net/681ee2efa7526.jpg.html napisałem pytanie na forum ts .... ale nie ma odzewu. Aktualnie bawię się takim wynalazkiem, chociaż w zasadzie tu niewiele trzeba, poza wpisaniem danych.  http://forum.arduino.cc/index.php?topic=213058.0 ale to pewnie znasz. Dzisiaj jak znajdę chwilę, sprawdzę na innym koncie - utworzę od zera, bo może się coś pomieszało, tylo muszę mieć dostęp do lk żeby api zmienic."},{"author": "14971", "creation_time": "over 2 years ago", "text": "Bardzo dziwna sytuacja, nie spotkałem się jeszcze z takim problemem.Mam Arduino,  ale nie próbowałem jeszcze tego podłączyć do ThingSpeak, używasz nakładki Ethernet Shield, czy czegoś innego do podłączenia LAN-u?"},{"author": "alsec", "creation_time": "over 2 years ago", "text": "Witaj. Czy kolega jest moze z Choszczna."},{"author": "14971", "creation_time": "over 2 years ago", "text": "Witam. Mieszkam w okolicach Kwidzyna, woj. pomorskie"},{"author": "marciu11", "creation_time": "about 2 years ago", "text": "Mam pytanie. Czy jest możliwość, aby Twoje skrypty miały opcje autoupdatu?  Jak można ustawić w 'czystym' wykresie? W javascipt'cie w linku do wykresu dodałem: dynamic=true, ale nic to nie daje. A przydała by się ta funkcjonalność."},{"author": "rafaello12", "creation_time": "almost 2 years ago", "text": "Witam jak udało Ci się ustawić pluginy jako public ?Próbuję i niby wszystko zgodnie ze schematem, a niestety nie działa, czyżby jakieś ograniczenia wprowadzili."},{"author": "14971", "creation_time": "almost 2 years ago", "text": "Witam W zakładce Public View klikasz na Add Visualizations, w otwartym okienku są wszystkie plug-iny które utworzyłeś, zaznaczasz który potrzebujesz i klikasz Save."},{"author": "14971", "creation_time": "almost 2 years ago", "text": "Dodatkowo musi być zaznaczone pole przy opcji Make Public, w oknie edycji pluginu (na samym dole)."}], "maps": "", "matlabs": "", "language": "pl"}