{"name": "Hoppy's Sensors", "gauges": "", "gauges2": "", "statuses": "", "url": "https://thingspeak.com//channels/291915", "author": "hoppyhop", "disc": "Some sensor data measured with BME280 and DS18B20 and sent once a minute using ESP8266", "tags": ["BME280","esp8266","DS18B20"], "shares": "0", "charts": ["/channels/291915/charts/1?bgcolor=%23ffffff&color=%23d62020&days=1&dynamic=true&timescale=10&title=Inside+temperature&type=line&xaxis=Time&yaxis=Temperature++","/channels/291915/charts/2?bgcolor=%23ffffff&color=%23d62020&days=1&dynamic=true&timescale=10&title=Humidity&type=line&xaxis=Time&yaxis=Humidity%2C+%25","/channels/291915/charts/3?bgcolor=%23ffffff&color=%23d62020&days=3&dynamic=true&min=800&timescale=10&title=Pressure&type=line&xaxis=Time&yaxis=Pressure%2C+hPa","/apps/matlab_visualizations/164805?size=iframe","/channels/291915/charts/8?bgcolor=%23ffffff&color=%23d62020&days=3&dynamic=true&timescale=10&type=line"], "comments": [{"author": "hoppyhop", "creation_time": "about 1 year ago", "text": "I had an ESP8266 for some reason or another. It cost about the same as a beer.I bought a BME280 to fiddle about with, perhaps to make an altimeter with 'one day'.  Connected it to the ESP8266 and discovered how easy it was to program using various libraries found on the internet. Then one thing lead to another and I bought two waterproof DS18B20 sensors and poked one out of the window. The code needed to make this work added about 5 lines to the source.The temperature over-read in the sun, so I wrapped the end in aluminium foil. That left me with a spare sensor. So I stuck that inside a plant propagator. Because I could. Then I realised that the ESP8266 had an analogue input pin. So I found a solar cell I've been carefully hoarding for 25 years or so, just in case, and connected it to the analogue input. That added another line or two to the source code. The graph scale for that is quite arbitrary. More light, more volts. Of course the solar cell voltage is exponentially related to the light intensity. And absolute temperature. And I have no idea what the impedance of the ESP8266 is. But that doesn't matter, it's another graph. Many graphs - such fun - much data! Wow!"},{"author": "hoppyhop", "creation_time": "about 1 year ago", "text": "The Julia set is computed using the mappingreal = (Outside Temperature - 25)/10imag = (Pressure - 1012)/20 The polynomial isfc=z^2 + real + j *imag It serves no purpose except to make pretty pictures. Prettiness is best assured when the weather lines up with regions near to the edge of the Mandelbrot set :-)"}], "maps": "", "matlabs": "", "language": "en"}