{"url": "https://community.thingspeak.com/forum/announcements/page-2/", "threads": [{"url": "https://community.thingspeak.com/forum/announcements/static-ip-server-reboot/", "posts": [{"date": "March 7, 2016 - 9:20 am", "content": "We have a server that hosts the static IP for ThingSpeak - the IP is '184.106.153.149'. Devices that do not have DNS (or reliable DNS) use it to connect to the ThingSpeak API. We need to perform some maintenance on the server so we will be rebooting the server tomorrow at 9am EST. Everything should take a less than 10 minutes, but we wanted to give you notice in case something goes wrong on your device.", "num_user_post": " 402", "author": "Hans"}, {"date": "March 8, 2016 - 9:28 am", "content": "Reboot went smoothly and the static IP server is back online.", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/announcements/download-entire-channel-feed/", "posts": [{"date": "April 1, 2014 - 11:24 pm", "content": "Based on many user requests, we just released a new feature that allows you to download all of your Channel data in CSV format.  To do so, open your Channel in a web browser, click on the 'Data Import / Export' tab, and you should see a button to download your data.lee", "num_user_post": " 457", "author": "lee"}, {"date": "April 4, 2014 - 7:55 pm", "content": "Great Addition!  Thanks.A few observations about how it is working:1. The download is incomplete.  Downloading four channels each with about a million points, I'm only getting the first 83,000 to 158,000 points.  Interestingly, the last point is an even number in the thousands.2.  The download slows to a crawl.  It starts out at 35 k/sec, and falls to over about two minutes to 500 bytes/ sec.  Could this be related to the incomplete downloading?  Is the data throttled to the point that it 'times out'?", "num_user_post": " 70", "author": "turgo"}, {"date": "April 4, 2014 - 11:14 pm", "content": "Hi,I'll take a look at this, what is one of the Channel IDs that is not downloading completely?lee", "num_user_post": " 457", "author": "lee"}, {"date": "April 5, 2014 - 1:03 am", "content": "Channel 5140.", "num_user_post": " 70", "author": "turgo"}, {"date": "April 5, 2014 - 2:21 am", "content": "Ok I see the problem now for Channels with a large number of feeds--as the download progresses our database has to progressively scan larger and larger numbers of table rows to get the next chunk of data, which increasingly slows things down.I'll work on optimizing this process so that you can download large Channel feeds at a constant instead of diminishing rate, and will reply back here when it's ready.lee", "num_user_post": " 457", "author": "lee"}, {"date": "April 5, 2014 - 3:13 am", "content": "Awesome, lee!", "num_user_post": " 70", "author": "turgo"}, {"date": "April 7, 2014 - 3:11 am", "content": "Hi,You should be able to download your entire Channel feed at a nearly constant rate now.  Please let me know if it's working ok for you.lee", "num_user_post": " 457", "author": "lee"}, {"date": "April 9, 2014 - 1:35 am", "content": "Hi Lee,It's working better.  Most downloads have successfully retrieved the whole channel, though a few have not.  It takes quite a while at 30KB/sec.  It would be especially helpful if the download file were named after the channel, and if the header file had the actual names of the fields listed, instead of field1, field2, etc.Thanks for this new feature.", "num_user_post": " 70", "author": "turgo"}, {"date": "April 10, 2014 - 12:23 am", "content": "I'm still having problems retrieving all the data.  For channel 6278 with 833564 Entries, I tried twice.  I downloaded 577000 entries the first time, and 605000 the second.  Why does it stop after an even thousand entries?", "num_user_post": " 70", "author": "turgo"}, {"date": "April 10, 2014 - 12:51 pm", "content": "Hi,The download errors are most likely due to random internet communication errors that we have no control over, but that are more likely to happen the longer a single connection is open.  The downloads are streamed in chunks of 1000 entries from our database, so that's why if there's a problem the last entry will most likely be a multiple of 1000.lee", "num_user_post": " 457", "author": "lee"}, {"date": "April 13, 2014 - 2:16 am", "content": "HiI like this new addition but to avoid the issues people have now I would like you to consider the following:Why not create a file at your server based on the request of a user and inform the user the moment the file is available for download ? The latter could be done in 2 ways:a) user gets a mail message that file X is ready for download orb) user will see a file ready for download when logging in to his account.regardsCor", "num_user_post": " 37", "author": "CorBee"}, {"date": "April 15, 2014 - 12:36 am", "content": "Another useful feature might be to divide the history files into separate years.  A years worth of 15 second data is more than 100 MB.  This will get unwieldy in five years.", "num_user_post": " 70", "author": "turgo"}, {"date": "December 19, 2015 - 1:43 pm", "content": "i realize that this thread is a little outdated but it's almost on the same topicFor how long is data kept on ThingSpeak?  One of the previous posters mentioned 1,000,000 data points.  Like, gee, that's a bunch.Have a wonderful day and thanks for ThingSpeak!  🙂", "num_user_post": " 5", "author": "frazelle09"}, {"date": "December 23, 2015 - 6:36 am", "content": "Apart from the 15 second limit on updates there are no limits that thingspeak imposes (not sure how long that can last).   1 million data points may seem like a lot but its less than 6 months of 15 second data.", "num_user_post": " 271", "author": "rw950431"}, {"date": "February 27, 2016 - 8:59 am", "content": "I cannot export anything from my channels, always receive an error.Using the Export option 'Download all of this Channel's feeds in CSV format.' in the export tab does not work either.It downloads a csv file with the time stamps of all points, but without the data values.This means I lost all my data?", "num_user_post": " 3", "author": "johnmx"}, {"date": "February 29, 2016 - 9:38 am", "content": "Hi, Is your channel private or public? Also, do you see the data in your channel page: https://thingspeak.com/channels//private_show?Thanks,Adarsh", "num_user_post": " 62", "author": "Adarsh_Murthy"}, {"date": "March 2, 2016 - 6:45 pm", "content": "Both my channels are private.But the export still doesn't work after changing them to public.When I click in your link I only see the following message: 'This channel is not public.'.", "num_user_post": " 3", "author": "johnmx"}, {"date": "March 3, 2016 - 2:11 pm", "content": "Sorry, the link has a typo - the channel ID was missing. In the below link, replace the channel ID 12397 with your channel ID:https://thingspeak.com/channels/12397/private_showIn the private view of your channel, do you see data in your channels? If you do see data, then another way to download data from the channel is the following url (note that you need to change the channelID 12397 to your channel ID):https://thingspeak.com/channels/12397/feeds.csv?This will download a csv with 100 rows in it. You can change this by using the info on this link:https://www.mathworks.com/help/thingspeak/get-a-channel-feed.htmlOn clicking on the button to 'Download all of this Channel's feeds in CSV format' in the 'Data Import/Export' tab of a private channel I am able to download data. Are you able to download your data now? -Adarsh", "num_user_post": " 62", "author": "Adarsh_Murthy"}, {"date": "March 3, 2016 - 6:57 pm", "content": "Today the export is working well on both channels.Even the JSON and the XML export are working. Before they returned an error (page not found in one and -1 error in the other).I don't know what was the problem.Anyway, thank you for your help.", "num_user_post": " 3", "author": "johnmx"}]}, {"url": "https://community.thingspeak.com/forum/announcements/thingspeak-live-chart-multi-channel-second-axis-historical-data-csv-export/", "posts": [{"date": "January 24, 2014 - 5:43 pm", "content": "Here is a HTML JavaScript web page to display multiple series and channels in real time.http://forum.arduino.cc/index.php?action=dlattach;topic=213058.0;attach=66726You must edit the page source/ JavaScript to enter your channel information. If you have lots of series, it is helpful to click the 'Hide All' button, and then click on the series names you are interested in to show them.  Clicking and dragging vertically on the chart will select a range to zoom in to.Check the 'Update Chart' checkbox to enable realtime charting.  With more than about 8 channels, this causes ThingSpeak to cache and delay the data, so I have it unchecked.It also features buttons to load historical data 8000 points at a time.   Select which channel you want to load, and how many sequential loads to try.  Then click the 'Load More Historical Data' button.  Loading too much data causes ThingSpeak to first delay the data, and then (error 404) refuse to return data.  After ten loads or so, I often cannot load any more data.The three bars export button at the top right has an option to download a .csv file containing the data from the chart.This is public domain.  Please post upgrades on the Arduino forum thread. (too bad this forum doesn't support posting files)http://forum.arduino.cc/index.php?topic=213058.0 The navigator could be dramatically upgraded to provide complete access to your historical data with smaller data downloads if ioBridge were to change the Average function so it would return 8000 points, instead of averaging 8000 points.  http://community.thingspeak.com/forum/thingspeak-api/daily-average1440-parameter-purpose-defeated-by-results-limits/The charting library is called HighStock.  It is awesome!  HighSoft, the owners say, 'Do you want to use Highstock for a personal or non-profit project? Then you can use Highchcarts for free under the  Creative Commons Attribution-NonCommercial 3.0 License. '", "num_user_post": " 70", "author": "turgo"}, {"date": "September 5, 2014 - 4:06 am", "content": "Holy Crap! This is absolutely wonderful! It's exactly what i've been looking for! I'm using it for my student lab webpage. I hope that's alright.  Thank you thank you.", "num_user_post": " 1", "author": "ntallari"}, {"date": "September 22, 2014 - 10:35 pm", "content": "My pleasure.  If you make upgrades, please share them.", "num_user_post": " 70", "author": "turgo"}, {"date": "December 26, 2014 - 10:53 am", "content": "Many thanks turgo for sharing your work.I've just used it for my composite BeeBug monitor display- see http://www.mecol.co.uk/P11.phpCheers!Geo", "num_user_post": " 9", "author": "geo3geo"}, {"date": "April 14, 2015 - 8:14 pm", "content": "Cool, Geo.I'm most interested in the weight stat.  It's interesting to consider how it measures when the bees are home or out working.  What is the Brood measure?", "num_user_post": " 70", "author": "turgo"}, {"date": "January 10, 2016 - 11:19 am", "content": "I think i have discovered a problem with this FANTASTIC viewer.First off, I absolutely love it...The problem I've found is that it does not handle channels higher than 65535.That number does look familiar doesn't it? (Hint: hFFFF)If i keep my viewed channels low, it works fine, but if i have a channels starting with 7 it mixes up the graphs, things fail.. etc.I think i Know what the problem is but i have no idea about HTML and JAVA, so I havent been able to fix it.Variable 'channelNumber' seems to be the problem but i cant find where its initialized on the code... A fix for this would be GREATLY appreciated.regards,G.", "num_user_post": " 8", "author": "gabrielb"}, {"date": "February 5, 2016 - 10:19 am", "content": "HelloI use the turgo script for 2 applications.For the first one it work very well.For the second, depending the lengh of historic, data is not displayed.If you display the last week the display is right.If you try to display the last day there is no data.Every days, ther is no data from 23 PM to 6 AM, that just normal.May be it is a problem on Thingspeak ?The data on thingspeak is okThie link for the dispay is here:http://thili.net/ruches/Blaise/index.htmlwhat is very stange is if I dowlload data or create csv file, data seasm to be good ...Many thanks for your help and thanks again for your very nice script !!!Thierry Vorms", "num_user_post": " 7", "author": "vorms"}]}, {"url": "https://community.thingspeak.com/forum/announcements/amazon-web-services-aws-issues/", "posts": [{"date": "September 23, 2015 - 10:50 am", "content": "Parts of ThingSpeak rely on Amazon Web Services (AWS). AWS had issues on Sunday, and is having intermittent issues now. As a result, some ThingSpeak features are experiencing failures.  You may see MATLAB code errors or errors saying that your code has timed out.  We are working with Amazon to resolve these issues.You can monitor AWS here: http://status.aws.amazon.com/ and specifcally the Amazon DynamoDB parts of Amazon.", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/announcements/two-new-thingspeak-apps-for-data-analysis-and-visualization/", "posts": [{"date": "August 20, 2015 - 9:21 pm", "content": "For the last several years, I have been collecting data with ThingSpeak from devices all around my house. I have been tracking temperature, humidity, light levels, outside weather data, my deep freezer’s temperature, the state of My Toaster, and air quality metrics. I just recently started to think about what all of this data really means to me and if it’s good data to begin with. Wouldn’t it be great if I could explore my data in ThingSpeak?  Well, I am happy to say that with the latest upgrade to ThingSpeak, you can do just that.We have been working with the MATLAB team at MathWorks to provide two new ThingSpeak Apps: MATLAB Analysis and MATLAB Visualizations. With these new built-in Apps, the ThingSpeak web service can automatically run MATLAB code. That makes it easier to gain insight into your data.Check out our full announcement: http://community.thingspeak.com/2015/08/you-have-collected-lots-of-iot-data/This is really big news for the ThingSpeak Community. I am really excited to see what you do with these new apps. I will share projects on the blog as they come in. Let’s find out together what all of this data means. Get started at https://ThingSpeak.com!", "num_user_post": " 402", "author": "Hans"}, {"date": "August 20, 2015 - 9:33 pm", "content": "can the matlab charts be dynamically updated?", "num_user_post": " 11", "author": "rayellam"}, {"date": "August 20, 2015 - 10:54 pm", "content": "For now, the MATLAB charts are refreshed every 10 minutes.", "num_user_post": " 2", "author": "ma11en"}, {"date": "August 21, 2015 - 12:03 pm", "content": "Hi Rayellam,Could you share more detail about why and how often you're looking for the MATLAB charts to be dynamically updated? For instance, what type of data are you collecting/viewing and what is your goal for visualizing the data? What might an acceptable refresh rate be?Thanks,Jeff", "num_user_post": " 3", "author": "Jeff Goodwin"}]}, {"url": "https://community.thingspeak.com/forum/announcements/want-to-help-us-make-thingspeak-work-better-for-you/", "posts": [{"date": "April 20, 2015 - 12:09 pm", "content": "In order to make ThingSpeak as easy to use as possible, we would like to get some input from the people who are using it!  And that's where you come in. We'd like to invite you to participate a very simple exercise that will give us some great insight into how we can make ThingSpeak easier to use.We have put together a card sort activity to help us better understand how to organize the various features available on ThingSpeak.  If you’d like to give us your feedback, go to https://aps3ltx4.optimalworkshop.com/optimalsort/177j6g82 and complete the sort!Thanks for your feedback and have fun,Hans", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/announcements/new-app-timecontrol/", "posts": [{"date": "September 27, 2014 - 2:11 pm", "content": "Control things based on the time of day... https://thingspeak.com/docs/timecontrol", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/announcements/database-upgrade/", "posts": [{"date": "January 30, 2014 - 8:30 pm", "content": "We are performing a database upgrade. The API for reading feeds will be down until the upgrade completes. We will be back shortly...", "num_user_post": " 402", "author": "Hans"}, {"date": "January 30, 2014 - 8:43 pm", "content": "Is this affecting posts as well?  I've been getting Status: 500 Internal Server Error for about the last three hours or so.", "num_user_post": " 35", "author": "JChristensen"}, {"date": "January 30, 2014 - 9:40 pm", "content": "All database operations are up and running now.", "num_user_post": " 402", "author": "Hans"}, {"date": "January 31, 2014 - 1:26 am", "content": "That explains the large gaps in my logged values I suppose. Maybe it would be handy (unless things are really suddenly urgent) to know up ahead that a database upgrade is coming up. Could we perhaps get a notifier for this ? A sort of 'general' react service that will inform users for major changes/outages etc. kind regardsCor Bee", "num_user_post": " 37", "author": "CorBee"}, {"date": "January 31, 2014 - 7:08 am", "content": "Indeed. Or did I miss the memo? I'd either email notification to all users or have somewhere that status could be checked.CorBee said That explains the large gaps in my logged values I suppose. Maybe it would be handy (unless things are really suddenly urgent) to know up ahead that a database upgrade is coming up. Could we perhaps get a notifier for this ? A sort of 'general' react service that will inform users for major changes/outages etc. kind regardsCor Bee", "num_user_post": " 35", "author": "JChristensen"}, {"date": "February 7, 2014 - 2:28 am", "content": "Since the upgrade I've noticed that multiple historical data querys appear to be returned faster using my multichannel web page.  Thanks!(http://community.thingspeak.com/forum/announcements/thingspeak-live-chart-multi-channel-second-axis-historical-data-csv-export/)", "num_user_post": " 70", "author": "turgo"}]}, {"url": "https://community.thingspeak.com/forum/announcements/api-for-public-thingspeak-channels/", "posts": [{"date": "December 18, 2013 - 12:02 pm", "content": "In order to help developers find open data inside of ThingSpeak Channels, we created a new API for searching the public ThingSpeak Channels.Here are the Public ThingSpeak Channels. We order the channels by activity and completeness. Channels may be tagged and this helps find data that you might find interesting for your application. We also have API commands that you can pass to the ThingSpeak Channel API to return the public ThingSpeak Channels in either JSON or XML format.Here are some examples:http://api.thingspeak.com/channels/public.json - Returns the Public ThingSpeak Channels in JSON formathttp://api.thingspeak.com/channels/public.xml - - Returns the Public ThingSpeak Channels in XML formathttp://api.thingspeak.com/channels/public.json?tag=temperature - Returns the Public ThingSpeak Channels in JSON format that match the tag, “temperature”", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/announcements/thingspeak-com-is-down/", "posts": [{"date": "November 12, 2013 - 3:30 pm", "content": "Please fix, I depend on your service!", "num_user_post": " 70", "author": "turgo"}, {"date": "November 13, 2013 - 3:28 pm", "content": "I am getting numerous instances of 'The page you are looking for is temporarily unavailable.Please try again later. 'Maybe half my data or so is getting through.What info you can share on this, ThingSpeak??", "num_user_post": " 35", "author": "JChristensen"}, {"date": "November 13, 2013 - 4:54 pm", "content": "Traffic has spiked over the past few days. We are adding a new server to the cloud to accommodate the new demand.", "num_user_post": " 402", "author": "Hans"}, {"date": "November 15, 2013 - 2:54 pm", "content": "Ditto, I get 'The page you are looking for is temporarily unavailable.' almost all the time. I understand that you must have funding issues as a free service, but some more information on your service status would be gratefully appreciated. If the service cannot be made reliable, then I will have to find an alternative.Thanks anyway, Anthony", "num_user_post": " 1", "author": "mcdonald_ajr"}, {"date": "December 3, 2013 - 6:51 pm", "content": "Hi,We recently made some major improvements to our service, so it should be much more stable now.lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/announcements/is-thingspeak-down/", "posts": [{"date": "June 19, 2013 - 2:22 am", "content": "When I ping the server it seems to be up but when I go to the page I keep getting:The page you are looking for is temporarily unavailable.Please try again later. I've tried this on both my mobile using the O2 internet and on my work PC and both are the same so fairly sure its not an ISP issue.The reason I ask is I am trying to log some test data from an application in austalia and lost about 19 hours of data from yesterday. I think the last update was around 10:45am GMT time.At first I thought it was a but in my processing App which sends data up to thingspeak but with the site being inaccesible and api.thingspeak.com giving the same message:The page you are looking for is temporarily unavailable.Please try again later. Now I am not so sure.", "num_user_post": " 54", "author": "chrisjmears"}]}, {"url": "https://community.thingspeak.com/forum/announcements/internet-of-things-contest-aka-the-easiest-contest-ever-part-2/", "posts": [{"date": "June 5, 2013 - 8:45 pm", "content": "We just announced a new contest. http://community.thingspeak.com/2013/06/internet-of-things-contest-the-easiest-contest-ever-part-2/All you have to do is build a project using a ThingSpeak web service, post a demo / how-you-done-it video on YouTube or Vimeo, and tell us about it. We are giving away 20 gift certificates to SparkFun valued at $50 each. And… selecting our favorite projects for bonus prizes. Leave a comment with questions. This contest is open to anyone, so Sign Up for ThingSpeak and get going!", "num_user_post": " 402", "author": "Hans"}]}]}