{"url": "https://community.thingspeak.com/forum/announcements/page-3/", "threads": [{"url": "https://community.thingspeak.com/forum/announcements/best-open-source-internet-of-things-project-for-2012/", "posts": [{"date": "December 16, 2012 - 10:22 pm", "content": "We wanted to send you a quick note before the Holidays and ask for your vote. We are thankful that you are users of the quickly growing ThingSpeak community. A way that you can help us is to vote for ThingSpeak as the Best Internet of Things project of 2012. All that you need to do is to go here and vote for ThingSpeak. No registration is required. Just 2 clicks - one on the link and one next to ThingSpeak (scroll down). While you are there, check out other great projects and maybe that will inspire you to create a project next year.The competition is tough as most of the projects nominated are hardware. We are in a unique spot where everything listed works with ThingSpeak! That in of itself is the cool part to us.Thanks,Hans PS.Vote here for CheerLights too. CheerLights is huge network of lights linked together. This project uses ThingSpeak and TweetControl to change the colors of 1000's of lights all around the world at the same time.", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/announcements/new-features-coming-soon/", "posts": [{"date": "June 19, 2012 - 5:47 pm", "content": "Stay tuned... we will be upgrading ThingSpeak - the first round of upgrades will happen soon and these include many improvements to the data importer and creates new custom public / private views of the a ThingSpeak Channel.", "num_user_post": " 402", "author": "Hans"}, {"date": "June 20, 2012 - 4:01 pm", "content": "We are deploying... ", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/announcements/updating-thingspeak/", "posts": [{"date": "December 14, 2011 - 1:42 am", "content": "We are updating ThingSpeak.com tonight, will be back shortly. New features coming soon...", "num_user_post": " 402", "author": "Hans"}]}]}