{"url": "https://community.thingspeak.com/forum/arduino/page-13/", "threads": [{"url": "https://community.thingspeak.com/forum/arduino/losing-the-first-field/", "posts": [{"date": "July 15, 2011 - 6:12 pm", "content": "Just getting started here, have things working fairly well, or mostly.  Sending three fields, the first one doesn't seem to be making it, field2 and field3 are fine.  field1 is just empty or null, <field1 nil='true'/> in the XML view.Below is the POST, which I trapped by replacing client.print with Serial.print and then copying it from the monitor window.  I'm not seeing what the problem is.  My channel is http://www.thingspeak.com/channels/878POST /update HTTP/1.1Host: api.thingspeak.comX-THINGSPEAKAPIKEY: XXXXXXXXXXXXXXXXContent-Type: application/x-www-form-urlencodedContent-Length: 34Connection: closefield1=1214&field2=3&field3=70.8 ", "num_user_post": " 35", "author": "JChristensen"}, {"date": "July 15, 2011 - 7:28 pm", "content": "Found the problem, wasn't getting the content length quite right.  Picky, this POST... ", "num_user_post": " 35", "author": "JChristensen"}]}, {"url": "https://community.thingspeak.com/forum/arduino/bad-request-with-2-fields-on-arduino/", "posts": [{"date": "July 2, 2011 - 1:55 am", "content": "From Nick:I’m getting a the following message when posting to more than one field:HTTP/1.1 400 Bad RequestServer: nginx/0.8.53Date: Wed, 29 Jun 2011 10:41:21 GMTContent-Type: text/html; charset=utf-8Transfer-Encoding: chunkedConnection: closeStatus: 400Cache-Control: no-cache100…disconnected.this is the line I’ve modified:if(!client.connected() && (millis() – lastConnectionTime > updateInterval)){updateThingSpeak(“field1=” + analogPin0 + “&field2=” + analogPin1);}It works when I only use field 1. What’s the problem here? ", "num_user_post": " 402", "author": "Hans"}, {"date": "July 4, 2011 - 6:04 am", "content": "I've made the channel public here:https://www.thingspeak.com/channels/812", "num_user_post": " 2", "author": "nickv"}]}, {"url": "https://community.thingspeak.com/forum/arduino/how-to-verify-data-is-received/", "posts": [{"date": "March 2, 2011 - 4:40 pm", "content": "Hi,I guess I am the first one to post a question about the use of ThingSpeak with an Arduino. I hope there is someone that has some prior experience, since I am running into a few issues after using the tutorial to modify my existing code. I have added the code almost exactly as per the tutorial on this website, obviously I modified the data to be sent to ThingSpeak. I also added some Serial.println here and there to see what part of the code is being executed and I get so far that in the Serial monitor of the Arduino IDE (using v0022 on Ubuntu 10.10) I see the message 'Connected to ThingSpeak...' which happens at the beginning of the updateThingSpeak(), and I also see 'Data sent to ThingSpeak...', which I added at the very last line of updateThingSpeak() in the part where the connection is succesful, otherwise a 'Connection failed' would have been shown. I would expect that means that the arduino sent sensor data to my ThingSpeak channel, but unfortunately, I do not see anything popping up in my web interface when I try to make charts. This could be:a) I am doing something wrong (very likely 😉 )b) the data is indeed received, but not (yet?) available to make chartsc) Arduino does connect, but something is wrong in the communicationI noticed that I never had to fill in my feed id anywhere, but I guess that information is locked in the writeApiKey, right? Anyone got a clue how to debug this? Regards,Arno Jansen p.s. the service seems awesome, hope I can get it to work soon!", "num_user_post": " 3", "author": "Sindono.com"}, {"date": "March 2, 2011 - 6:16 pm", "content": "Thanks for the kind comments. Now, let's hope we can get your Arduino sketch working. The tutorial was written with Arduino 22 on Windows. Now sure if that makes a difference... The Channel ID is encoded in the Write API Key, that way a private channel can stay private. If everything goes to plan the data should be available right away in your feed and charts. Caching only kicks in when you return more than 100 results. Can you ping the Arduino's IP address? Atleast so we can verify connectivity and cross that off of the list.", "num_user_post": " 402", "author": "Hans"}, {"date": "March 18, 2011 - 8:02 pm", "content": "Well, what can I say, it works!See this channel: https://www.thingspeak.com/channels/157 But, the data you are seeing there is testdata and does not contain real sensor data yet. Somehow, I can't seem to build a proper string to send to ThingSpeak. I receive the data as comma separated values (i.e. 10.00,666,123,1,0,10). And the comma's should be replaced by 'field1=', '&field2=', '&field3=', etc. I have managed to send this same data to my own webserver and a Pachube feed (http://www.pachube.com/feeds/11261), so I have some homework to do... Any hints appreciated 😉 Regards,Arno ", "num_user_post": " 3", "author": "Sindono.com"}, {"date": "March 23, 2011 - 12:38 am", "content": "If you are going to send sensor data, all you have to do is send the fields in any order using the keys. 10.00,666,123,1,0,10 => field1=10.00&field2=666&field3=123&field4=1&field5=0&field6=10 You can pass the key as an X-header or as a another parameter. … &key=[write api key] Make sure content type is:Content-Type: application/x-www-form-urlencoded Otherwise, without seeing your code, I am not sure what is breaking down. Can you post some where? I can then get to the bottom of it.", "num_user_post": " 402", "author": "Hans"}, {"date": "March 23, 2011 - 3:20 pm", "content": "Hi!  Thanks for the reply. I understand what needs to happen and the code works fine, except my string-manipulation-skills (or lack thereof) have not been able to come up with a solid solution to replace the comma's into 'field1=', then '&field2=', etc. I'd love to share the code, however I am nowhere near the code now, so will have to that some time later...", "num_user_post": " 3", "author": "Sindono.com"}]}]}