{"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/page-8/", "threads": [{"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/talk-back-response-problem/", "posts": [{"date": "March 17, 2016 - 3:49 am", "content": "hello everyone,I am trying to get a TalkBack Command using Arduino IDE but i am not getting any response on Serial Monitor .. I have tested the following GET request with the Poster. it works perfectly. https://api.thingspeak.com/talkbacks/7441/commands/1145081?api_key=WSMCMVFUJBI6Z115[code]#include const char* ssid     = 'Wing';const char* password = 'wnRn56';String apiKey = 'WSMCMVFUJBI6Z115';const char* host = 'api.thingspeak.com';// Use WiFiClient class to create TCP connectionsWiFiClient client;int t = 200;int h = 400; void setup() {  Serial.begin(115200);  delay(100);  // We start by connecting to a WiFi network  Serial.println();  Serial.println();  Serial.print('Connecting to ');  Serial.println(ssid);  WiFi.begin(ssid, password);  while (WiFi.status() != WL_CONNECTED) {    delay(500);    Serial.print('.');  }  Serial.println('');  Serial.println('WiFi connected');  Serial.println('IP address: ');  Serial.println(WiFi.localIP());}void loop() {  Serial.print('connecting to ');  Serial.println(host);if (client.connect(host,80)) { // '184.106.153.149' or api.thingspeak.comString postStr = 'GET /talkbacks/7441/commands/1145000?api_key=WSMCMVFUJBI6Z115 HTTP/1.1';//client.print('POST /update HTTP/1.1');client.print(postStr);client.print('Host: api.thingspeak.com');client.print('Connection: close');//client.print('X-THINGSPEAKAPIKEY: '+apiKey+'');//client.print('Content-Type: application/x-www-form-urlencoded');//client.print('Content-Length: ');//client.print(postStr.length());client.print('');}client.stop();  // Read all the lines of the reply from server and print them to Serial  while(client.available()){    //String line = client.readStringUntil('');    //Serial.print(line);    char c = client.read();    Serial.print(c);  }  Serial.println();  Serial.println('closing connection');   delay(15000);}[/code]i think something is wrong with my GET requestWhat is the correct way to send Talkback GET  request ?", "num_user_post": " 1", "author": "parasbhanot"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/table-creation-from-esp8266/", "posts": [{"date": "March 4, 2016 - 11:05 am", "content": "I want to create a table in thingspeak  and update it from the values i'm getting from esp8266.How can i do that?", "num_user_post": " 1", "author": "Harikishore"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/suddenly-no-entries-from-esp8266-to-thingspeak/", "posts": [{"date": "February 8, 2016 - 2:46 pm", "content": "I'm a real real real newly.And today I managed to get some data from the esp8266 to thingspeak. I followed the following tutorial http://www.arduinesp.com/thingspeakWith this code:http://www.arduinesp.com/arduinesp/wp-content/uploads/2015/04/ThingspeakESP8266.txtI changed my ssid and password and the API i received after signing to thingspeak and made a channel with 2 fields. I also changed DHT11 to DHT22 and changed the pin to '0'This morning i got some entry's but that stopped a couple of hours ago and I don't know why.I can ping to my esp8266 and when I use the following code with my browser it will show up in thingspeak.https://api.thingspeak.com/update?api_key=MY_API_CODE&field1=7I also changed API several times with no luck 🙁 Serial monitor does output correctly likeTemperature: 21.20 degrees Celcius Humidity: 46.00% send to ThingspeakWaiting...Temperature: 21.30 degrees Celcius Humidity: 46.10% send to ThingspeakWaiting...Temperature: 21.30 degrees Celcius Humidity: 46.10% send to ThingspeakWaiting...Temperature: 21.30 degrees Celcius Humidity: 46.10% send to ThingspeakWaiting...Temperature: 21.30 degrees Celcius Humidity: 46.10% send to ThingspeakWaiting...I don't know why my esp8266 data is not visible anymore on TS.com", "num_user_post": " 3", "author": "lxx33"}, {"date": "February 8, 2016 - 3:34 pm", "content": "Hi, same problem here.I posted a reply :http://community.thingspeak.com/forum/thingspeak-api/thindspeak-api-not-updating-to-my-channel/#p2653not using wifi but the same behavior... if i type in the browser it works.", "num_user_post": " 8", "author": "oskimark1"}, {"date": "February 8, 2016 - 7:28 pm", "content": "Please try again and let us know if anything else doesn't look right. What was odd is that everything worked in the browser.", "num_user_post": " 402", "author": "Hans"}, {"date": "February 9, 2016 - 4:48 am", "content": "I will try later this day. Tnx Hans", "num_user_post": " 3", "author": "lxx33"}, {"date": "February 9, 2016 - 8:55 am", "content": "Somehow it now starts working again.Don't know why but, am happy it does hahaha", "num_user_post": " 3", "author": "lxx33"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/expected-responses-from-esp8266-after-posting-data-to-channel/", "posts": [{"date": "April 7, 2015 - 7:57 am", "content": "I am having success posting data to multiple fields of the one channel in thinkspeak.I have an issue that after several 'posts' to a channel, thinkspeak doesn't send back a 'disconnect' represented by the ESP8266 as an 'Unlink'. When it 'works', after post of data, the ESP8266 sends the text 'Unlink'.  I'm assuming (Lack of good ESP8266 Documentation) that this signifies the host, in this case thinkspeak, has send a disconnect after receiving the channel data. The problem I experience is that I sometimes don't receive this 'Unlink' from ESP8266 after successfully updating a channel. I don't know if it's the ESP8266 not sending the 'Unlink' or it's thinkspeak not requesting a disconnect.Here is a Serial terminal listing of two successful postings, with 'Unlink' and the third one with no 'Unlink'- AT+CIPSTART=0,'TCP','api.thingspeak.com',80OKLinkedAT+CIPSEND=0,58> GET /update?key=xxxxxBIBAMJMCU7E&field1=23.5&field2=64.5SEND OK+IPD,0,1:3OKOKUnlink(one minute later- )AT+CIPSTART=0,'TCP','api.thingspeak.com',80OKLinkedAT+CIPSEND=0,58> GET /update?key=xxxxxBIBAMJMCU7E&field1=23.5&field2=64.8SEND OK+IPD,0,1:4OKOKUnlink(one minute later- )AT+CIPSTART=0,'TCP','api.thingspeak.com',80OKLinkedAT+CIPSEND=0,58> GET /update?key=xxxxxBIBAMJMCU7E&field1=23.6&field2=64.9SEND OK+IPD,0,1:5OKAfter this last +IPD and subsequent 'OK', I never receive the unsolicited 'Unlink' that I'm relying on. Either thinkspeak is not sending a disconnect to the ESP8266, or the ESP8266 is receiving it and not passing it on by way of a 'Unlink' text. Does this mean anything to anyone?.   I am using my own custom PIC 24 board with MPLABX  C.  I'm not using Arduino.", "num_user_post": " 1", "author": "tom_croft402"}, {"date": "April 16, 2015 - 9:32 am", "content": "i am very new to thingspeak. please tell me how to communicate between esp8266 and thingspeak?Well I got my esp8266 sensor output correctly.And I have log in on thinkspeak. i have created channel but what is next.", "num_user_post": " 1", "author": "ashwinispatil"}, {"date": "May 2, 2015 - 2:44 am", "content": "Thank you Tom for the details, i was stuck down a hole until i read your post here ", "num_user_post": " 11", "author": "rayellam"}, {"date": "June 14, 2015 - 5:07 pm", "content": "Tom since I am having no luck in updating my ThingSpeak channel, even using your example in post one. Could you please post your AT sequence for the setup of the esp8266?Since I am not able to update with your string and the string works with your module then it must be the wrong setup in my module. ( my firmware is 0018000902), I always receive '+IPD,0,1:0'  no metter how many times I send the string.I am driving the esp module via a pic18F2620 @ 32 MHz.Thank you in advance for caring.CheersAlberto", "num_user_post": " 7", "author": "R_Alberto"}, {"date": "January 18, 2016 - 2:35 pm", "content": "Has Anyone managed to make this work recently? I think its not running so well now. Whenever I request the GET request it returns with:ERRORSEND OK+IPD,4,5:32153OKOKUnlinkI've tried all different formats GET http://api.thingspeak.com/update?api_key=%5Bapikey%5D&field1=800 GET http://api.thingspeak.com/update?key=%5Bapikey%5D&field1=800 GET http://api.thingspeak.com/update?key=%5Bapikey%5D&field1=800 GET http://api.thingspeak.com/update?key=%5Bapikey%5D&field1=800GET =/update?key=[apikey]&field1=800GET =/update?key=[apikey]&field1=800The thingspeak chart manages to update a point when I put the link into a browser http://api.thingspeak.com/update?key=%5Bapikey%5D&field1=800When I use the arduino + ESP, thingpeak recognises an input as I can see that the last Updated value become 'less than a minute ago' however the plot isn't added to the field 1 chart. :s", "num_user_post": " 2", "author": "yukimach"}, {"date": "January 27, 2016 - 5:39 am", "content": "@TomWhy are you relying on 'Unlink' string? Is that any special to you or you perform any action based on it?@yukimachI am able to update my channel and every graph, but my code is quite big, I am not sure how will it help you..", "num_user_post": " 2", "author": "Syed Rafay"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/thinghttp-keep-changing-get-response/", "posts": [{"date": "January 8, 2016 - 10:51 pm", "content": "I've been running a test with a very precise code which counts the lines returned by ThingHTTP GET so I was able to detect strange changes over time -- in the past month they have changed TWICE the format of responses to GET requests.Specifically the headers, it just changed again this week from total of 15 lines to 14 lines? I don't know what additional line was being sent in mid-December since I didn't save a sample response but I know they decreased the number of headers by 1 line this week.Anyone else seeing this?", "num_user_post": " 8", "author": "bubba198"}, {"date": "January 11, 2016 - 12:04 pm", "content": "Hi,We're working to track down what's going on.  We haven't changed ThingSpeak itself, but clearly something has changed.  By chance, have you captured the GET responses from before the change?  It would be interesting to see what they used to look like, and what they look like now.As an aside, I released a new version of the Arduino Library that handles the change in the response format, and should be resilient to future changes.  See the post here:http://community.thingspeak.com/forum/arduino/thingspeak-communication-library-for-arduino/", "num_user_post": " 47", "author": "Rob Purser"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/how-to-send-data-from-thingspeak-to-esp8266-arduino-using-thinghttp/", "posts": [{"date": "January 4, 2016 - 6:37 am", "content": "Hi. I have made Arduino Kit acting as weather station. It sends data of the sensors connected (DHT11 & LDR) to the ThingSpeak web-server.Now I want to perform some actions according to data on ThingSpeak Server ( like if temperature exceeds turn on fan e.t.c).I've searched and I found that there's a React App on thingspeak which will trigger event if data exceeds some values,The problem where I got stuck is that I want to send signal from thingspeak webserver to my ESP8266 (arduino) kit to turn on/off the device connected to relay on arduino.I've figured out that there's also a ThingHTTP feature which sends HTTP requestBut don't know how to send request/signal to my kit to perform some actions.I've already spent my 2 months building this project, and now just stuck in the last part . Please give your valuable suggestions and solutions.", "num_user_post": " 2", "author": "Syed Rafay"}, {"date": "January 7, 2016 - 1:05 pm", "content": "If your kit is behind a NAT then you'll need to know the IP address on the public side and have your GW/NAT forward to your device from the outside.I think ... I'm new to this particular tech but that is how I solved it before.", "num_user_post": " 2", "author": "lballaty"}, {"date": "January 7, 2016 - 11:33 pm", "content": "Alternatively you can consider the Talkback app- this allows you to send a text string in response to a POST command from the ESP8266.  This will require the ESP8266 to poll thingSpeak rather than listen for an incoming request.  Whether this is more convenient than the suggestion by Iballaty depends on your application.If your esp8266 is doing updates anyway you can combine an update with a talkback response.  https://au.mathworks.com/help/thingspeak/talkback-app.html#update_and_executeYou may need to write a matlab analysis app to interface your React with your Talkback.   Matlab's 'webwrite' command is useful as I dont think there is a thingspeak wrapper function for talkback like there is for channel read and update.", "num_user_post": " 271", "author": "rw950431"}, {"date": "January 8, 2016 - 11:01 pm", "content": "What you are asking for is a game changer. You would need mqtt https://learn.adafruit.com/adafruit-io/arduinoIt's a totally different game; although library does exist the entire back-end is a different concept from ThingSpeak. Again this mqtt business is the only way to send data to IoT devices without being able to reach them via IP (behind NAT). For example that will automatically qualify all mobile IoT things since the cell carriers, although assigning public IPs to the customer do block any and all incoming traffic from the 'outside' world and my ESP8266 connected to an AT&T hot spot is basically unreachable from the Internet directly. So with mqtt the thing maintains persistent connection to the mqtt broker and when I send a message via the broker that live connection is how the message gets delivered to the ESP in real time without the thing having to poll some php script all the time for 'new data'", "num_user_post": " 8", "author": "bubba198"}, {"date": "January 9, 2016 - 1:54 am", "content": "MQTT still requires a internet connection between client and broker- it avoids the NAT issues by having the client (behind NAT) initiate the connection.  Last time I looked at MQTT the code required to maintain the connection, handle drop-outs etc seemed harder than it should be- perhaps things are better now.Whilst its possible to write a Thingspeak to MQTT bridge it would be great if Thingspeak supported this natively..", "num_user_post": " 271", "author": "rw950431"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/error-on-sending-data-to-esp8266-module/", "posts": [{"date": "November 26, 2015 - 12:30 pm", "content": "I try to connect the esp8266-01 module to thingspeak using http post. When I start the this code, it shows just one value and then 'AT+CIPCLOSE' Which means that it doesn't find '>'.Please help me if I'm missing something.My code follows, #include SoftwareSerial.h#include stdlib.h//I don't know why I can't use '' above.String apiKey = '9ZLX2FFEMQ79G9CZ';SoftwareSerial ser(0, 1); // RX, TX// this runs oncevoid setup() {  // enable debug serial  Serial.begin(9600);  // enable software serial    ser.begin(9600);  // reset ESP8266  ser.println('AT+RST');}// the loopvoid loop() {  int val;  val = analogRead(A0);  char buf[16];  String strSound = dtostrf(val, 4, 1, buf);  Serial.println(strSound);  // TCP connection  String cmd = 'AT+CIPSTART='TCP','';  cmd += '184.106.153.149'; // api.thingspeak.com  cmd += '',80';  ser.println(cmd);  if(ser.find('Error')){    Serial.println('AT+CIPSTART error');    return;  }  // prepare GET string  String getStr = 'GET /update?key=';  getStr += apiKey;  getStr +='&field6=';  getStr += String(strSound);  getStr += '';   // send data length  cmd = 'AT+CIPSEND=';  cmd += String(getStr.length());  ser.println(cmd);Serial.println(cmd);Serial.println(getStr);  if(ser.find('>')){    ser.print(getStr);  }  else{    ser.println('AT+CIPCLOSE');    // alert user    Serial.println('AT+CIPCLOSE');  }  // thingspeak needs 15 sec delay between updates  delay(16000);}", "num_user_post": " 1", "author": "nonoise1"}, {"date": "November 26, 2015 - 4:34 pm", "content": "@nonoise1I have not tried your code, but I would do 2 things- - I would write#include ?SoftwareSerial.h?#include ?stdlib.h?note the ? sourronding the name of the files must be in the left side 'less than symbol' and in the right side 'greater than symbol'- - You try to use hard UART (Serial.)  and a software one (Ser.)SoftwareSerial ser(0, 1); // RX, TXBUT you only use pins 1 and 0 for Tx and Rx  ... and you are mixing both UARTs and sending and receiving all serial comunication to BOTH the ESP8266 and I think the Arduino serial monitor.You must use diferent pins for Serial and Ser. Use pins 0 and 1 (fixed for hard UART) and conect that to ESP8266DIFFERENT pins for soft UART (Not 0 nor 1) maybe pins 2 and 3  and connect an USB to serial converter to those pins and put that COM in the arduino serial monitor looking for the BAUD and line ending.I hope this can help you HS", "num_user_post": " 91", "author": "piajola"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/how-to-read-responses-to-a-get-request/", "posts": [{"date": "November 16, 2015 - 12:46 pm", "content": "Hi everyone,I'm using native ESP Arduino code (not the AT firmware) and all is well except the API response to GET includes ton of headers, for example this is what I get in response to GET using ThingHTTP app for simple web site scraping:HTTP/1.1 200 OKContent-Type: text/html; charset=utf-8Transfer-Encoding: chunkedConnection: closeStatus: 200 OKX-Frame-Options: ALLOWALLAccess-Control-Allow-Origin: *Access-Control-Allow-Methods: GET, POST, PUT, OPTIONS, DELETE, PATCHAccess-Control-Allow-Headers: origin, content-type, X-Requested-WithAccess-Control-Max-Age: 1800ETag: 'f7635f54b0bd41fb88a1bf6d98af3c5f'Cache-Control: max-age=0, private, must-revalidateX-Request-Id: 32432325324-10aa-42e6-12312141323412312X-Runtime: 0.267168X-Powered-By: Phusion Passenger 4.0.57Date: Mon, 16 Nov 2015 00:59:48 GMTServer: nginx/1.9.3 + PhusionMy value follows all that output so I wonder whether:a) there's a way to suppress the headers using ThingHTTP API somehow?b) good way to parse the API's output stream and get to my value?I'm using the sample ThingHTTP app example for getting data from Google Finance! It works like a charm using curl on Linux but with ESP 8266 code I get much more than I bargained for...Thanks", "num_user_post": " 8", "author": "bubba198"}, {"date": "November 16, 2015 - 2:24 pm", "content": "Hi,You can suppress HTTP headers by adding 'headers=false' to the request: https://thingspeak.com/docs#headers .lee", "num_user_post": " 457", "author": "lee"}, {"date": "November 16, 2015 - 7:21 pm", "content": "Thank you, that did work and *REDUCED* the headers but still had ton of unwanted data to get rid of. Ultimately I ended up figuring out which line of the response contains my stuff and only copied that one:int lines_received = 0;  while(client.available()) {    String line = client.readStringUntil('');   if (lines_received == 14) { // this is the 14th line with text coming as a result of the GET request, the lines before 14 are headers etc, after 14 who knows what...    module1640.setDisplayToString(line.substring(1,line.length()));    }    lines_received++;  }", "num_user_post": " 8", "author": "bubba198"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/inconsistent-acknowledgement-after-the-command-atcipsend/", "posts": [{"date": "October 23, 2015 - 11:55 am", "content": "I try to connect the esp8266-01 module to thingspeak using http post. When I start the TCP Server and send the data I receive acknowledgement from thingspeak only thrice in 10 times. If I receive the acknowledgement '>' there is no problem and its displayed on my channel. Please help me if I'm missing something.void connect(){softSerial.println('AT+RST');  delay(2000);  softSerial.println('AT+CWMODE=1');  delay(2000);  String cmd='AT+CWJAP='';  cmd+=SSD;  cmd+='','';  cmd+=PAS;  cmd+=''';  softSerial.println(cmd);  delay(3000);}void sendData(){   String cmd = 'AT+CIPSTART='TCP',''; //start TCP server    cmd += DST_IP;    cmd += '',80';    softSerial.println(cmd);    delay(5000);    if(softSerial.available() > 0)      {        String ts= dateTime();        String req = 'field1=' + String(data1) + '&field2=' + String(data2) + '&created_at=' + ts + '+05:30' ;         cmd = 'POST /update HTTP/1.1'; //post the values in http server        cmd += 'Host:'; //destination ip        cmd += DST_IP;        cmd += '';        cmd += 'Connection:close';';        cmd += 'X-THINGSPEAKAPIKEY:write_key';        cmd += 'Content-Type:application/x-www-form-urlencoded';        cmd += 'Content-Length:';        cmd += req.length(); //length of the string sent to http server        cmd += '';        cmd += req;        //softSerial.print('cmd='); softSerial.println(cmd);softSerial.println('cmd end');        softSerial.print('AT+CIPSEND='); //send data        softSerial.println(cmd.length());          if(softSerial.available())        {          if((softSerial.find('>'))) //server acknowledgement          {            //Serial.println('>');            softSerial.println(cmd);}}}", "num_user_post": " 1", "author": "1rn07ee058"}, {"date": "October 23, 2015 - 12:09 pm", "content": "Hi,ThingSpeak will rate limit your requests and only allow one channel update every 15 seconds: https://thingspeak.com/docs/channels#rate_limits .  If y ou change your delay from 5000 ms to 15000 ms, then you should be able to successfully write data each time.lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/problem-to-sending-getpost-request/", "posts": [{"date": "October 15, 2015 - 2:59 pm", "content": "(using arduino uno, esp8266, Arduino 1.6.5 sketch)I am trying to send GET request through AT command, here are my commands bellow;AT+CWJAP='*******','*******'AT+CIPSTART='TCP','shotlu.usrs0.com',80AT+CIPSEND=73 (length of the url)>GET /receiver.php?apples=56&oranges=23 HTTP/1.1Host: shotlu.usrs0.com*******************************/******************************But after sending the url it's giving me this message;GET /receiver.php?apples=56&oranges=23 HTTP/1.1Host: shotlu.usrs0.combusy s...SEND OK+IPD,168:400 Bad Request400 Bad RequesthostingOKCLOSEDOKany guess why this happened? ", "num_user_post": " 2", "author": "asadujjaman"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/lightdeep-sleep-dht1122/", "posts": [{"date": "July 4, 2015 - 7:19 pm", "content": "I am working on a dht11/22 temp and humidity sensor that uploads to thingspeak.Needs some more work, feel free to make pull requests and forks as necessaryMy fork;https://github.com/Tom-Neverwinter/esp8266-dht11based on;https://github.com/bpangrati/esp8266-dht11", "num_user_post": " 1", "author": "Tom_Neverwinter"}, {"date": "September 29, 2015 - 6:20 am", "content": "Tom_Neverwinter said I am working on a dht11/22 temp and humidity sensor that uploads to thingspeak.Needs some more work, feel free to make pull requests and forks as necessaryMy fork;https://github.com/Tom-Neverwinter/esp8266-dht11based on;https://github.com/bpangrati/esp8266-dht11I have all the time that message:Error reading from DHT. retry 0Error reading from DHT. retry 1Error reading from DHT. retry 2Error reading from DHT. retry .....the dht11 and dht22 same", "num_user_post": " 19", "author": "kniazio"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/esp8266ds18b20/", "posts": [{"date": "September 13, 2015 - 4:03 pm", "content": "Does not update the temperature thingspeak.ESPlorer code:Communication with MCU...Got answer! AutoDetect firmware...NodeMCU firmware detected.=node.heap()stdin:2: unexpected symbol near '='> Last temp: 257500Temp:25.7500 CSending data to thingspeak.comClosing connectionGot disconnection...Last temp: 252500Temp:25.2500 CSending data to thingspeak.comClosing connectionGot disconnection...my configuration:init.lua--init.luaprint('Setting up WIFI...')wifi.setmode(wifi.STATION)--modify according your wireless router settingswifi.sta.config('my-ssid','my-password')wifi.sta.connect()tmr.alarm(1, 1000, 1, function()if wifi.sta.getip()== nil thenprint('IP unavaiable, Waiting...')elsetmr.stop(1)print('Config done, IP is '..wifi.sta.getip())dofile('ds1820.lua')endend)ds1820.lua-- Measure temperature and post data to thingspeak.com-- 2014 OK1CDJ--- Tem sensor DS18B20 is conntected to GPIO0--- 2015.01.21 sza2 temperature value concatenation bug correctionpin = 3ow.setup(pin)counter=0lasttemp=-999function bxor(a,b)   local r = 0   for i = 0, 31 do      if ( a % 2 + b % 2 == 1 ) then         r = r + 2^i      end      a = a / 2      b = b / 2   end   return rend--- Get temperature from DS18B20function getTemp()      addr = ow.reset_search(pin)      repeat        tmr.wdclr()      if (addr ~= nil) then        crc = ow.crc8(string.sub(addr,1,7))        if (crc == addr:byte(8)) then          if ((addr:byte(1) == 0x10) or (addr:byte(1) == 0x28)) then                ow.reset(pin)                ow.select(pin, addr)                ow.write(pin, 0x44, 1)                tmr.delay(1000000)                present = ow.reset(pin)                ow.select(pin, addr)                ow.write(pin,0xBE, 1)                data = nil                data = string.char(ow.read(pin))                for i = 1, 8 do                  data = data .. string.char(ow.read(pin))                end                crc = ow.crc8(string.sub(data,1,8))                if (crc == data:byte(9)) then                   t = (data:byte(1) + data:byte(2) * 256)         if (t > 32768) then                    t = (bxor(t, 0xffff)) + 1                    t = (-1) * t                   end         t = t * 625                   lasttemp = t         print('Last temp: ' .. lasttemp)                end                tmr.wdclr()          end        end      end      addr = ow.search(pin)      until(addr == nil)end--- Get temp and send data to thingspeak.comfunction sendData()getTemp()t1 = lasttemp / 10000t2 = (lasttemp >= 0 and lasttemp % 10000) or (10000 - lasttemp % 10000)print('Temp:'..t1 .. '.'..string.format('%04d', t2)..' C')-- conection to thingspeak.comprint('Sending data to thingspeak.com')conn=net.createConnection(net.TCP, 0)conn:on('receive', function(conn, payload) print(payload) end)-- api.thingspeak.com 184.106.153.149conn:connect(80,'184.106.153.149')conn:send('GET /update?key=MYAPIKEY&field1='..t1..'.'..string.format('%04d', t2)..' HTTP/1.1')conn:send('Host: api.thingspeak.com')conn:send('Accept: */*')conn:send('User-Agent: Mozilla/4.0 (compatible; esp8266 Lua; Windows NT 5.1)')conn:send('')conn:on('sent',function(conn)                      print('Closing connection')                      conn:close()                  end)conn:on('disconnection', function(conn)                                print('Got disconnection...')  end)end-- send data every X ms to thing speaktmr.alarm(0, 60000, 1, function() sendData() end )Please Help Me", "num_user_post": " 19", "author": "kniazio"}, {"date": "September 14, 2015 - 9:02 am", "content": "kniazio,In the following line:conn:send('GET /update?key=MYAPIKEY&field1='..t1..'.'..string.format('%04d', t2)..' HTTP/1.1I want to confirm that have you replaced 'MYAPIKEY' with the destination Channel's API Key?", "num_user_post": " 4", "author": "hans"}, {"date": "September 14, 2015 - 10:44 am", "content": "jklol said kniazio,In the following line:conn:send('GET /update?key=MYAPIKEY&field1='..t1..'.'..string.format('%04d', t2)..' HTTP/1.1I want to confirm that have you replaced 'MYAPIKEY' with the destination Channel's API Key?I do not really understand.I typed Write your API KeyWhere do I find another API Key", "num_user_post": " 19", "author": "kniazio"}, {"date": "September 14, 2015 - 11:35 am", "content": "kniazio,From the ThingSpeak Documentation (https://thingspeak.com/docs/channels#api_keys): Write API KeyUse the Write API Key to update a channel. If your Write API Key is compromised you can generate a new key. If you use MATLAB® Analysis or MATLAB® Visualization, the API info is displayed in the right pane of the app. To find your Write API Key:•Click Channels > My Channels.•Select the channel to update.•Select API Keys tab.Read API KeyThe Read API Key enables your application to read data from the API. You can generate multiple Read API Keys for different applications.To get a Read API Key:•Click Channels > My Channels.•Select the channel to update•Select API Keys tab.•Click  Generate New Read API Key.For example, if I had the channel 123I would find the Channel's read/write api keys at the following page (after signing in)https://thingspeak.com/channels/123/api_keys", "num_user_post": " 4", "author": "hans"}, {"date": "September 14, 2015 - 1:03 pm", "content": "jklol said kniazio,From the ThingSpeak Documentation (https://thingspeak.com/docs/channels#api_keys): Write API KeyUse the Write API Key to update a channel. If your Write API Key is compromised you can generate a new key. If you use MATLAB® Analysis or MATLAB® Visualization, the API info is displayed in the right pane of the app. To find your Write API Key:•Click Channels > My Channels.•Select the channel to update.•Select API Keys tab.Read API KeyThe Read API Key enables your application to read data from the API. You can generate multiple Read API Keys for different applications.To get a Read API Key:•Click Channels > My Channels.•Select the channel to update•Select API Keys tab.•Click  Generate New Read API Key.For example, if I had the channel 123I would find the Channel's read/write api keys at the following page (after signing in)https://thingspeak.com/channels/123/api_keysI do not want to only read information from and write information urzaądzenia esp8266I wrote it in the first postMy device sends temperature readings-- api.thingspeak.com 184.106.153.149conn:connect(80,'184.106.153.149')conn:send('GET /update?key=ID9D358UQUxxxxxx&field1='..t1..'.'..string.format('%04d', t2)..' HTTP/1.1')conn:send('Host: api.thingspeak.com')conn:send('Accept: */*')conn:send('User-Agent: Mozilla/4.0 (compatible; esp8266 Lua; Windows NT 5.1)')conn:send('')The device esp8266  log I see:Communication with MCU...Got answer! AutoDetect firmware...NodeMCU firmware detected.=node.heap()stdin:2: unexpected symbol near '='> Last temp: 257500Temp:25.7500 CSending data to thingspeak.comClosing connectionGot disconnection...Last temp: 252500Temp:25.2500 CSending data to thingspeak.comClosing connectionGot disconnection...So like device sends data to thingspeakBut on the side of the chanell do not see changes", "num_user_post": " 19", "author": "kniazio"}, {"date": "September 14, 2015 - 1:12 pm", "content": "Ok otherwise.My write API Key isID9D358UQURTFIMUMy chanell ID is 55753How will this line with me:conn:send('GET /update?key=ID9D358UQURTFIMU&field1='..t1..'.'..string.format('%04d', t2)..' HTTP/1.1')", "num_user_post": " 19", "author": "kniazio"}, {"date": "September 14, 2015 - 2:34 pm", "content": "I don't know the UA syntax but you need a couple of CrLf. See http://community.thingspeak.com/forum/esp8266-wi-fi/esp8266-module-using-at-comands/#p1802", "num_user_post": " 13", "author": "Michel_J"}, {"date": "September 14, 2015 - 4:01 pm", "content": "Michel_J said I don't know the UA syntax but you need a couple of CrLf. See http://community.thingspeak.com/forum/esp8266-wi-fi/esp8266-module-using-at-comands/#p1802I think I do not understand.I want to do something like on this page is describedhttp://www.instructables.com/id/Low-cost-WIFI-temperature-data-logger-based-on-ESP/?ALLSTEPS", "num_user_post": " 19", "author": "kniazio"}, {"date": "September 14, 2015 - 7:27 pm", "content": "One screen shot (http://cdn.instructables.com/FS2/5UBI/I4CMNUCJ/FS25UBII4CMNUCJ.LARGE.jpg) of this instructable shows some  backslash r backslash n inside the string of the GET. Those  backslash r backslash n are CrLf, carriage and line feed. Your string should look like this:GET /update?key=ID9D358UQURTFIMU&field1=1.23&headers=false HTTP/1.1{CrLf}Host: api.thingspeak.com{CrLf}Connection: close{CrLf}Accept: */*{CrLf}{CrLf}I this example the value passed to field1 is 1.23.", "num_user_post": " 13", "author": "Michel_J"}]}]}