{"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/page-2/", "threads": [{"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/esp8266-signal-strength-doesnt-work/", "posts": [{"date": "June 1, 2018 - 3:33 pm", "content": "I followed all instructions for this app.  It compiled & uploaded.  It does not record any info in serial monitor.  I don't know where to look on the internet to find results. Pleae help.", "num_user_post": " 1", "author": "drzrudsky34"}, {"date": "June 6, 2018 - 3:36 pm", "content": "Can you share what example you are referring to?  In the MathWorks documentation, there is an ESP32 signal strength example, and another for MKR1000.  There is a bulk update example that is compatible with ESP8266 and uses signal strength. Is this the one you tried?https://www.mathworks.com/help/thingspeak/continuously-collect-data-and-bulk-update-a-thingspeak-channel-using-an-arduino-mkr1000-board-or-an-esp8266-board.htmlIf so, can you tell use what you did see on the serial monitor?  If you saw nothing, then you may just have the baud rate set incorrectly.", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/cant-send-data-to-mulple-fields-in-a-channel/", "posts": [{"date": "April 24, 2018 - 5:53 am", "content": "how can i send from the esp8266 three data to tree fields indipendently with out the problem of the 15 seconds buffer? i would like to use only one channel", "num_user_post": " 7", "author": "frenk0"}, {"date": "April 24, 2018 - 9:05 am", "content": "See the write data documentation (https://www.mathworks.com/help/thingspeak/writedata.html) for the correct formats. and the faq for licensing information. (https://thingspeak.com/pages/license_faq)Each update counts towards the 15 second limit, and you can update all eight fields, the location information and the status in a single update (every 15 seconds you can update all fields.)use ? to append the first parameter and & for subsequent parameters.for a GET:  https://api.thingspeak.com/update.json?api_key=XXXXXXXXXXXXXXXX&field1=1&field2=22&field3=234&field4=mush&field5=room&field6=66&field7=7&status=greevyetc.", "num_user_post": " 401", "author": "cstapels"}, {"date": "April 25, 2018 - 3:05 am", "content": "cstapels said See the write data documentation (https://www.mathworks.com/help/thingspeak/writedata.html) for the correct formats. and the faq for licensing information. (https://thingspeak.com/pages/license_faq)Each update counts towards the 15 second limit, and you can update all eight fields, the location information and the status in a single update (every 15 seconds you can update all fields.)use ? to append the first parameter and & for subsequent parameters.for a GET:  https://api.thingspeak.com/update.json?api_key=XXXXXXXXXXXXXXXX&field1=1&field2=22&field3=234&field4=mush&field5=room&field6=66&field7=7&status=greevyetc.  thanks but ifi have three esp8266 that i cannot sync how can i make them write each one in a channel with out losing data due to the 15 sec limit", "num_user_post": " 7", "author": "frenk0"}, {"date": "April 25, 2018 - 5:17 am", "content": "The 15 second update is just about the only limit that thingspeak has so your options appear to be1) 3 separate channels2) paid plan3) re-think your architecture so that you sync your updates.A matlab visualization can combine data from multiple channels if thats your main reason for avoiding the obvious solution.", "num_user_post": " 271", "author": "rw950431"}, {"date": "April 26, 2018 - 4:32 pm", "content": "rw950431 said A matlab visualization can combine data from multiple channels if thats your main reason for avoiding the obvious solution.   can i do a mathlab visualization which looks like a field chart?", "num_user_post": " 7", "author": "frenk0"}, {"date": "April 26, 2018 - 4:33 pm", "content": "i mean the interesting part of the fiel chart is that when you drag the mouse over a certain spot of the function it gives you the exact x and y value", "num_user_post": " 7", "author": "frenk0"}, {"date": "April 26, 2018 - 5:30 pm", "content": "After you finish your MATLAB visualization, use thingSpeakWrite() to write the data to another channel.  Then you will have thingSpeak plots for the fields in your new channel, complete with hover capabilities.", "num_user_post": " 401", "author": "cstapels"}, {"date": "May 7, 2018 - 10:26 am", "content": "thank you this was very helpful! 🙂", "num_user_post": " 7", "author": "frenk0"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/atcipsend-not-returning/", "posts": [{"date": "April 20, 2018 - 8:48 pm", "content": "I am attempting to send data to thingspeak using a ESP8266  and a arduino mini pro 16.  I am using the example  Arduino code for the 'ESP8266 WIFI TEMPERATURE LOGGER' instructables.  This project is listed as an example on the Thingspeak Support page,  linked  as 'WiFi ESP8266 Wifi Temperature Logger [External]'. I have set up the hardware and have established  serial communication between the Arduino and the 8266 WiFi module.  I believe the serial connection is good. I get the expected appropriate messages on the  Serial monitor when the setup and connectWiFi functions run on the arduino.  There is no error reported when the  AT+CIPSTART command is sent to the web page. However!  the  > is never returned after the AT+CIPSEND= command is sent to thingsspeek.  The AT+CIPCLOSE is sent to the serial monitor and the ESP8266. the RECEIVED Error message is sent to the serial monitor.  The GET command is never sent to thingspeak because the > is never returned after the AT+CIPSEND= command is sent.I have tried everything I can think of to determine where the issue may be.  I am completely out of ideas. I could post the code here but is available here [ http://www.instructables.com/id/ESP8266-Wifi-Temperature-Logger/ ] with a considerable amount of detail about the system I am attempting to replicate.PS The system is reading temperatures correctly. I can modify the code and send the temperature reading to the serial monitor.Also I have bean successful in sending test data to my thingspeak channel by using a web browser address bar and modifying this https://api.thingspeak.com/update?api_key=YOUR WRITE API KEY&field7=0.0000672.  Update;I have now completely removed the  arduino and connected a serial to USB adapter directly to the ESP8266 module.  I have serial com with the module.  The AT, AT+RST, AT+CWMODE, AT+CIPMUX, & AT+CWLAP commands all work as expected. I am getting a full listing of the available WiFi access points with the CWLAP comand. however when I attempt to connect to the thingsreak server I get an error.         AT+CIPSTART='TCP','184.106.153.149',80         no ip         ERRORI would greatly appreciate any suggestions or help if anyone can point the problem. thanks.", "num_user_post": " 2", "author": "dennis55"}, {"date": "April 21, 2018 - 1:13 am", "content": "Hi dennis55,Please read this post (click link)https://community.thingspeak.com/forum/esp8266-wi-fi/updating-data-in-thingspeak/#p5544if that is no help, please ask again and I can explain in more detail.The idea is to test manually first to send with your ESP some data to Thingspeak. When it is working you put the arduino in charge.This works, I have now more than 1000000 points in my channel with my ESP01-arduino couple ", "num_user_post": " 91", "author": "piajola"}, {"date": "April 21, 2018 - 12:33 pm", "content": "Hi piajolathanks for the reply, unfortunately I am still not getting any data posted onto my thingspeak channel.I have read the forum post that you linked. I am getting the same 'busy s...' message that is mentioned there.I have set up the serial com using  both PUTTY and the Arduino ide serial monitor. The results are the same every time.  when I send the GET... command after the AT+CIPSEND command I always receive the busy s... . I have tried sending the serial using all the possible line end arrangements.   NL & CR, newline only, carnage return only  and no line ending.  I have adjusted the value of the AT+CIPSEND = ? command, in an attempt to discover if I was not counting the line end charterers as required.    I have tried sending one set and two sets of carnage returns and line ends to the end of the get command statement. I did not see or perhaps never understood what other step I might attempt to resolve this issue from the forum link. I see  /n on the serial monitor after the > symbol that is returned after the AT+CIPSEND command in sent. This leads me to think the issue in related to the end character sent in ether the AT+CIPsend command or the GET... command that where sent. I have attempted to try every combination of line end characters I think may help but nothing works.ATOKAT+RSTOKc_⸮R#⸮fJ[:fJ[⸮fJ⸮⸮O⸮G⸮G⸮⸮O⸮X⸮XreadyWIFI CONNECTEDWIFI GOT IPAT+CIPMUX=0OKAT+CWMODE=1OKAT+CIPSTART='TCP','184.106.153.149',80CONNECTOKAT+CIPSEND=46OK> nbusy s...Recv 46 bytesSEND OKCLOSED", "num_user_post": " 2", "author": "dennis55"}, {"date": "April 21, 2018 - 3:31 pm", "content": "Hi dennis55,Have you read this other link mentioned ?( https://community.thingspeak.com/forum/esp8266-wi-fi/dns-fail-error/#p5426 )at the end it is mentioned the effective send (cipstart-cipsend)It seems your troubles are in character count ... and must be ended with CR-LF (ascii 13-10 or 0x0D-0x0A)your--                    AT+CIPSEND=46----                   OK--                   > n----                   busy s...----                   Recv 46 bytes----                   SEND OK--                   CLOSEDhas the busy s... or  Failed  - try another waySee my comments (post #p5426) about PUTTY how to end the strings to sendAs you like to try a lot (good thing! ) you have something to do.Please tell your finds (remember .. this works very well)", "num_user_post": " 91", "author": "piajola"}, {"date": "April 26, 2018 - 5:12 pm", "content": "Hi DennisYou do not need to worry about counting the length of the update string.  You can just issue the command AT+CIPSEND with no '='.  Terminate the GET request with     SIMSerial.println(updateStr1);     SIMSerial.println();      SIMSerial.print('u001A');SIMSerial.println('at+cipstart='TCP','184.106.153.149','80'');//connect to the thingspeak update URL this is https://api.thingspeak.com  char searchStr[] = 'CONNECT OK';  if (SIMSerial.find(searchStr)) {    Serial.println('Start OK');    SIMSerial.println('at+cipsend');    char searchStr[] = 'ERROR';     if (SIMSerial.find(searchStr)) {      Serial.println('CIPSEND failed');    }    else {      SIMSerial.print('GET /update?key=');      SIMSerial.print(myAPI);      SIMSerial.println(updateStr1);       SIMSerial.println();      SIMSerial.print('u001A');// cntl+Z to terminate the SEND from the GSM since we did not define the request length      char searchStr[] = 'OK';      if (SIMSerial.find(searchStr)) {        Serial.println();        Serial.println('GET sent okay');        passFlag = true;        feedback();      }    }I hope this helps.David", "num_user_post": " 4", "author": "SailSenseTech"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/problem-rc-4-using-library-pubsub/", "posts": [{"date": "April 19, 2018 - 10:56 am", "content": "hello everyone,im using the library pubsub based on the example of : https://la.mathworks.com/help/thingspeak/use-arduino-client-to-publish-to-a-channel.html. in my ESP8266 module to connect to my ThingSpeak Channel, in the beginning i dont have any problems, the data was sent without problems, but yesterday, when I was going to try, I got an error in the serial monitor that said: Attempting MQTT connection ... failed, rc = -4 try again in 5 seconds.It's very strange, since I never modify the code since that time it worked for me (April 9 was the last time it worked for me).According to the documentation of the library, the message rc = -4, means: MQTT_CONNECTION_TIMEOUT - the server did not respond within the keep alive time.At first I thought it was my network problem, but I tried all the networks that I had tried before and the problem keeps coming up.I think then that the problem is with ThingSpeak, something changed and I can not access anymore. Any idea what it could be? What solution can I use? I leave attached the code that I am using.Thank you for your attention,Best regards.PS: I'm sorry for my English, I'm learningTHE CODE IS BELOW#include      //SPI.h library#include     // ESP8266.h library#include    // PubSubClient.h library// Variables de medida de energíaconst int slavePin = 15 ;                                     // Salida pin 8 del wemos que controla el Chip Select del ADe7753 (aqui lo ponemos como 15 en la analogia arduino)int voltaje1;                                                //Define la variable voltaje igual a cerofloat corriente1;                                            //Define la variable corriente igual a ceroint energia1;                                                //Define la variable energia igual a cero int v= 0 ; float i= 0; int w= 0 ;//  WiFi Credentialsconst char* ssid     = 'GADYM2013';const char* password = 'Gadym_2013'; //  ThingSpeak MQTT server Credentialschar mqttUserName[]= 'juantv'; // any name userchar mqttPass[]= 'XXXXXXXXX'; //MQTT Key Myprofile thingSpeakchar writeAPIKey[] = 'XXXXXXXXXX';    // Change to your channel Write API Key.long channelID = 426397 ;const char* server= 'mqtt.thingspeak.com';static const char alphanum[] ='0123456789'                              'ABCDEFGHIJKLMNOPQRSTUVWXYZ'                              'abcdefghijklmnopqrstuvwxyz';  // For random generation of client ID // Variables globales para seguir tiempo de ultima actualizacion y definir el intervalo para publicar informacionunsigned long lastConnectionTime = 0;const unsigned long postingInterval = 20L * 1000L; // envia datos cada 20 segundos WiFiClient espClient;      // Inicialización del cliente MQTTPubSubClient client(espClient);void setup() {  // put your setup code here, to run once:  pinMode(LED_BUILTIN, OUTPUT); // definimos para prender el LED que indica que el programa esta corriendo  Serial.begin(115200);  //iniciamos el monitor serie  SPI.begin(); // Iniciamos la libreria SPI   pinMode(slavePin, OUTPUT); //configuramos el pin D8 (aqui lo ponemos como 15 en la analogia arduino) del wemos como salida  // conexión con el servidor por el puerto 1883client.setServer(server, 1883);  Serial.begin(115200);  delay(10);   // CONEXIÓN CON LA RED WiFi    Serial.println();  Serial.println();  Serial.print('Connecting to ');  Serial.println(ssid);  WiFi.begin(ssid, password);   while (WiFi.status() != WL_CONNECTED) {    delay(500);    Serial.print('.');  }  Serial.println('');  Serial.println('WiFi connected');  Serial.println('IP address: ');  Serial.println(WiFi.localIP());}// CONEXION CON EL SERVIDOR WEB MQTT//  ThingSpeak.begin(client); void loop() {  digitalWrite(LED_BUILTIN, LOW); // encedemos el led // Se espera a la conexión con el broker if (!client.connected()) {    reconnect();  }  client.loop();// Se espera a que pase el tiempo transcurrido para enviar de nuevo  if (millis() - lastConnectionTime > postingInterval)  {    mqttpublish();  }  delay(5000);}// FUNCION PARA RECONECTAR EN CASO DE FALLA void reconnect() {  char clientID[10];  // Loop until we're reconnected  while (!client.connected()) {   Serial.print('Attempting MQTT connection...');    // Generate ClientID    for (int i = 0; i  0) {    // Desplazamos el primer byte a la izquierda, entonces obtiene el segundo byte:    result = result << 8;    inByte = SPI.transfer(0x00);    // Combine el byte anterior con el recibido:    result = result | inByte;    // decremente el numero de bytes a leer :    bytesToRead--;  }  // Desactivamos el chip:  digitalWrite(slavePin, HIGH);  // finalizamos la transacion SPI  SPI.endTransaction();  // retorna el resultado    return (result);}", "num_user_post": " 5", "author": "JuanTV"}, {"date": "April 19, 2018 - 12:09 pm", "content": "I agree that it does seem like a network problem. I can see server logs of MQTT publish messages to channel 426397 a few days ago.  Was that you?", "num_user_post": " 34", "author": "JasonW"}, {"date": "April 19, 2018 - 4:42 pm", "content": "Hello Jason.Yeah, was me but since yesterday i cant connect again to my Thingspeak Channel. I do not know why it does not work now? If it is the same code that I used a few days ago and as you could see I could send messages but not now. I really need help soon", "num_user_post": " 5", "author": "JuanTV"}, {"date": "April 21, 2018 - 11:46 am", "content": "Have you included the connection part of your code?  I don't see a call to mqttClient.connect(...) anywhere.  That is the part that would generate the RC=-4 error, as far as I know.", "num_user_post": " 401", "author": "cstapels"}, {"date": "April 23, 2018 - 6:04 pm", "content": "Hi,I have similar issue with publishing to chanel 393925.It was working great for long time but on 11th April stopped.I realized its not working only today so started to debug.All MQTT connections my ESP8266 is trying to establish are failing with -4 code.I tried to use MQTTlens Chrome extension to check if your broker is up - initially I was able to publish test status with it but after a while it doesn't want to connect anymore.Have you changed anything recently?I'm using free account - how limit of 3 mqtt subscriptsions works? Does it recognise previous subscription died due to timeout/other issues?RegardsMarcin", "num_user_post": " 2", "author": "wojmonit"}, {"date": "April 24, 2018 - 1:58 pm", "content": "No reply from support but I fixed it myself.Looks like reconnect procedure from example no longer works (that with random client name generation).I replaced it with static client name like below and it started to work again.Please test why your example no longer works and correct it so others won't waste their time on this...void reconnect(){  char clientID[10];  char clientIDset[] = 'Wojmonitclient123';  // Can be any name.  // Loop until we're reconnected  while (!mqttClient.connected())  {    Serial.print('Attempting MQTT connection...');    // Generate ClientID    for (int i = 0; i < 8; i++) {        clientID[i] = alphanum[random(51)];    }    // Connect to the MQTT broker//    if (mqttClient.connect(clientID,mqttUserName,mqttPass))    if (mqttClient.connect(clientIDset,mqttUserName,mqttPass))    {      Serial.println('connected');    } else    {      Serial.print('failed, rc=');      // Print to know why the connection failed.      // See http://pubsubclient.knolleary.net/api.html#state for the failure code explanation.      Serial.print(mqttClient.state());      Serial.println(' try again in 5 seconds');      delay(5000);    }  }}", "num_user_post": " 2", "author": "wojmonit"}, {"date": "April 24, 2018 - 7:25 pm", "content": "You need to terminate the char array.After this section:Serial.print('Attempting MQTT connection...');// Generate ClientIDfor (int i = 0; i < 8; i++) {clientID[i] = alphanum[random(51)];}Add this line:clientID[8]='0';and the connection should work.", "num_user_post": " 401", "author": "cstapels"}, {"date": "April 24, 2018 - 11:34 pm", "content": "cstapels said Have you included the connection part of your code?  I don't see a call to mqttClient.connect(...) anywhere.  That is the part that would generate the RC=-4 error, as far as I know.  Hello cstapels , first at all, thanks for your replies here and in github issue (i am the same user). In this post i do a mistake in copy my code, in the code posted on github: https://github.com/knolleary/pubsubclient/issues/433 , I do not make the same mistake, I'm sorry for that. Okay returning to the main theme here: My solution as well as wojmonit: was to eliminate the random generation of the ClientID in my code, and replace it with a fixed ClientID, that allowed me to connect without problem to my channel. (by the way, thanks for you help wojmonit) . You recommend this change in my code: 'Add this line:clientID[8]='0';and the connection should work. '  but I have not tried it yet. Can you explain in detail this solution that you propose? and another question for you or for some user of the support: Why did the random generation of the ClientID stop working (the same code example of Mathworks proposes)?Thanks for everyones, Regards", "num_user_post": " 5", "author": "JuanTV"}, {"date": "April 25, 2018 - 9:05 am", "content": "The fixed client ID will work, but it is less reliable.  If you have two devices with the same client ID, the new instance may cause the old one to terminate.  This is why the random client ID generation works. In the publish code, when the un-terminated char array was converted to a string, the program was taking a whole bunch of extra characters, which was causing the server to reject the request to connect.  for examplechar clientID = 'abcdefgh';can get converted toString(clientID)= ... abcdefghandawholebunchofotherstuffinmemorythatoccursafterthecharbutchar clientIDTerminated='abcdefg/0';converts toString(clinetID)='abcdefg'...I am not yet clear why the server changed its requirements, it may have even been a processing issue of how the request was packaged before it was sent to the server.  We are looking into the issue, but the solution here works for my devices.", "num_user_post": " 401", "author": "cstapels"}, {"date": "April 25, 2018 - 12:20 pm", "content": "cstapels said The fixed client ID will work, but it is less reliable.  If you have two devices with the same client ID, the new instance may cause the old one to terminate.  This is why the random client ID generation works. In the publish code, when the un-terminated char array was converted to a string, the program was taking a whole bunch of extra characters, which was causing the server to reject the request to connect.  for examplechar clientID = 'abcdefgh';can get converted toString(clientID)= ... abcdefghandawholebunchofotherstuffinmemorythatoccursafterthecharbutchar clientIDTerminated='abcdefg/0';converts toString(clinetID)='abcdefg'...I am not yet clear why the server changed its requirements, it may have even been a processing issue of how the request was packaged before it was sent to the server.  We are looking into the issue, but the solution here works for my devices.  Hello, cstapels I made the changes in my code and it's working fine. Thanks a lot for your help.  I would like to ask you one last question: I have two devices measuring some variables, my purpose is to send data every 5 or 10 minutes using the code posted in  https://github.com/knolleary/pubsubclient/issues/433 (with corrections obviously) , my question is: Will my two devices be able to send the data simultaneously without problem to the same channel or as I should do? What changes in my code should I make so that both send data without problem?Regards,Juan", "num_user_post": " 5", "author": "JuanTV"}, {"date": "April 26, 2018 - 8:21 am", "content": "We finally figured out the root cause of the issue.  A recent MQTT broker update added UTF-8 validation to client IDs and topics.  We didn't realize it but the code in our example to generate random client IDs had a bug in it which caused an invalid character to be included.   After the the broker update, our example became broken.  (We'll be correcting that.)Validating client IDs and topics for only UTF-8 characters is a good thing in terms of security.  Unfortunately it tripped us up this time.The bottom line: be sure to include only printable characters in the client ID and topic.  Meaning no tabs, line feeds, carriage returns, etc.", "num_user_post": " 34", "author": "JasonW"}, {"date": "April 26, 2018 - 8:40 am", "content": "Can you start a new thread for this question, and Ill get to it shortly?'I would like to ask you one last question: I have two devices measuring some variables, my purpose is to send data every 5 or 10 minutes using the code posted in  https://github.com/knolleary/pubsubclient/issues/433 (with corrections obviously) , my question is: Will my two devices be able to send the data simultaneously without problem to the same channel or as I should do? What changes in my code should I make so that both send data without problem?'", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/sending-data-serial-from-arduino-to-esp8266-nodemcu/", "posts": [{"date": "March 9, 2018 - 7:49 pm", "content": "hey guys , 1) i'm trying to send data from my arduino uno to the nodemcu 8266 through serial but i receive nothing , but when i send any data from the node mcu to the arduino things go smoothly 2) so i to access the esp8266 module on the nodemcu esp8266 and made all the wirings so i can access the wifi from the arduino directly then i'll have the benefit of uploading the arduino data through the esp8266 without programing the nodemcu controller , but i failed when i enter any AT command nothing happens---------------------------------------------------------------------------------------------Arduino code :#include <SoftwareSerial.h>SoftwareSerial BTserial(2, 3); // RX | TXchar c = ' ';void setup(){ Serial.begin(9600); BTserial.begin(115200);  pinMode(13,OUTPUT);}void loop(){ if (BTserial.available()) { BTserial.write('a'); digitalWrite(13,1); delay(1000); BTserial.write('b'); digitalWrite(13,0); delay(1000);}}--------------------------------------------------------------------------------------NodeMcu esp8266 code :#include <SoftwareSerial.h>SoftwareSerial BTserial(13, 15); // RX | TXchar c = ' ';void setup(){ Serial.begin(9600);BTserial.begin(115200);  pinMode(LED_BUILTIN,OUTPUT);}void loop(){ if (BTserial.available()) { digitalWrite(LED_BUILTIN,HIGH); c=Serial.read(); Serial.print(c); }}", "num_user_post": " 1", "author": "zidan"}, {"date": "March 13, 2018 - 9:57 pm", "content": "Which serial ports are being used to connect between the arduino and the NodeMCU?  Is it Serial or BTserial?I do see a problem in that in the Arduino code you are waiting for some character to be received before you send anything. Perhaps remove the if (BTserial.available()) lines and see if that works.You might also try a lower speed on the BTserial ports to see if that helps.", "num_user_post": " 271", "author": "rw950431"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/updating-data-in-thingspeak/", "posts": [{"date": "March 8, 2018 - 10:35 am", "content": "Hi,As part of my project, I'm uploading data to the Thingspek IOT platform. To test the wifi module and to get an idea how the whole thing works. I connected ESP8266 with a USB TTL Serial. I used Serial Prompt in Linux to send AT commands. Module gave a response to every command and connected it to a wifi network. Then I tried to update field value of Thingspeak.1.AT+CIPMUX=02. AT+CIPSTART = 'TCP','www.thingspeak.com',802.AT+CIPSEND=74got reply as>then I pasted the following link GET https://api.thingspeak.com/update?api_key=38X665EABZ5YTRW3&field1=25SEND OKBut the Thingspeak filed values were not updated. Anyone have any idea about this.Thanks", "num_user_post": " 4", "author": "Athul"}, {"date": "March 8, 2018 - 10:40 am", "content": "Athul said  Hi, As part of my project, I'm uploading data to the Thingspek IOT platform. To test the wifi module and to get an idea how the whole thing works. I connected ESP8266 with a USB TTL Serial. I used Serial Prompt in Linux to send AT commands. Module gave a response to every command and connected it to a wifi network. Then I tried to update field value of Thingspeak.    AT+CIPMUX=0    AT+CIPSTART = 'TCP','www.thingspeak.com',80    AT+CIPSEND=74 got reply as   > then I pasted the following link        GET https://api.thingspeak.com/update?api_key=38X665EABZ5YTRW3&field1=25    SEND OK But the Thingspeak filed values were not updated. Anyone have any idea about this. Thanks  ", "num_user_post": " 4", "author": "Athul"}, {"date": "March 8, 2018 - 10:21 pm", "content": "First make sure you can update your channel by pasting the GET command into the browser.  Make sure your API key is the write API Key.  Then look at other AT command examples. There is not yet one in the ThingSpeak documentation, but there are a lot of them out there. I'm sure you didn't show all the details of your code, but there are other steps, such as sending the size of our data packet, and connecting to the server and access point. Even better, you can use the Arduino IDE to program your ESP 8266, and then the steps are a lot easier than using AT commands.  See the examples in the ThingSpeak Documentation, for example the temperature monitor or the soil moisture monitor.", "num_user_post": " 401", "author": "cstapels"}, {"date": "March 9, 2018 - 12:09 am", "content": "Hi Athul,please see this post in this forumhttp://community.thingspeak.com/forum/esp8266-wi-fi/dns-fail-error/#p5426I have more than 900000 records in my channel here with an arduino+esp-01 (it does not matter if the ESP8266 is esp-01 or esp-12 or nodemcu or any model)Less than ten US dollars for esp-01+arduino nano clone+sensor-better-than-DHT-11/22 is enough to have temperature+humidity data in thingspeakI use Win10 with Chrome, but this does not matter either, with linux is the same thing.As cstapels suggets,first use the IP address line in your browser, this try worked for mehttp://api.thingspeak.com/update?key=16ALPHANUMBERkey&field1=30&field2=80second try your serial software to send to ESP8266If you need more help just askGood luck", "num_user_post": " 91", "author": "piajola"}, {"date": "March 9, 2018 - 11:58 am", "content": "Hi,Thanks for the reply.I am using LPC2148(ARM7) for my projects, not Arduino. I could find a lot of projects with ESP8266 and Arduino using thingspeak library. But there's no such library available for ARM(couldn't find one). I have to write all AT codes in my code and then send 'GET https://api.thingspeak.com/update?api_key=38X665EABZ5YTRW3&field1=25'  I could update my Filed with directly pasting the following link in any browser with the required field value https://api.thingspeak.com/update?api_key=38X665EABZ5YTRW3&field1=25 Today I tried again,1. configured my wifi module and connected it with a wifi network2.Connected to 'api.thingspeak.com'3. AT+CIPSEND=74since my GET https://api.thingspeak.com/update?api_key=38X665EABZ5YTRW3&field1=25  link has 72 characters and extra 2 for 3. then I sent the link without  at the end and pressed enter key() and ctrl+enter(),  by following above method I could update my field values. But the thing is if I add  at the end of the link(GET https://api.thingspeak.com/update?api_key=38X665EABZ5YTRW3&field1=25) instead of pressing enter key() and ctrl+enter(),   and past it to the command prompt  i got the following response >busy s...sendbut the field value was not updated. So my question is how should I write my code. Can i use something like this,    char wifi[]='GET https://api.thingspeak.com/update?api_key=38X665EABZ5YTRW3&field1=25';    int l = strlen(wifi);     sprintf(b, 'AT+CIPSEND=%d',l);    UART_TX(wifi); Since sending data in GET https://api.thingspeak.com/update?api_key=38X665EABZ5YTRW3&field1=25' this format didn't update values, not sure I could use something as aboveI am confused", "num_user_post": " 4", "author": "Athul"}, {"date": "March 9, 2018 - 12:05 pm", "content": "Updating answer due to missing charactersHi,Thanks for the reply.I am using LPC2148(ARM7) for my projects, not Arduino. I could find a lot of projects with ESP8266 and Arduino using thingspeak library. But there's no such library available for ARM(couldn't find one). I have to write all AT codes in my code and then send 'GET https://api.thingspeak.com/update?api_key=38X665EABZ5YTRW3&field1=25'  I could update my Filed with directly pasting the following link in any browser with the required field value https://api.thingspeak.com/update?api_key=38X665EABZ5YTRW3&field1=25 Today I tried again,1. configured my wifi module and connected it with a wifi network2.Connected to 'api.thingspeak.com'3. AT+CIPSEND=74since my GET https://api.thingspeak.com/update?api_key=38X665EABZ5YTRW3&field1=25  link has 72 characters and extra 2 for <carraige return><new line>3. then I sent the link without <carraige return><new line>at the end and pressed enter key(<carraige return>) and ctrl+enter(<new line>), by following above method I could update my field values. But the thing is if I add <carraige return><new line> at the end of the link(GET https://api.thingspeak.com/update?api_key=38X665EABZ5YTRW3&field1=25<carraige return><new line>) instead of pressing enter key(<carriage return>) and ctrl+enter(<new line>),   and past it to the command prompt  I got the following response ><new line>busy s...sendbut the field value was not updated. So my question is how should I write my code. Can i use something like this,    char wifi[]='GET https://api.thingspeak.com/update?api_key=38X665EABZ5YTRW3&field1=25<carraige return><new line>';    int l = strlen(wifi);     sprintf(b, 'AT+CIPSEND=%d',l);    UART_TX(wifi); Since sending data in GET https://api.thingspeak.com/update?api_key=38X665EABZ5YTRW3&field1=25<carriage return><new line>this format didn't update values, not sure I could use something as aboveI am confused", "num_user_post": " 4", "author": "Athul"}, {"date": "March 9, 2018 - 7:45 pm", "content": "Hi,to add to the confusion ... 🙂I tried your link in my W10 chrome ... twice and got 14 and 15 so I think I put two 25 values in your field1 channel xxxxI am assuming you are talking your adventures with your serial software to control/use your ESP8266so ...><new line>busy s...sendmust be interpreted as a failure ... if you receive busy s... the ESP826 was confused and did nothing, you must try again and differently.Also there are differences in the different versions of the ESP 'AT' firmware, there is no ONE firmware version.Another also ESP has ATE0 NO echo from ESP                                       ATE1 echo from ESP - more chars in RS232I used 3 serial software: YAT, Termite and PUTTY- in YAT I press button SEND to send the chars in the command text- in Putty I must add ^M^J at the end of chars and press ENTER- in Termite I put the chars in the command text and press ENTERall 3 are GUI and choice cr only, nl only or cr+nlI do not know your philips(NXP) compiler, but read parts of my arduino code next, note arduino has print and println (ascii 13 and ascii 13+ascii 10)initialize ESPSerial.println('AT+RST'); wait 5000 ms Serial.println('ATE0'); wait 500 ms Serial.println('AT');wait 500 ms if (Serial.find('OK')) {  wait 1000 ms  // try to connect to wifi } else {  there is AT error ESP is not ready }TCP connection to send one more timeSerial.println('AT+CIPSTART='TCP','184.106.153.149',80'); if (Serial.find('ERROR')) {                    // Error in other fw version  // something very bad there is NO TS } // send data length Serial.println('AT+CIPSEND=66'); if (Serial.find('>')) {  Serial.print('GET /update?api_key=');   // 20  Serial.print(apiKey);                                 // 16  Serial.print('&field1=');                          // 8  Serial.print(String(valTemperature));   // 5 00.00 adjust your style  Serial.print('&field2=');                          // 8  Serial.print(String(valHumidity));         // 5 98.76  Serial.print('|r|n|r|n');                        // 4 [CR][NL][CR][NL] } else {  Serial.println('AT+CIPCLOSE'); }Gooooood luck", "num_user_post": " 91", "author": "piajola"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/delay-in-uploading-to-thingspeak-website/", "posts": [{"date": "March 7, 2018 - 6:43 am", "content": "Is the 15 sec delay constant in uploading the data to the server. Why does it cannot be uploaded instantly without any delay. I am using NodeMCU to upload data online but the requirement is that the data has to be processed and visualized instantly. Kindly help.Thanks ", "num_user_post": " 1", "author": "Abhinandan"}, {"date": "March 7, 2018 - 12:49 pm", "content": "The free offering offers an update interval limit of 15 seconds. Data sent faster than that will be dropped.  For your application, you need the one second update interval which is only available with a paid license. See this page on ThingSpeak Licenses for more information about the paid license options.The MQTT API or the client post method seen in the soil monitor example may offer some small speed improvements.", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/help-with-a-code/", "posts": [{"date": "February 24, 2018 - 1:50 pm", "content": "Hello,I have two ESP8266-01 modules. I use one of them to upload data to my thingspeak channel directly from the DHT11 Sensor. So I can see temperature and humidty from the channel. Thats great I have no problem with that. But I am planning to use my other ESP module to show these datas in an LCD screen. I do not know how to retrive data from thingspeak channels. I would appriciate any help. I am using Ardunio IDE to program. ", "num_user_post": " 1", "author": "dozcakir"}, {"date": "February 26, 2018 - 11:52 am", "content": "There are several examples in the ThingSpeak documentation to help you.  The first example in the ESP section Post Temperature Data and Read from Channel  provides code using the ThingSpeak communication library.  If you don't want to use the ThingSpeak communication library, you can consider the Moisture Monitor with Deep Sleep.  This one also shows how to put the device in deep sleep.  These examples are specifically tested with NODE MCU devices (ESP-8266-12), but you can use the ESP-8266-01.  Your device wont have an ADC which is used in come of these examples, and the programming process is slightly different, but it seems you already have the programming part down.The Arduino code is similar, and you can look in the first section for more examples.The first example with a sonar sensor and  an Arduino MKR should port well to your ESP, with some changes.  The others can give you some ideas as well.", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/dns-fail-error/", "posts": [{"date": "February 24, 2018 - 5:50 am", "content": "HI EVERYONEI am new to this forumi am getting dns fail issue when i enter AT+CIPSTART=0,'TCP','https://thingspeak.com/',80can anyone help plzthank u", "num_user_post": " 1", "author": "GOURISH"}, {"date": "February 24, 2018 - 4:53 pm", "content": "Hi GOURISH,Can you tell us a little (lot) more about what are you doing? I have 1 year of data with an (avrmega 168 antidiluvian) Arduino with a ESP-01 4 megabit flash (512 mByte) so ... this AT thing works very well Note you need 3.3 V 750 ma capable power supply, otherwise you will have electrical issues when the RADIO part transmit Also the number of ' r  n' (return-new line 13-10 0x0D-0x0A) at the end of line is important (vital for the internet trip) Another also, the syntax can vary a little in different firmware (try AT+GMR) my try 10 minutes ago saidAT+GMR (6)                                                             meAT version:1.4.0.0(May 5 2017 16:10:59) (40)   ESP-01SDK version:2.1.0(116b762) (26)compile time:May 5 2017 16:37:48 (33)OK (2)with the ESP-01 connected to a serial terminal (ie. Arduino serial monitor with cr+nl) ANY serial terminal - Google is your friend ...better to type this, copy/paste sometimes tries his jokes-- AT+CIPSTART='TCP','api.thingspeak.com',80 (41 char) you get CONNECT -- AT+CIPSEND=142 (14 char) you get > -- GET /update?api_key=16-alpha-numeric&field1=10.45&field2=15.40&field3=20.35&field4=25.30&field5=30.25&field6=35.20&field7=40.15&field8=45.10 (142 char) you get the next record number in your collected data(1 if starting)in 2-5 seconds you see in the TS channel associated with the api_key the 8 little points in the 8 fields and so you know you did this well (life-warranty-batteries-included)then you can start your fight with arduino to control the ESP-01 but you are sure the data arrives ", "num_user_post": " 91", "author": "piajola"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/problema-para-recibir-datos-en-thingspeak-con-esp8266-y-arduino-mega/", "posts": [{"date": "February 18, 2018 - 3:01 pm", "content": "Hola buenas tardes. He intentado recibir datos de un sensor para leer voltaje pero no he tenido éxito. Puedo conectar mi ESP8266 a una red WiFi exitosamente pero no recibo los datos en mi Channel ID de Thingspeak, espero puedan ayudarme, ya he revisado el APIkey que esté bien, lo actualizo por otro y hago el copy/paste en el código y nada, se hacen las lecturas de voltaje las puedo ver en el monitor serial de Arduino.Éste es el código para la lectura del sensor y envío de datos a Thingspeak #include <SoftwareSerial.h>// LEDint ledPin = 13;int sensor_pin=A0; // variable for sensorfloat sample=0;float bat_volt =0; // for temperature// replace with your channel's thingspeak API keyString apiKey = 'HERE YOUR APIKEY CODE';// connect 2 to TX of Serial USB// connect 3 to RX of serial USBSoftwareSerial ser(14,15); // RX, TX// this runs oncevoid setup() { // initialize the digital pin as an output. pinMode(ledPin, OUTPUT);// enable debug serial Serial.begin(115200); // enable software serial ser.begin(115200); // reset ESP8266 ser.println('AT+RST');} // the loopvoid loop() { // blink LED on board digitalWrite(ledPin, HIGH); delay(200); digitalWrite(ledPin, LOW);voltage(); esp_8266();}void voltage(){ sample=0; for(int i=0;i<150;i++) { sample+=analogRead(sensor_pin); //read the value from the sensor delay(2); } sample=sample/150; bat_volt = sample*(4.76/1024)*(12/2); // R1+R2/R2 // R1=10k and R2=2k}void esp_8266(){ // convert to string char buf[32]; String strVolt = dtostrf( bat_volt, 4, 1, buf); Serial.print(strVolt); Serial.println(' V'); // TCP connection String cmd = 'AT+CIPSTART='TCP',''; cmd += '184.106.153.149'; // api.thingspeak.com cmd += '',80'; ser.println(cmd); if(ser.find('Error')){ Serial.println('AT+CIPSTART error'); return; } // prepare GET string String getStr = 'GET /update?api_key='; getStr += apiKey; getStr +='&field1='; getStr += String(strVolt); getStr += '';// send data length cmd = 'AT+CIPSEND='; cmd += String(getStr.length()); ser.println(cmd);if(ser.find('>')){ ser.print(getStr); } else{ ser.println('AT+CIPCLOSE'); // alert user Serial.println('AT+CIPCLOSE'); } // thingspeak needs 15 sec delay between updates delay(16000);}", "num_user_post": " 3", "author": "adrian"}, {"date": "February 18, 2018 - 5:42 pm", "content": "Hola adrian,Parece que esta de moda el esp8266 con comando AT (hayes ?) Se necesitaria mas informacion de lo que haces.Yo uso un esp-01 con UNO y AT desde hace 1 año y SI funciona sin problemasMencionas que usas wifi, pero hay contradicciones en tu software. El MEGA tiene 2 com hardware y usas 1. El softserial es para el UNO que solo tiene 1 com hardware y no funciona mas arriba de 19200 baud y tu intentas usarlo a 115200 baud. Tambien la version del firmware del esp8266 tiene sus cosas, tu linea if(ser.find('Error')){  en mi firmware debe ser if(ser.find('ERROR')){ mayusculas y sino asi haya error no te lo va a decir y jalate los pelos. No dices que ves en el monitor arduino, si ves strVolt quiere decir solo que leiste voltaje y no que paso con el esp8266Mis pasos fueron:    - probar manualmente que ponia data en thingspeak con el programa  Termite (puede ser el que manejes mas comodamente)    - probar programaticamente controlar el esp-01 para que envie data a thingspeakSi te parece podemos intentar mis sugerencias paso a pasoSaludos ", "num_user_post": " 91", "author": "piajola"}, {"date": "February 19, 2018 - 10:38 pm", "content": "Hola Piajola. Como verás no soy experto en Arduino, y en efecto ese código se utilizó en un Arduino Uno y pensé que podría utilizarlo en el Mega sin problema. Quisiera saber si podrías orientarme, por correo de preferencia.¡Muchas gracias!", "num_user_post": " 3", "author": "adrian"}, {"date": "February 20, 2018 - 9:06 am", "content": "hola, si puedo decirte mi opinion y mis experiencias sin problema ... el problema esta en como intercambiar correos.Si sabes como mandar mensajes personales en este foro prueba mandarme privadamente un correo 🙂", "num_user_post": " 91", "author": "piajola"}, {"date": "February 20, 2018 - 11:26 pm", "content": "No pues no le encontré, aparece 'contact piajola' pero no hay nada para selecionar, nada. ramgua gmail", "num_user_post": " 3", "author": "adrian"}, {"date": "February 21, 2018 - 8:53 am", "content": "hola, en tu perfil igual contact adrian no funciona, parece este forum no permite los usuarios se comuniquen. La idea debe ser todo el mundo comparta lo que se diga. Es la ultima parte como escribirte? sino plantea tus dudas por aqui 🙂", "num_user_post": " 91", "author": "piajola"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/problem-compiling-example-code/", "posts": [{"date": "February 8, 2018 - 6:01 pm", "content": " Hi.  I was using this code from the examples:https://www.mathworks.com/help/thingspeak/read-and-post-temperature-data.htmlto do a simple 1820 temp read and post.  When i copied and pasted into arduino and tried to compile, I get this error:Arduino: 1.8.5 (Windows 8.1), Board: 'SparkFun ESP8266 Thing Dev, 80 MHz, 512K (no SPIFFS), v2 Prebuilt (MSS=536), Disabled, None, 115200'D:arduino sketches backupsketch_feb08csketch_feb08c.ino: In function 'void loop()':sketch_feb08c:58: error: 'write2TSData' was not declared in this scopewrite2TSData( channelID , dataFieldOne , celsiusTemperature , dataFieldTwo , fahrenheitTemperature , dataFieldThree , millis() ); // Write the temperature in F, C, and time since starting.^exit status 1'write2TSData' was not declared in this scopeThis report would have more information with'Show verbose output during compilation'option enabled in File -> Preferences.I'm not very experienced at writing this code so I would appreciate any help.  thanks", "num_user_post": " 3", "author": "mtmtntop"}, {"date": "February 9, 2018 - 10:36 am", "content": " Your compiler cannot find the function write2TSData().  Make sure you copied it, its down at the bottom.  If its there and the compiler still cannot find it, this is most likely due to a missing open or close brace: '{' or '}' . I checked out the code on the site and there doesn't seem to be a missing brace there. (both the full version and the step by step code compiles as copied for me)  You should go through carefully and make sure each open brace has a corresponding close brace, or you could recopy the code (remembering to adjust the constants at the top.)If you copied form the section where each bit of code is explained separately, it would be very easy to miss a close brace.Let us know how it goes.", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/cant-send-data-via-mobile-data/", "posts": [{"date": "January 21, 2018 - 11:33 am", "content": "Hello,I've ESP 8266 12-E on Nodemcu board. I've programmed it via Arduino IDE to send data to two channels (8+7 fields) on Thingspeak every minute. When ESP is connected to my home WiFi it takes approximately 6-8 seconds (3-4s per channel) to send a data.I want to have more portable device so I programmed it to send data via my phone tethering (access point) by changing SSID and password to my phone. ESP12-E connected to it (1 connected client on statusbar), sending data took almost 12 seconds - probably because of weaker range.Unfortunately it wasn't sent (or received?). I tried to use second (older and worse) phone. Sending took almost 20 seconds but the result was the same.It works only on my home WiFi (didn't test other routers). Should I change something or ThingSpeak isn't compatible with phones? Or it takes too long? What could be a reason?", "num_user_post": " 2", "author": "Atex"}, {"date": "January 21, 2018 - 6:59 pm", "content": "Do you still have the serial monitor connected on your NODE MCU when you are sending?  Are you parsing the response from the server?  Can you share what the server is returning?", "num_user_post": " 401", "author": "cstapels"}, {"date": "January 22, 2018 - 10:47 am", "content": "Yes... and no. At the beginning I had tried it with serial monito. Later I tried resetting ESP, using it without serial monitor and without connecting it to my PC. My ESP is plugged to my PCB and has external power supply. With it and without connecting to PC it works on my home wifi, but hOn serial monitor I wrote Serial.printlns under calling the following function. They contained sending times thanks to millis() function. Sending is divided into 2 parts because only in that way I am able to send data to 2 channels at once. I've commented one but result was the same.void sendDataToCloud(){      for(a=0; a<8; a++)      {           ThingSpeak.setField(a+1, power[a]);      }      ThingSpeak.writeFields(channelNumber1, writeAPIKey1);      ESP.wdtFeed(); //optional to prevent watchdog triggering      for(a=8; a<15; a++)      {      ThingSpeak.setField(a-7, power[a]);      }      ThingSpeak.writeFields(channelNumber2, writeAPIKey2);} I don't parse any data on server. ON ESP I'm deleting min/max values only, then solving few equations and then writing them using ThingSpeak.setField. Even ESP is connected to my phone, the data doesn't leave it. Phone isn't on sleep mode and has all permissions. My sending code is based on these two from Mathworks examples:https://www.mathworks.com/help/thingspeak/read-and-post-temperature-data.htmlhttps://www.mathworks.com/help/thingspeak/continuously-collect-data-and-bulk-update-a-thingspeak-channel-using-an-arduino-mkr1000-board-or-an-esp8266-board.html", "num_user_post": " 2", "author": "Atex"}]}]}