{"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/page-6/", "threads": [{"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/urgent-helpwifi-shiled/", "posts": [{"date": "February 9, 2017 - 10:03 am", "content": "Arduino uno cc3000 wifi data stops sending to the thinkspeak server after 3-4 times,how can i solve this problem .", "num_user_post": " 1", "author": "pilkar"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/esp8288-at-command-parsing-and-escape-characters-help-with-the-rules-needed/", "posts": [{"date": "February 7, 2017 - 3:08 pm", "content": "HiI am developing an application whereby two ESP8266's inter communicate using the TCP and I am using the ESP8266_TCP library to develop functions to Tx and Rx data between the TCP client and server ESP's. However, despite many hours looking at related posts on various forums I am still somewhat confused on how to parse the commands correctly, with or without string literals.  I am aware that I should use the backslash character '' to precede double quotes INSIDE the overall string as shown.  So, example 1 I fully understand given this rule.Example 1:[code]Write('AT+CWSAP=2,'CG_BRST','abcdefgh');[/code]But this 'rule' doesn't seem to fully apply with the next two typical examples encountered by way way of Internet searching on the topic. Can anyone please enlighten me on parsing rules and using escape characters.I assume ssid and password are string variables i the examples given.Example 2[code]sendData('AT+CWJAP='' + ssid + '','' +password + ''');[/code]Example 3[code]write('AT+CWSAP='' + ssid +'',''+password+'','+String(channel)+',4');[/code]Many thanks in anticipation of any help.", "num_user_post": " 2", "author": "Hafod"}, {"date": "February 7, 2017 - 10:29 pm", "content": "As a sanity check you may want to use some Serial.print(someString); statements. in your code and look in the Arduino IDE's serial monitor. For example the following code in an Arduino sketchvoid setup() { // put your setup code here, to run once:}void loop() { // put your main code here, to run repeatedly:String ssid = 'Foo';String password = 'Bar';String cmdString = 'AT+CWJAP='' + ssid + '','' + password + ''' + '';Serial.print(cmdString);delay(1000);}Shows me:AT+CWJAP='Foo','Bar'in the serial monitor. This is exactly what I expect.If you are a beginner you may want to start with some tutorials on C programming.", "num_user_post": " 225", "author": "Vinod"}, {"date": "February 8, 2017 - 11:52 am", "content": "Thanks for your very helpful response Vinod and I will persue this straightforward approach with the Arduino IDE.  I'm sure I will encounter issues as I progress and will post them here for assistance if that's ok. ", "num_user_post": " 2", "author": "Hafod"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/connection-only-works-once/", "posts": [{"date": "January 13, 2017 - 8:29 am", "content": "Hi, I'm doing an update using the GET verb in request.This mechanism is important.It works the first time and then all subsequent connections fail. I have used the domain url and IP address with the same results.I have used a 1minute and 2minute loop to no avail.Code (-keys):DERIVED FROM: https://github.com/squix78/esp8266-projects/blob/master/arduino-ide/thingspeak-data-logger/thingspeak-data-logger.ino/* *  This sketch sends data via HTTP GET requests to thingspeak service every 10 minutes *  You have to set your wifi credentials and your thingspeak key. */#include extern 'C' { #include 'user_interface.h' }const char* ssid = 'Virgin Mobile 4G_38AB4B'; const char* password = 'XXX';const char* host = 'api.thingspeak.com';void setup() {    Serial.begin(115200);    Serial.println();    Serial.println();    Serial.print('Connecting to ');    Serial.println(ssid);    WiFi.begin(ssid, password);    while (WiFi.status() != WL_CONNECTED) {       delay(500);       Serial.print('.');    }    Serial.println('');    Serial.println('WiFi connected');    Serial.println('IP address: ');    Serial.println(WiFi.localIP());    delay(5000); }int value = 0;void loop() {    ++value;    logThingSpeak(value);    delay(60000); }void logThingSpeak(int value) {    Serial.print('connecting to ');    Serial.println(host);    // Use WiFiClient class to create TCP connections    WiFiClient client;    const int httpPort = 80;    if (!client.connect(host, httpPort)) {       Serial.println('connection failed');       return;    }    String url = '/update?api_key=XXX&field1=' + String(value);    Serial.print('Requesting URL: ');    Serial.println(url);    // This will send the request to the server    client.print(String('GET ') + url + ' HTTP/1.1 ' +       'Host: ' + host + ' ' +       'Connection: close');    delay(10);    // Read all the lines of the reply from server and print them to Serial    while (client.available()) {       String line = client.readStringUntil(' ');       Serial.print(line);    }    Serial.println();    Serial.println('closing connection. '); }The serial output:Opening port Port openConnecting to Virgin Mobile 4G_38AB4B . WiFi connected IP address: 192.168.0.134 connecting to api.thingspeak.com Requesting URL: /update?api_key=XXX&field1=1closing connection. connecting to api.thingspeak.comconnection failed connecting to api.thingspeak.comconnection failed connecting to api.thingspeak.comconnection failed connecting to api.thingspeak.comconnection failed Is there something fundamental I am missing? Thanks", "num_user_post": " 4", "author": "Nic Roche"}, {"date": "January 13, 2017 - 9:35 am", "content": "Hi. I would try commenting out the return line to see if the code continues. If that does not work, then I would try restarting the client. Let us know what you discover.", "num_user_post": " 402", "author": "Hans"}, {"date": "January 13, 2017 - 9:47 am", "content": "Are you actually closing the connection that you opened?  I don't see a call to stop()...Consider using the ThingSpeak Communication Library, which supports more ESP-8266 devices.   The code is public, so you can use it as a reference.https://github.com/mathworks/thingspeak-arduino-Rob", "num_user_post": " 47", "author": "Rob Purser"}, {"date": "January 13, 2017 - 6:15 pm", "content": " > I don't see a call to stop()...This is linked github code refactored.In my many iterations I have tried stop(), global WiFiClient, local WiFiClient, timeouts etc.> using the ThingSpeak Communication LibraryIt needs to be a plain get using a querystrings with no specific headers.> so you can use it as a reference.Will have a look. Thanks Rob.", "num_user_post": " 4", "author": "Nic Roche"}, {"date": "January 13, 2017 - 6:25 pm", "content": "Hans said  Hi. I would try commenting out the return line to see if the code continues. If that does not work, then I would try restarting the client. Let us know what you discover.  as there is no response from // Read all the lines of the reply I could not verify an actual success (serial side) doing this, but will try and check the channel feed. EDIT: removed return and no requests received in my channel (other than the first).EDIT2: tried http://www.google.com and had the same issue.", "num_user_post": " 4", "author": "Nic Roche"}, {"date": "January 13, 2017 - 7:55 pm", "content": "I _seem_ to have resolved it.I have modified the order before for WiFi.mode(WIFI_STA);Now it sits just beforeWiFi.begin (ssid, pw);Also I modified the number of connection my access point can handle.It was repoerting 4  connections on a limit of 5; now the limit is 10 - mainly mentioned this for transparency as it does not explain the initial successful connection... Thanks all", "num_user_post": " 4", "author": "Nic Roche"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/how-measure-several-18d20-on-esp8266/", "posts": [{"date": "August 12, 2016 - 2:45 pm", "content": "Hello All Im trying to find out how can i setup on one ESP8266 E12 with thingspeak  dallas sensors?i have an ESP8266 with 3 18D20 sensors that working fine, how do i setup 3 reading in the same time via thingspeak ? can anybody direct me to the right process or code ?thanks", "num_user_post": " 1", "author": "prince1"}, {"date": "August 14, 2016 - 8:44 pm", "content": "Currently you can only post to a specific channel once every 15 seconds. So, if you want 3 devices to post, you may need to do some sort of aggregation where a device collects the data from the other two devices and posts to ThingSpeak every 15 seconds.Alternatively, you can create 3 channels and have each device post to its own channel.", "num_user_post": " 225", "author": "Vinod"}, {"date": "August 14, 2016 - 8:57 pm", "content": "You can certainly post up to 8 values from the same device in a single update.See the example at https://github.com/mathworks/thingspeak-arduino/blob/master/examples/WriteMultipleVoltages/WriteMultipleVoltages.ino  If you post the code that you have it might be easier to get help.", "num_user_post": " 271", "author": "rw950431"}, {"date": "August 14, 2016 - 10:31 pm", "content": "rw950431 is correct - you can update any number of fields in a particular channel at a rate of up to once every 15 seconds.I may have misread the question as needing to have 3 separate ESP8266s updating the same channel. prince1, are you looking to have 3 microcontrollers with 3 sensors each, or one microcontroller with 3 sensors? ", "num_user_post": " 225", "author": "Vinod"}, {"date": "August 15, 2016 - 2:14 am", "content": "Hope this code snippet will help:http://pastebin.com/2qTujkvN", "num_user_post": " 4", "author": "TomSim"}, {"date": "October 3, 2016 - 6:04 am", "content": "Hello All,I came across 'ItKindaWorks' video on YouTube about a month ago and have been working with ESP8266 every since.Currently I am trying to get my ESP01 to publish a topic and upload to Thingspeak the temp of the room.So far it works but I have an odd issue that every time it publishes to Thingspeak the connection is lost and has to reconnect. Please have a look at my code on GitHub and tell me where I have gone wrong.https://raw.githubusercontent.com/ian-tait/ESP8266/master/TempNode/TempNode.inoAny help would be great.Thanks", "num_user_post": " 1", "author": "taity"}, {"date": "December 5, 2016 - 1:52 pm", "content": "If you are using the ESP8266 you only have a limited number of pins. Still possible to connect several  DS18B20 probes as well as other sensors.Have a look here.", "num_user_post": " 1", "author": "Edwin"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/cant-see-temperature-data/", "posts": [{"date": "December 1, 2016 - 11:23 pm", "content": "Please disregard this post. I figured it out. Thanks I just started using Thingspeak. I'm totally new to IoT methods. The hardware is Huzzah esp8266 and DS18B20 one wire temperature sensor. Using Arduino IDE.  This is sketch I'm using:http://internetofthinking.blogspot.com/2016/02/upload-ds18b20-temperature-sensor-data.htmlI can see the Temperature fine on Serial Terminal of IDE. I see WiFi Client connected and and then 230 Temperature:  19.94    But nothing on Thingspeak graph except 'Add Visualizations'I also see this over and over when I start this forum:Warning: in_array() [function.in-array]: Wrong datatype for second argument in /home/content/56/7318356/html/community/wp-content/plugins/simple-press/forum/content/classes/sp-list-topic-class.php on line 337I'm lost!", "num_user_post": " 1", "author": "donde"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/cyber-monday-iot-hobby-kit-by-sparkfun/", "posts": [{"date": "November 27, 2016 - 8:53 pm", "content": "I saw a blog post from SparkFun announcing their, 'Cyber Monday IoT Hobby Kit'. The kit is based on the ESP8266 board and includes some other parts to build some connected projects. They also published tutorials that use ThingSpeak that go along with the kit. If you have all of the parts in the kit, you can build the sample projects with the code on GitHub.If you have been wanting to dive into the world of Internet of Things (IoT) but didn’t know where to start, this kit will certainly get your feet wet. By using the popular Arduino development environment to program the included ESP8266 Thing Dev board, you will learn how to post temperature and humidity data to the open source ThingSpeak data channel. The other exercises show you how to send yourself emails or text messages with the push of a (physical) button and, for the coup de grâce, remotely control 120 V home or office appliances from anywhere in the world. No soldering required!Kit Includes:1x ESP8266 Thing - Dev Board1x Jumper Wires - Connected 6in. (M/M, 20 pack)1x Humidity and Temperature Sensor - RHT031x Breadboard - Self-Adhesive (White)1x Resistor 10K Ohm 1/6th Watt PTH - 20 pack1x USB microB Cable - 6 Foot1x PowerSwitch Tail II1x SparkFun Mini Screwdriver3x Momentary Pushbutton Switch - 12mm Square1x Wall Charger - 5V USB (1A)Documents:Experiment Guide", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/string-from-nodemcu-to-thing-speak-not-working/", "posts": [{"date": "November 25, 2016 - 9:07 am", "content": "Hey Guys,I am trying to interface nodemcu to thingspeak. I have used a generic thingspeak api. Everything about numeric values is fine, but when i try to print a string data on the field the field seems to look empty. i have used the followig code to write my data ThingSpeak.writeField(myChannelNumber, 1, 'High', myWriteAPIKey);please help me out.....thanks in advance", "num_user_post": " 1", "author": "Kavindran"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/arduino%c2%b5panelthigspeak/", "posts": [{"date": "November 24, 2016 - 10:44 am", "content": "Hello to all.For over a year I use this site to show the temperature inside and outside of my house. I do it through a ESP8266 module, connected to the Arduino Mega and use the code shown in the example 'ESP8266 Wifi Temperature Logger' seen in the tutorial.I purchased a µPanel module (http://www.miupanel.com/en-us/) to display the same information on my smartphone.Does anyone know if you can use µPanel to send data to the smartphone and also ThingSpeak to display them in a graph, since the module is a ESP8266 with a particular firmware installed? Thanks in advanceBest regardsMarcoP.S. I do not know if this is the right section, or would be better to post it in the Apps  ", "num_user_post": " 3", "author": "marco508286"}, {"date": "November 24, 2016 - 1:30 pm", "content": "Hi Marco,I am not familiar with the miupanel. You may want to reach out to the creators of that hardware and ask if you can modify the firmware on the ESP8266 on the miupanel. If you can modify the firmware, then you should be able to put your own code on there to send data to ThingSpeak, just like you are doing with your temperature logger.If you do end up doing this, it would be great if you can share the steps needed to do this on the forum.-Vinod", "num_user_post": " 225", "author": "Vinod"}, {"date": "November 24, 2016 - 4:55 pm", "content": "Hi Vinod,given my inexperience, I was not clear enough with my question, because I meant just the opposite. I'll better explain it .The miuPanel can also be set in the 'AT'way and then works as a normal ESP8266. In this case, however, you can not use the app for your smartphone. Since, however, it can operate as TCP socket - file and data transfer (http://www.miupanel.com/Wi-Fi-Module/TCP-SOCKETS-File-Data-Transfer),that I do not know, I was wondering if anyone knew if in this way it was possible to send data to ThingSpeak and, in parallel to the app of smsrtphone.Thank youMarco", "num_user_post": " 3", "author": "marco508286"}, {"date": "November 24, 2016 - 8:59 pm", "content": "There are already several apps available to view thingspeak data on your mobile- suggest you search 'thingspeak mobile app' or similar.   that being said you could relay data onwards from thingspeak by combining the React and ThingHTTP apps to push data to whatever other system you like. Use the 'on data insertion' trigger.", "num_user_post": " 271", "author": "rw950431"}, {"date": "November 25, 2016 - 9:01 am", "content": "Thanks for the answer, it will be very helpful, but at a later time because first I have to be able to send data from miuPanel to ThingSpeak, not with the AT command, but in TCP Socket mode, assuming it is feasible (the question is this ). Thanks again", "num_user_post": " 3", "author": "marco508286"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/setup-mywriteapikey/", "posts": [{"date": "November 10, 2016 - 5:24 pm", "content": "Hi there,I am using ESP module to write some values to Thingspeak and that is working great with the library. I am trying to have user set ssid and password, as well as Thingspeak write key from webpage, but in examples it is hard coded, any idea how I can get this to work? Best regards,vceklic", "num_user_post": " 1", "author": "vceklic"}, {"date": "November 10, 2016 - 7:51 pm", "content": "How are you intending to connect to the webpage without already having correct SSID/password in order to get a WiFi connection?I guess you could store new values in ESP8266 flash memory using the EEPROM function (https://github.com/esp8266/Arduino/tree/master/libraries/EEPROM/examples) and read them back again during startup.", "num_user_post": " 271", "author": "rw950431"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/add-google-guage-to-esp-12e-webserver/", "posts": [{"date": "October 3, 2016 - 4:02 am", "content": "Hi there, this is my first post. I recently got my esp-12e sending data to thingspeak thanks to the blog post https://eryk.io/2016/04/temperature-logging-to-thingspeak-using-esp8266-and-dht22/My channel is up and I've configured the google gauge plugins to show temp and humidity.I'd like to know if can now modify the sketch to have my esp host a home page with the html/java for two gauges, so that I can use a browser from my local wifi network to view the two dials.Thanks in advance.", "num_user_post": " 1", "author": "Aususer5"}, {"date": "October 4, 2016 - 1:09 am", "content": "You can re-assemble the complete web-page by copying the contents of the HTML window (in edit mode) to wherever you want then replacing the line %%PLUGIN_CSS%% with the contents of the CSS window, then replacing the line %%PLUGIN_JAVASCRIPT%% with the contents of the javascript windowHowever this web page will still need to download javascript code from https://ajax.googleapis.com/ajax/libs/jquery/1.9.1/jquery.min.js and https://www.google.com/jsapi as well as data from https://api.thingspeak.com/channels/ in order to work so I'm not sure what you will achieve by hosting the HTML code locally.If you want to completely remove all dependency on the internet you will have to include copies of the javascript files in your sketch (not sure if they will fit in the memory of your ESP-12E) as well as work out a way to serve the data directly rather than via thingspeak.", "num_user_post": " 271", "author": "rw950431"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/receiving-data-from-iot-to-esp8266-using-psoc-4200-ble/", "posts": [{"date": "September 24, 2016 - 10:56 am", "content": "I have interfaced the ESP8266 WIFI to the PSoC4200 BLE board via UART interface.Now I have to receive data from the IOT via a GET request.I searched many forums but I only found solutions with Arduino, and i cant find any solution where they have interfaced it to the PSoC board.So, can you please help me with the solution as to how can i use the esp8266 to receive the data from iot using the GET request. Thank YouRegards", "num_user_post": " 1", "author": "Parth18"}, {"date": "September 24, 2016 - 10:32 pm", "content": "If you are just looking to GET the last datapoint on a channel, you could GET the https://thingspeak.com/channels/<CHANNEL_NUMBER>/fields/<FIELD_NUMBER>/last.json , for example.If you are looking to do more than just read the last value, you may be interested in learning more about the TalkBack app on ThingSpeak. ", "num_user_post": " 225", "author": "Vinod"}, {"date": "September 28, 2016 - 1:25 pm", "content": "Hi, I am not sure what you are looking for. If you are just looking for the format of the GET request t fetch a channel feed, Vinod's answer should help you. For more documentation on this you can visit: GET a Channel Feed, Get a Channel Field Feed. Else, if you are looking for a generic C program and not an Arduino sketch to send a GET request to fetch data from a channel field feed, you can use the following program as a starting point. #include <stdio.h>#include <stdlib.h>#include <unistd.h>#include <sys/socket.h>#include <string.h>#include <sys/types.h>#include <netinet/in.h>#include <netdb.h>void error(const char *msg) { perror(msg); exit(0); }int main(int argc, char** argv){/* Send data to ThingSpeak*/ int portno = 80; char *host = 'api.thingspeak.com';struct hostent *server; struct sockaddr_in serv_addr; int sockfd, bytes;/* Message to send to send to server. Note change the channel number, field number and read API key to that of your channel */ char *message = 'GET /channels/<channelnumber>/fields/<fieldnumber>.json?api_key=<readAPIkey>&results=1 HTTP/1.0';//Buffer to receive the response char response[4096];// Create the socket int sockfd = socket(AF_INET, SOCK_STREAM, 0); if (sockfd < 0) error('ERROR opening socket');// Look for the ip address server = gethostbyname(host); if (server == NULL) error('ERROR, no such host'); // Set the struct settings memset(&serv_addr,0,sizeof(serv_addr)); serv_addr.sin_family = AF_INET; serv_addr.sin_port = htons(portno); memcpy(&serv_addr.sin_addr.s_addr,server->h_addr,server->h_length);// Connect the socket to the server if (connect(sockfd,(struct sockaddr *)&serv_addr,sizeof(serv_addr)) < 0) error('ERROR connecting'); // Send the request bytes = write(sockfd, message, strlen(message)); // Receive the response bytes = read(sockfd, response, 4096); //close the socket close(sockfd); // View the response printf('Response:%s', response); return 0;} The C program shows how to create a socket to connect to ThingSpeak, lookup the IP address for ThingSpeak, connect the socket to ThingSpeak, send the GET request, receive the channel field data and close the socket. You can make this more complicated by checking the number of bytes read and reading more if the buffer was full but this is just a simple and direct way. Hope this helps.", "num_user_post": " 12", "author": "jvasudev"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/connecting-arduino-to-my-android-application/", "posts": [{"date": "August 12, 2016 - 3:32 pm", "content": "so i am using arduino uno with ESP8266-01 wifi module and i made my own application that receives notifications so i want to connect the arduino to this application to send notifications when something specific happens so can you help me please ?", "num_user_post": " 2", "author": "abduu"}, {"date": "August 14, 2016 - 8:42 pm", "content": "Please refer to the tutorials section to see some examples.", "num_user_post": " 225", "author": "Vinod"}]}]}