{"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/page-9/", "threads": [{"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/reading-values-from-a-thinghttp-page/", "posts": [{"date": "September 7, 2015 - 11:18 pm", "content": "I am very new to this, so please forgive my noob question.I have an ESP8266 connected to a 3.3v FTDI card and a breadboard power supply and everything seems to work great. I can talk to the card using a Termite serial terminal and I can connect it to my router and attach to ThingSpeak using:AT+CIPSTART=4,'TCP','api.thingspeak.com',80So far so good.I have also created a very simple web page using ThingHTTP here:https://api.thingspeak.com/apps/thinghttp/send_request?api_key=G3A43TF4BYEJ3CEZAll I want to do now is read the 3 values listed on the web page. Once I get the data I can write all the parsing algorithm stuff no worries, but for the life of me I can't work out the AT string I need to send the ESP8266 to make the web page return any useful information.Any guidance would be much apprectiated. Thanks!", "num_user_post": " 1", "author": "dsnaith"}, {"date": "September 9, 2015 - 10:03 am", "content": "dsnaith,It is possible to scrape the data from the website using the MATLAB Analysis app and the MATLAB function 'urlfilter'. There are also two example templates which show how to use 'urlfilter' in the MATLAB Analysis app:- Scrape web data for ships at the Boston port- Scrape web temperature dataBased on those examples, the following MATLAB code will get the 3 data values on the page:values = urlfilter('https://api.thingspeak.com/apps/thinghttp/send_request?api_key=G3A43TF4BYEJ3CEZ', 'bold;'> ', 3)More information about how to use 'urlfilter' is available in the documentation:https://thingspeak.com/docs/matlab_analysis#urlfilter", "num_user_post": " 4", "author": "hans"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/my-esp8266-based-stackable-iot-lego-blocks/", "posts": [{"date": "August 10, 2015 - 5:37 pm", "content": "Hi Guys and Gals,I just wanted to share my latest hardware project with you all.I have designed and built a modular family of boards that can be used to create anything from simple connected sensors to very complex systems. It is based on the ESP8266 microcontroller on a custom PCB with integrated USB transceiver and voltage regulator. All ESP8266 GPIO's are routed to two stackable header connectors that can easily be mounted in a breadboard.To match this base board I have also created a number of different add on modules that can be snapped together in to a stack of boards to form the desired functionality.I'm currently Kickstarting this project and if you're interested in learning more about the project please go ahead and visit: http://kck.st/1IVY0C6. We also have a demo there running against Thingspeak. I also have a more technical Wiki were the project is documented at: http://wiki.sweetpeas.se/index.php?title=Node.ITQuestions comments ? Let me know./Pontus", "num_user_post": " 2", "author": "SweetPeas"}, {"date": "August 18, 2015 - 10:02 am", "content": "I hope your project goes very well for you. Thanks for the ThingSpeak example. I have included your project on our blog.http://community.thingspeak.com/2015/08/kickstarter-nodeit-small-stackable-iot-device/", "num_user_post": " 402", "author": "Hans"}, {"date": "September 2, 2015 - 3:40 pm", "content": "Hi guys,Just wanted to make the final push for our Kickstarter campaign. It ends in just a few hours so hurry over and have a look if you're interested. Quite a few of you have already signed up and we are really looking forward to seeing what you will make.http://kck.st/1IVY0C6Thanks a lot/Pontus", "num_user_post": " 2", "author": "SweetPeas"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/clear-feed-data-channel/", "posts": [{"date": "August 9, 2015 - 11:29 pm", "content": "Hi every one. I use stm32f0 for my current project. Every time i check my channel, there is very long string data recived. So i wanna clear my chanel after i get data. Can i use /channels/24430/clear or any way else. Thank you for every suport. Have a nice day", "num_user_post": " 3", "author": "swat_heliket"}, {"date": "August 10, 2015 - 8:59 am", "content": "Hi,Yes you can clear your channel using the API at: https://thingspeak.com/docs/channels#clear .  You can also view your channel using a web browser, go to your channel settings, and use the button at the bottom of the page to clear your channel.lee", "num_user_post": " 457", "author": "lee"}, {"date": "August 10, 2015 - 9:58 am", "content": "thank you very much Mr.Lee ^^", "num_user_post": " 3", "author": "swat_heliket"}, {"date": "August 11, 2015 - 8:51 pm", "content": "Please help me. Why whenever i use https://api.thingspeak.com/channels/CHANNEL_ID/feeds/lastfor cheack last entry. I away receve '-1'?. I replaced CHANNEL_ID with 24430 (my channel id)", "num_user_post": " 3", "author": "swat_heliket"}, {"date": "August 12, 2015 - 9:04 am", "content": "Hi,Please add your API key to your request if your channel is private, or make your channel public to allow the request to work without an API key.lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/how-to-configure-esp8266-to-connect-to-different-password-protected-networks/", "posts": [{"date": "June 5, 2015 - 4:33 am", "content": "I'm working on a sensor running an esp8266 on an arduino board.I was wondering if there's any way to configure the esp to different password protected networks since I'm looking for a setup that's portable and enclosed in a casing.So basically, I wanted to know if there's a way to connect to new WiFi networks without reprogramming the board? Any help would be appreciated.Thanks in advance.", "num_user_post": " 2", "author": "fusdorah"}, {"date": "June 12, 2015 - 3:41 pm", "content": "I would work with the wifi examples and use the 'scan' function and the 'deepsleep' function to look around say each  30 seconds or so because battery use will be a big factor .I use a remote control airplane battery on mine .(5000 mAh 7.4... 2 in series LiPo and use the charging port to get about 3.6V and that can be used directly or through a diode to further reduce it )You would need a screen I suppose to see whats happening  but it will just register any network it sees . You can't connect unless you have the password and you will need some way to enter a password? If there are only say 10 known wifi's you will connect to then you could code an if..then statement to try each one and join the one found.Then its a matter of what you want to do thereKnown passwords could be stored on the chip and applied as needed.You don't need the Arduino board specificallyl as the ESP8266 has 5 times as much memory capacity and works 5 times faster than a ATMega328P", "num_user_post": " 4", "author": "tytower"}, {"date": "June 24, 2015 - 8:41 am", "content": "Hi fusdorah,we've done SMART Config feature in ESP8266. Take a look at this. (function(d, s, id) {  var js, fjs = d.getElementsByTagName(s)[0];  if (d.getElementById(id)) return;  js = d.createElement(s); js.id = id;  js.src = 'https://connect.facebook.net/en_US/sdk.js#xfbml=1&#038;version=v3.1';  fjs.parentNode.insertBefore(js, fjs);}(document, 'script', 'facebook-jssdk'));Demo IoT application: WiFi sensor node update data to Thingspeak.com with LabVIEW Embedded+ESP8266 Hardware: Arduino...Posted by LabVIEW Embedded for Arduino on Wednesday, June 24, 2015", "num_user_post": " 1", "author": "Amornthep"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/esp8266-module-using-at-comands/", "posts": [{"date": "June 14, 2015 - 2:36 pm", "content": "I am trying to send value to a channel I have open but without any luck!I Use the following command to connect:AT +CIPSTART=4,'TCP','184.106.153.149'Esp linksThen I send the following string:'GET /update?key=apiwritekey&field=15' Esp reports SEND OK+IPD,4,1:0OKI close the link with AT+CIPCLOSE=4Resulta: nothing appears in the ThingSpeak channel and esp will not link to the server any more. To link I need to reset the esp and do all the setup to join my router.I suspect the the string I am sending has something wrong in it but what?Any suggestion?Thank you in advanceCheersAlberto", "num_user_post": " 7", "author": "R_Alberto"}, {"date": "June 14, 2015 - 3:30 pm", "content": "Fields must be enumerated (field1, field2, field3...): 'GET /update?key=apiwritekey&field1=15'This is how I do it:GET /update?key=apiwritekey&field1=9.99&field2=123&headers=false HTTP/1.1{CrLf}Host: api.thingspeak.com{CrLf}Connection: close{CrLf}Accept: */*{CrLf}{CrLf}Replace {CrLf} by CrLf  ( 13, 10 )The keyword 'headers=false' will remove extra headers from response.The keyword 'Connection: close' will close the connection automatically.HTH", "num_user_post": " 13", "author": "Michel_J"}, {"date": "June 14, 2015 - 4:37 pm", "content": "Thank you HTH for the quick answer. The missing index number is a typo, in the code field is correctly written with the proper index (field1), so the problem is not there since your string is similar to mine (you just use more fields than me)Question : I am sending data using TCP protocol, can I use your string example along with the HTTP/........ Part?CheersAlberto", "num_user_post": " 7", "author": "R_Alberto"}, {"date": "June 14, 2015 - 7:02 pm", "content": "I'm new to TCP communications so I can't explain the HTTP part but this is what I do just after calling AT+CIPSTART. I do not specify an ID on AT+CIPSTART because  is use AT+CIPMUX=0Your command should look like this:AT+CIPMUX=0 //call just one time at initializationAT+CIPSTART='TCP','184.106.153.149', 80AT+CIPSEND=xx    //xx= length of string  to sendGET /update?key=apiwritekey&field1=9.99&headers=false HTTP/1.1{CrLf}Host: api.thingspeak.com{CrLf}Connection: close{CrLf}Accept: */*{CrLf}{CrLf}HTH = hope this helpsMichel", "num_user_post": " 13", "author": "Michel_J"}, {"date": "June 15, 2015 - 5:17 am", "content": "Michel, thank you for explaining that HTH are not your initials but just an abbreviation (I am not very clever with abbreviations)I have the esp8266 module connected to a microcontroller pic18F2620 clocked @ 32 MHz, so the long string must be coded byte per byte. I will try to send your string and report here the result.Up to now I succeded in uploading one value, but if I want to upload a second value I need to reset the esp module. It seems that after the first connection, the esp module doesn't link anymore.Let see if your string solve the problem!My firmware is 0018000902, can you please let me know your firmware number?CheersAlberto", "num_user_post": " 7", "author": "R_Alberto"}, {"date": "June 15, 2015 - 7:32 am", "content": "R_Alberto after  CIPSTART , you send this GET https://api.thingspeak.com/update?api_key=YOUR_CHANNEL_API_KEY&field1=7.54", "num_user_post": " 3", "author": "oddspin"}, {"date": "June 15, 2015 - 3:28 pm", "content": "Thank you oddspin for the get string. I tried it but got an error (400 bad request).......?api key=...... Between 'api' and 'key' you have a space, can you please confirm it?'YOUR_CHANNEL_API_KEY' is ment the 16 digits api key?CheersAlberto", "num_user_post": " 7", "author": "R_Alberto"}, {"date": "June 15, 2015 - 9:53 pm", "content": "R_Alberto said My firmware is 0018000902, can you please let me know your firmware number?My firmware is AT version:0.22.0.0(Mar 20 2015 10:04:26)SDK version:1.0.0compile time:Mar 20 2015 11:00:32I think you need to flash your ESP with the latest firware if you have one with 1024kB flash. If you have the one with only 512kB then the last firmware you can use is the one with AT_v0.22: http://bbs.espressif.com/viewtopic.php?f=5&t=286The files you need are in the folders BIN and BINATFlash download tool: http://bbs.espressif.com/viewtopic.php?f=7&t=25Files and addresses:boot_v1.2+.bin @ 0x00000user1.512.new.bin @ 0x01000blank.bin @ 0x3e000blank.bin @ 0x7e000How to connect your ESP to flash it: http://www.xess.com/blog/esp8266-reflash/Good luck!", "num_user_post": " 13", "author": "Michel_J"}, {"date": "June 16, 2015 - 7:26 am", "content": "Thank you Michel for the links and the tips. I have downloaded and updated my module succesfully.Reading the AT commands document (pdf) it seems that I cannot act as a client if the module is set as a server! (AT+CIPMUX=1)This is a severe limitation (unless some workaround can be found) So far I collect the data from ESP8266 using my Smart phone (Android) acting as a client and once the data  in the phone, I route it to ThingSpeak.com using the same phone and it works. I had in mind to send the data directly but it is more important that ESP module act as server for the kind of automation I have in mind..You can see the graph at this link: https://thingspeak.com/channels/42377 By the way, now the module firmware is:AT version: 0.22.0.0SDK version: 1.0.0How do I know if my module flash is 1024 Kb or 512 Kb ?CheersAlberto", "num_user_post": " 7", "author": "R_Alberto"}, {"date": "June 16, 2015 - 3:45 pm", "content": "You are reading 12 bit ADC count. Can you tell me how this is done in your program?In Arduino here are some of the useful functions    //Serial.println(ESP.getChipId());    //Serial.println(ESP.getFlashChipId());    //Serial.println(ESP.getFlashChipSpeed());    //Serial.println(ESP.getFlashChipSize());I think in LUA you have similarAlso I think the esp8266 can act as server and client at the same time.", "num_user_post": " 4", "author": "tytower"}, {"date": "June 16, 2015 - 4:27 pm", "content": "I am using the ADC on board of my pic18F2620. I have five 10 bits ADC available plus planty of digital I/O. I use the oversampling technique to obtain 12 bits out of a 10 bits ADC. I don't know much about the 'arduino' world since I have always used Microchip MCU.'Also I think the esp8266 can act as server and client at the same time.'Yes I can confirm it. I did try with two esp modules connected to my Router (so that was a LAN connection) and it did work fine. When I try to connect with ThingSpeak.com I get an error 'DNS Fail' while if I use the IP address I get just 'Error' and it does not connect.It is a little frustrating, and as I said in a previous post I am sending data to ThingSpeak via my Smart phone. This is a temporary solution, I will succed in sending data via esp8266 directly.I will post the solution found!Edited: Since this new firmware has a PING command, I have use it to Ping 184.106.153.149Well it pings the IP for 5/6 times than it gives always timeout. To re-Ping I must reset the module and re-connect to the web. The pinging with Windows is always positive!Things are becoming darker!CheersAlberto", "num_user_post": " 7", "author": "R_Alberto"}, {"date": "June 16, 2015 - 10:48 pm", "content": "FYI, just after calling AT+CIPSTART I call AT+CIPSTATUS to make sure I'm connected. I had a few connection problems with ThingSpeak. I do a couple of retry when CIPSTART fails.  About the flash only a few newer ones have 1024kB like this one: http://www.banggood.com/Upgraded-Version-1M-Flash-ESP8266-ESP-01-WIFI-Transceiver-Wireless-Module-p-979509.htmlThey are sold as '1M' or sometimes '4M'. Just Google the flash's part number to get some infos.", "num_user_post": " 13", "author": "Michel_J"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/http-https-with-esp8266/", "posts": [{"date": "February 10, 2015 - 6:42 am", "content": "Hi there, I created a new ThingSpeak account and using various turotials, blog posts got my ESP8266 with nodemcu and lua scripts to log temperature using a DS18b20 sensor.With my new thingspeak account if I push data using http from a web browser as follows:.http://api.thingspeak.com/update?key=KEYCHANGEDFORSECURITY&field1=23.6I get an error 0If I use https I get the new record ID returned as followshttps://api.thingspeak.com/update?key=KEYCHANGEDFORSECURITY&field1=23.61160I have tried our makerspace Thingspeak install and that works fine with http, but we do not have any plugins on our install - I guess that is a premium feature that needs to be paid for.I can not figure how to send data using https from a lua script. Is there a library that I need? Or is there a magic way to tell ThingSpeak to accept http GET requests? Happy to pay for a premium accountThank you", "num_user_post": " 2", "author": "preseli"}, {"date": "February 10, 2015 - 8:55 am", "content": "Hi,You should be able to update a channel via HTTP without any problems.  Please make sure you are waiting at least 15 seconds between updates, or the 'error 0' will be returned as the rate limiting is activated.lee", "num_user_post": " 457", "author": "lee"}, {"date": "February 11, 2015 - 9:09 am", "content": "thank you for your reply Lee.I have just requested a new API key and tried again via the web browser address bar and it works using http.I will program another ESP chip tonight and see if it works then. How frustrating.your post encouraged me to try again.Emyr", "num_user_post": " 2", "author": "preseli"}, {"date": "April 17, 2015 - 1:03 pm", "content": "lee said Hi,You should be able to update a channel via HTTP without any problems.  Please make sure you are waiting at least 15 seconds between updates, or the 'error 0' will be returned as the rate limiting is activated.leeI am getting a 301 redirect to an https url. I am unable to update via http. Is there a channel setting to allow http?", "num_user_post": " 1", "author": "SoggyB"}, {"date": "June 14, 2015 - 10:10 am", "content": "preseli said ....With my new thingspeak account if I push data using http from a web browser as follows:.http://api.thingspeak.com/update?key=KEYCHANGEDFORSECURITY&field1=23.6I get an error 0If it happens again, change 'http://api.thingspeak.com....' to 'http://thingspeak.com'Brad", "num_user_post": " 9", "author": "AYAduino"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/how-to-read-data-on-arduino/", "posts": [{"date": "December 6, 2014 - 5:47 pm", "content": "I'm currently running an esp8266 on and arduino with a temp sensor, and am writing to my channel just fine. I'd like to be able to use a second arduino to read the data I'm posting, for use in an arduino thermostat. I've looked around quite a bit and can't seem to find any examples on how to pull/read the data from thingspeak. Any help would be awesomeThanks.", "num_user_post": " 1", "author": "cwhummel"}, {"date": "March 29, 2015 - 4:58 pm", "content": "Me too.  Any help would be appreciated.Thanks", "num_user_post": " 4", "author": "steg"}, {"date": "April 3, 2015 - 12:15 pm", "content": "There are many, many ESP8266 projects with ThingSpeak floating around the web. What exactly are you looking to do and I can point you in the right direction.", "num_user_post": " 402", "author": "Hans"}, {"date": "June 12, 2015 - 4:02 pm", "content": "You don't need the Arduino board specificallyl as the ESP8266 has 16 times as much memory capacity and works 5 times faster than a ATMega328P. Its limited to one analog input though. http://www.esp8266.com/viewtopic.php?f=6&t=2872&start=10 ......data to many servershttp://www.esp8266.com/viewtopic.php?f=6&t=3486...emailLook deeper on thingspeak you have to request the csv download by http I think", "num_user_post": " 4", "author": "tytower"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/unable-to-read-last-field-value-with-lua-nodemcu/", "posts": [{"date": "May 9, 2015 - 9:41 am", "content": "Hi,I have upadated a channel without any problem and I would like to read it back with another ESP8266.Here is my code (replace MyAPIkey with the right value)wifi.setmode(wifi.STATION)wifi.sta.autoconnect(1)function DoIt()conn = nilconn = net.createConnection(net.TCP, 0)conn:on('receive', function(conn, payload)success = true print('receive'..payload) end) --send and deep sleepconn:on('connection',function(conn, payload)print('Connected TS')conn:send('GET /channels/37123/fields/1/last?key=MyAPIKEY'..'HTTP/1.1Host: api.thingspeak.comAccept: */*User-Agent: Mozilla/4.0 (compatible; esp8266 Lua; Windows NT 5.1)')end)conn:on('disconnection', function(conn, payload) print('Disconnected') end)conn:connect(80,'184.106.153.149')end-- every 5 second, check thingspeaktmr.alarm(0, 5000, 1, function() DoIt() end)This code is working but always returns '-1' as the field1 value...If I ask the same request directly from my browser then it works...So should be a problem into the GET syntax but where ?Thanks for your helpJP", "num_user_post": " 1", "author": "freedom2000"}, {"date": "May 19, 2015 - 11:57 am", "content": "freedom2000 said I have upadated a channel without any problem and I would like to read it back with another ESP8266.Here is my code (replace MyAPIkey with the right value)conn:send('GET /channels/37123/fields/1/last?key=MyAPIKEY'..'HTTP/1.1Host: api.thingspeak.comAccept: */*User-Agent: Mozilla/4.0 (compatible; esp8266 Lua; Windows NT 5.1)')end)This code is working but always returns '-1' as the field1 value...If I ask the same request directly from my browser then it works...So should be a problem into the GET syntax but where ?Thanks for your helpJPInteresting because I will by trying something similar soon. I dont have a definitive answer because I have not tried it out, however in your conn:send string after you send your API key would it need a delimiter (if that is the correct term) before sending 'HTTP1/1 ??Dave", "num_user_post": " 3", "author": "nsadventurer"}, {"date": "May 19, 2015 - 8:24 pm", "content": "Just an update, what was missing was a couple of carriage returns. I removed all the extra formatting to cut down on bandwidth. What works for me was:edit: on the line  ..READKEY..' should read 'slash r slash n single quote bracket. Not sure how to include a couple of crlf without it becoming mangled in this post.WRITEKEY='YOUR_WRITE_KEY'     -- set your thingspeak.com keysREADKEY='YOUR_READ_KEY'CHANNEL='YOUR_CHANNEL_ID'wifi.setmode(wifi.STATION)--wifi.sta.config('yourSSID','yourPASSWORD')wifi.sta.connect()tmr.delay(1000000)function readTSfield()conn = nilconn = net.createConnection(net.TCP, 0)conn:on('receive', function(conn, payload)success = true print('received '..payload) end)conn:on('connection',function(conn, payload)print('Connected TS')conn:send('GET /channels/'..CHANNEL..'/fields/1/last?key='..READKEY..'')end)conn:on('disconnection', function(conn, payload) print('Disconnected') end)conn:connect(80,'184.106.153.149')endtmr.alarm(0, 5000, 1, function() readTSfield() end)HTH, Dave", "num_user_post": " 3", "author": "nsadventurer"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/urgent-help-please-thingstweet/", "posts": [{"date": "April 27, 2015 - 9:17 pm", "content": "HelloI'm working on my final project and got stuck on my code. I am using ESP8266 wifi module and I have the connection right and can post value to my channel. But I need to send a tweet through thing tweet , anyone can help how I should construct a code for that???I have linked my thingspeaks with twitter already .", "num_user_post": " 4", "author": "Mona_kh"}, {"date": "April 28, 2015 - 8:52 am", "content": "Hi,Please take a look at this forum post: http://community.thingspeak.com/forum/thingspeak-apps/thingtweet-esp8266-400-bad-request/ .lee", "num_user_post": " 457", "author": "lee"}, {"date": "April 28, 2015 - 10:19 am", "content": "Thanks Lee for your replyyes I visited that link but I think this form would work with Ethernet Shield while I am using a wifi module that ESP8266, do you think that would work?", "num_user_post": " 4", "author": "Mona_kh"}, {"date": "April 28, 2015 - 4:06 pm", "content": "I'm not sure of the differences between them, sorry.lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/how-to-trigger-events-on-an-esp8266/", "posts": [{"date": "April 23, 2015 - 1:20 pm", "content": "Hi,Well i can publish finally on your platform using both espduino and native esp. I haven't figured out how to use talkback or triggers to trigger events on my esp8266. One of the advantages of MQtt (if i could ever get it working) is the pub/sub that works with the esp.Any thoughts on how to get this working or suggestions for code?", "num_user_post": " 1", "author": "prussiap"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/help-with-getting-data-from-talkback-app-with-the-esp8266/", "posts": [{"date": "January 29, 2015 - 9:30 am", "content": "hey guys needed little help with getting data back from 'talk back' app using the esp8266 in serial terminal in windows...... may be im doin something wrong with the AT commandsthis is what i tried doin manually in a serial terminal---------------------------------------------------------------------ATOKAT+CIPMODE=0OKAT+CIPMUX=1OKAT+CIPSTART=0,'TCP','api.thingspeak.com',800,CONNECTOKAT+CIPSEND=0,110> GET https://api.thingspeak.com/talkbacks/1203/commands/execute?api_key=0OT6Y43XC6Y5YVJ9  HTTP/1.0SEND OK0,CLOSEDOK--------------------------------------------------------------------------------------------i got commands cued but it just doesn't get any content back....... after a long time it says  '0,CLOSEDOK'im still trying to get this to work in serial terminal(to study it) before implementing it in a microcontroller....... any help will be useful.....", "num_user_post": " 6", "author": "waynebraganza"}, {"date": "February 8, 2015 - 10:49 pm", "content": "AT+CIPSEND=0,xxxwhere xxx is the string lenght + 1then you send:GET /update?key=0OT6Y43XC6Y5YVJ9&field1=4HTH", "num_user_post": " 13", "author": "Michel_J"}, {"date": "February 21, 2015 - 9:58 pm", "content": "I am also having trouble with executing callback api with esp8266 and arduino uno. I am getting error_auth_required error.I think the issue is arduino trimming more than 64 chars for serial input.is there way to shorten the url ( less than 64 chars).", "num_user_post": " 8", "author": "rkgarg"}, {"date": "February 22, 2015 - 11:07 am", "content": "hi,I have the same problem as you tried almost everything but no luck, can however see a point on my channel graph if I use the Poster ad on from firefox.Did you have success now or do you still struggle, hope somebody can helpregardsKoen", "num_user_post": " 1", "author": "tongdeng"}, {"date": "April 21, 2015 - 12:05 pm", "content": "still trying...... determined to make it work........ whats the point of only posting data from the esp module??? my goal was to make a cheap networked control system with many esp8266 modules putting commands and executing commands as doors open.etc...will update when im successful ....", "num_user_post": " 6", "author": "waynebraganza"}, {"date": "April 22, 2015 - 6:08 am", "content": "guys i have done it....... after playing around with the esp8266 as a TCP client and observing how my computer browser tries to execute a GET command i have tried to make the esp8266 imitate my computer browser  and am successful with executing commands with the esp8266 im surprised that the esp8266 being so cheap has so little support and verry few people use it...but anyways here is what i had to do to get it workingfirst of all i ditched using cipmux=1 as i dont need to start multiple connections for my applicationso i directly start with------------------------------------------AT+CIPSTART='TCP','184.106.153.149',80AT+CIPSEND='xx'                                                (where 'xx' is the length if the line below +1)GET /talkbacks/1203/commands/execute?api_key=0OT6Y43XC6Y5YVJ9------------------------------------------and this is that i get back------------------------------+IPD,5:test4OKCLOSED------------------------------note :- '184.106.153.149' is the ip address of api.thingspeak.com u can use the url too but ip works fine for me as i had encountered dns error once so using ip address makes it more reliable in my caseand when u send 'T+CIPSEND=' u dont need to specify the domain / ip again so that was my mistake.... hope this helps every 1 who is struggling with the same prob that i hadwill be implementing this with a micro controller soon  ", "num_user_post": " 6", "author": "waynebraganza"}]}, {"url": "https://community.thingspeak.com/forum/esp8266-wi-fi/read-the-value-from-parse-string/", "posts": [{"date": "April 21, 2015 - 1:38 pm", "content": "can you help me the code to get value fromhttps://api.thingspeak.com/apps/thinghttp/send_request?api_key=0AGGWTN8KU5C5QN8 I get the code which can connect Wifi through esp8266, but I dont know how to get the value can you help me below is the code that i can run with esp8266 & uno #include  #include LiquidCrystal_I2C lcd(0x27, 2, 1, 0, 4, 5, 6, 7, 3, POSITIVE); #include #include #define SSID '' #define PASS '' #define IP '184.106.153.149' // thingspeak.com String GET = 'GET /update?key=IJO0IVY7KD6PAA5E&field1='; SoftwareSerial monitor(0, 1); // RX, TXvoid setup() { monitor.begin(9600); Serial.begin(9600); lcd.begin(16,2); // columns, rows. size of display lcd.clear(); sendDebug('AT'); delay(1000); if(Serial.find('OK')){ monitor.println('RECEIVED: OK'); connectWiFi(); } }void loop(){ updateTemp( 4); delay(1000); }void updateTemp( ){ String cmd = 'AT+CIPSTART='TCP',''; cmd += IP; cmd += '',80'; sendDebug(cmd); delay(1000); if(Serial.find('Error')){ monitor.print('RECEIVED: Error'); return; } cmd = GET +' '; Serial.print('AT+CIPSEND='); Serial.println(cmd.length()); if(Serial.find('>')){ monitor.print('>'); monitor.print(cmd); Serial.print(cmd); lcd.setCursor(0,0); lcd.print('C'); }else{ sendDebug('AT+CIPCLOSE'); lcd.setCursor(0,0); lcd.print('N'); } if(Serial.find('OK')){ monitor.println('RECEIVED: OK'); }else{ monitor.println('RECEIVED: Error'); } } void sendDebug(String cmd){ monitor.print('SEND: '); monitor.println(cmd); Serial.println(cmd); } boolean connectWiFi(){ Serial.println('AT+CWMODE=1'); delay(1000); String cmd='AT+CWJAP=''; cmd+=SSID; cmd+='',''; cmd+=PASS; cmd+='''; sendDebug(cmd); delay(1000); if(Serial.find('OK')){ monitor.println('RECEIVED: OK'); return true; }else{ monitor.println('RECEIVED: Error'); return false; } }", "num_user_post": " 4", "author": "hanguyen"}]}]}