{"url": "https://community.thingspeak.com/forum/feature-requests/page-2/", "threads": [{"url": "https://community.thingspeak.com/forum/feature-requests/matlab-charts-in-bigger-size/", "posts": [{"date": "June 11, 2016 - 1:37 am", "content": "It could be added to an HTML link to the matlab chart to open another tab in original size?Thank you.", "num_user_post": " 1", "author": "mtibi75"}, {"date": "October 28, 2016 - 5:07 am", "content": "I would also like this 🙂", "num_user_post": " 4", "author": "Boggie"}, {"date": "October 28, 2016 - 12:25 pm", "content": "Are you looking to view the MATLAB charts in a bigger size? You can do this today with something like this:https://thingspeak.com/apps/matlab_visualizations/<<YOUR_MATLAB_VIZUALIZATION_NUMBER>&gt;?height=400&width=800The height and width parameters are user configurable.For example, see this public MATLAB visualization:https://thingspeak.com/apps/matlab_visualizations/20199?height=400&width=800", "num_user_post": " 225", "author": "Vinod"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/ipv6-support/", "posts": [{"date": "June 20, 2016 - 6:13 pm", "content": "Could you start supporting IPv6 on api.thingspeak.com?", "num_user_post": " 2", "author": "buckett"}, {"date": "June 23, 2016 - 1:59 pm", "content": "Thanks for the request. What are you expecting as support? Are you looking for an IPv6 address to send data to?", "num_user_post": " 402", "author": "Hans"}, {"date": "October 21, 2016 - 8:05 am", "content": "Basically it would just be nice if api.thingspeak.com had a AAAA record in DNS and was listening on that IPv6 address, so that a node that only had a IPv6 address could send in data. ", "num_user_post": " 2", "author": "buckett"}, {"date": "October 21, 2016 - 2:33 pm", "content": "So you do have DNS capabilities on your device, correct?I'm curious, what are you working with that has only IPv6?", "num_user_post": " 34", "author": "JasonW"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/add-update-channel-feed-and-read-channel-feed-to-api-keys-tab/", "posts": [{"date": "October 20, 2016 - 7:41 pm", "content": "A small thing that would make my life easier would be to list the URLs needed to read and update the channel feed on the API keys tab. Currently there is how to use the master key to create/update/clear/delete a whole channel but not how to use the channel key to update the feed or read from the feed.I know its only a few clicks away but it would be convenient to have the urls all there so you could just cut and paste them.", "num_user_post": " 271", "author": "rw950431"}, {"date": "October 20, 2016 - 11:59 pm", "content": "Thanks for the request. Are you looking for what is currently under the Data import/Export tab? Thanks. ", "num_user_post": " 402", "author": "Hans"}, {"date": "October 21, 2016 - 6:10 am", "content": "Doh!  So it is...  All those times I've fossicked through the docco pages and it was one click away...", "num_user_post": " 271", "author": "rw950431"}, {"date": "October 21, 2016 - 8:23 am", "content": "🙂 glad to help ", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/abillity-to-hide-channels-or-decide-which-is-shown-at-the-top/", "posts": [{"date": "October 20, 2016 - 6:47 am", "content": "I'm a happy user of ThingSpeak, and love how easy it is to get something up and running. But since a lot of loggers mean a lot of channels, and each channel can only hold 8 values per entry, I end up with a lot of channels. Some of these I use a lot, some not so much. Some of the the ones I dont use as much are the oldest ones, that is listed at the top, so I have to scroll down each time I go to the channels page.It would be great if I could mark a channel as 'hidden', and had to press a 'show hidden channels' on the 'my channels' page to see it.Otherwise it would be great to be able to order the channels in the list as I wish, so I could push the rarely used ones to the bottom. I hope someone reads this and decides its a good idea 🙂/Henrik", "num_user_post": " 4", "author": "Boggie"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/skip-nil-when-displaying-channel-status-updates/", "posts": [{"date": "August 27, 2016 - 7:51 am", "content": "Probably I misunderstand the idea which stands behind Channel Status Updates, but I'd expect this 'widget' to show last data (statuses) except for 'nil' values.At the moment a status entry gets 'nil' if it isn't posted along with data entry.And in a common scenario channel status is usually updated rarely (every 6 hours in my case), while data is posted rather frequently (every 5 minutes in my case), which effectively makes Channel Status Updates 'widget' look empty most of the time, which isn't convenient.I'd like to have an option like 'Don't show 'nil' values' for Channel Status Updates.BTW this 'widget' doesn't allow tuning like how many last entries to show, and I guess this limit is about 60 entries or so, which would be fine if empty values were ignored.", "num_user_post": " 4", "author": "Anton_K"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/react-no-data-check/", "posts": [{"date": "August 11, 2016 - 3:00 pm", "content": "In the React Application, I would like the 'Test Frequency' time to have longer times available in the drop down list.The current options are testing every 10, 30 and 60 minutes.I would like 12 and 24 hours to be added too.  The ultimate would a user entered field for the number of minutes between checks.In my application, I'm expecting data to be logged every minute and would like to know if nothing gets logged. When that happens I know that some action will need to be taken to fix the problem. I use a React to test for no data being logged, when it receives no data, I use ThingHTTP to send a message to a Slack stream that eventually ends up on my phone.  With Run only the first time - I may miss that one message. With Run every time - I would receive many messages before I have time to look into the problem.  My plan is to have two React's, one set to check every 30 minutes for data and run the action one time and the second React to check every 24 hours and run the action every time. This would give a short notification that something is wrong and a daily reminder that something is wrong.Having a user configurable Test Frequency will allow the most flexibility, but I'm willing to settle on 12 or 24 hours.Another possible solution is to allow TimeControl to run a React script. Currently a time control doesn't allow you to run a React script.", "num_user_post": " 3", "author": "dstacer"}, {"date": "August 12, 2016 - 12:10 am", "content": "Hi dstacer, Please read these messages and see if that can be of some help http://community.thingspeak.com/forum/thingspeak-apps/no-data-react-tweet-not-working/#p3049http://community.thingspeak.com/forum/thingspeak-apps/react-not-reacting-with-thinghttp/#p3127 Good luckH.S.", "num_user_post": " 91", "author": "piajola"}, {"date": "August 15, 2016 - 2:09 pm", "content": "The first link idea looks like it will work.  I'll give that that a try.Schedule a time control to run once a day, running the short MATLAB code, looking for lack of data over 24 hours then send notification.The goal would be to only send a message once a day.  How do you persist data out side of a channel or is the channel the only way to save data between runs of a MATLAB program?If I could keep track of when the last notification was sent, it could check more often. If the failure occurred one second after the last check, the notification may be close to two days old before it was sent. If I could save when the last notification was sent (for no data) then it could check more frequently but only send the notification once a day.It could use another channel to keep track of that but using another channel seems a bit overkill.", "num_user_post": " 3", "author": "dstacer"}, {"date": "August 15, 2016 - 8:12 pm", "content": "Hi dstacer,or is the channel the only way to save data between runs of a MATLAB programTo me, your 'persist' is via another private channel (you are the only allowed to see it, if you need/wish). You have server memory for your variables when the code is running. You start the code the way you choose, it runs 1-2 seconds then you are out.Your workhorse channel A is checked 'every minute' via Matlab Analysis X, writing 'fails' to your (private) channel B ... then at 00:00:00 everyday via Matlab Analysis Y using webwrite sends all 'fails' to your 'box' or simply see channel B if you do not need/wish to know 'fails' inmediatelyusing another channel seems a bit overkillOverkill if you can 'persist' another way Again, good luck", "num_user_post": " 91", "author": "piajola"}, {"date": "August 17, 2016 - 4:08 pm", "content": "Thanks for all of the suggestions. I have it working as desired.The problem to solve was 'Notify me once a day if you don't see any data for more than an hour'  This is designed to keep bugging me if there is a long term outage if my IOT device stops sending data.I use a time control to run the code once an hour.Here is my code:NotifyInterval = minutes(1440)  %Interval in minutes to send a notification, set to once a day%get the current date timeCurrentTime = datetime('now','TimeZone','America/New_York')      % use your TimeZone What time is it 'right now' (local) when running this%tinterval - calculated desired outage time intervalDataLossInterval = CurrentTime - hours(1)     % here 1 hour without data%Read the last data from channel[Data,LastTimeData] = thingSpeakRead(124xxxx , 'fields', [1]);   LastTimeData    % to see the time of your last recorded pointnodata = LastTimeData < DataLossIntervalif nodata    % Its past when we expected data so we need to notify but only want to notify every x hours    'no data'    %Read the last time we notified from a private channel    [Data,LastNotify] = thingSpeakRead(145xxxx ,'ReadKey','xxxxxxx', 'fields', [1]);       LastNotify   % to see the time of your last recorded point you can erase this line    notify = CurrentTime - LastNotify    if notify > NotifyInterval        ' time to notify'        thingSpeakWrite(145xxx ,1,'WriteKey','xxxxxxxx'); % write a new entry to the last notified channel        %Do what ever you want here to notify here,  I post to a slack channel that notifies my phone        dd = ['No Data Received since: ' datestr(LastTimeData)]        response = webwrite('https://xxxxxgroup.slack.com/services/hooks/slackbot?token=xxxxxxxxxxxxxxxxxxx&channel=%23channeame',dd)    endend", "num_user_post": " 3", "author": "dstacer"}, {"date": "August 17, 2016 - 5:01 pm", "content": "Hi dstacer, I have it working as desired.Glad to know you are an 'Ioter' in ThingSpeak now ... your Thing is Speaking to you  Cheers", "num_user_post": " 91", "author": "piajola"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/reference-status-variables/", "posts": [{"date": "August 2, 2016 - 3:35 am", "content": "hi.i have 2 issues.1. is there any progress in a   'modify' , or 'delete'  record feature  , of the data set accumulated within thingspeak ?  right now it seems we can only accumulate data  and erase a whole channel ? 2. same issue actually    what i need is a reference  single  record , which  presents  a status of variables whitin my runtime algorithm (lets say - pump is running  or  pump is closed   or  too humid  or not enough light or just  true/false flags) this record will be modified according to decitions made by algorithm. So its  like holding a profile of a process running. i could ofcourse add new record to existing db ,  and read it as most current status to relate to. but it makes no sense  for obvious reasons. just a dumb data accumulation. thanks  oded", "num_user_post": " 3", "author": "oded"}, {"date": "August 2, 2016 - 10:13 pm", "content": "As you have found thingspeak is set up to log time-series data: there is no modify or delete commands. Sounds like you actually want a key/value store like mongodb or redis.  Theres a list of free ones in this stackoverflow thread ", "num_user_post": " 271", "author": "rw950431"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/multiplication-between-fields/", "posts": [{"date": "July 5, 2016 - 5:44 am", "content": "HiI have Lan Controller 2.0. I sending data from 2 sensor (current and voltage) to field 1 and field 2. But I need view power (W) and energy (Wh), but I cannot multiply data before sending. Can I multiply 2 fields (power= current*voltage) in charts?Thank you for your answer.Brano", "num_user_post": " 1", "author": "BranoMo"}, {"date": "July 5, 2016 - 6:51 pm", "content": "Not with the basic TS charts.. But you should be able to do it in a Matlab visualisaton- hopefully someone who knows matlab can help with code.", "num_user_post": " 271", "author": "rw950431"}, {"date": "July 11, 2016 - 10:42 am", "content": "As rw950431 user mentioned, you wouldn't be able to implement the multiplication in the basic ThingSpeak charts. You could implement this in one of two ways:1. Create a chart using a MATLAB Visualization App. Refer to the following page for examples:https://www.mathworks.com/help/thingspeak/matlab-visualizations-app.html2. Create a custom Plugin App. Refer to the following page for examples:https://www.mathworks.com/help/thingspeak/plugins-app.html Here is an example of implementing this logic in a MATLAB Visualization App [replace channeID, read_API_Key, voltage_field_number, current_field_number with appropriate values]: [voltage, time] = thingSpeakRead(<channelID>, 'ReadKey', '<read_API_Key>', 'Fields', <voltage_field_number>, 'NumPoints', 10);current = thingSpeakRead(<channelID>, 'ReadKey', '<read_API_Key>', 'Fields', <current_field_number>, 'NumPoints', 10);power = current .* voltage;thingSpeakPlot(time, power)", "num_user_post": " 62", "author": "Adarsh_Murthy"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/disable-chart-data-sample-markers/", "posts": [{"date": "July 20, 2015 - 1:08 am", "content": "The round red blobs that mark the data samples on the charts are useful to identify individual samples, but it would be really nice to be able to disable them as an edit chart display option.In situations where a fine detailed chart line is required the sample markers completely swamp the data line. It's like a fine line drawing done with a crayon. If I reduce the number of displayed samples the number of markers reduce but so does the resolution of the data line.I'm new to ThingSpeak and I really like it, but to optionally disable the display of the markers would be really nice.Is this possible?Thanks.", "num_user_post": " 5", "author": "rod"}, {"date": "July 20, 2015 - 8:46 am", "content": "Hi,You can create a JavaScript plugin, paste in the charting code, and modify the markers there.  You'd just have to modify the lines:  marker: { radius: 3 }Here is some documentation for other chart options if you're using a custom plugin: http://api.highcharts.com/highcharts .lee", "num_user_post": " 457", "author": "lee"}, {"date": "July 20, 2015 - 6:40 pm", "content": "Hi Lee,I'm really unfamiliar with using plugins in this situation. I have followed the examples for the Google Gauge plugin and modified aspects of the gauge but how do I get from there to getting the code for the charts and installing and displaying charts via a plugin.I understand the concept but I would really appreciate some direction. It looks really flexible and I'm keen to get involved but could you point me to a tutorial or give some simple guidance?Thanks for your comments and help.", "num_user_post": " 5", "author": "rod"}, {"date": "July 21, 2015 - 11:37 am", "content": "Hi,Can you try using the 'Chart with Multiple Series' template for a new plugin?  All of the chart code should be there for you to modify.Alternatively, you can try viewing the page source at https://thingspeak.com/channels/9/charts/1 , and copying all of that code into a new plugin.If you're still stuck, let me know your channel number and I can create a plugin for you.  (You'll have to make sure your chart is public.)lee", "num_user_post": " 457", "author": "lee"}, {"date": "July 21, 2015 - 5:45 pm", "content": "Thanks for the help Lee. I have modified the above example (My House Light) and have achieved a zero (1) marker size which allows the chart line to look very nice and detailed. I'm very impressed with what can be achieved with custom plugins.Unfortunately all the code looks very unfamiliar to an embedded C programmer like me. If I dived in it would take a lot of time to generate the whole application from scratch and I can't do that right now.For my purpose the standard public charts are very good, the only thing missing is a check box to reduce the marker size as part of the chart options. It would be so simple and make such a huge improvement to the appearance of the charts.Is this something you would support or possibly even be able to do?", "num_user_post": " 5", "author": "rod"}, {"date": "July 22, 2015 - 8:54 am", "content": "Hi,We'll keep this in mind when we work on improving the charting options, it's a good suggestion.lee", "num_user_post": " 457", "author": "lee"}, {"date": "May 29, 2016 - 2:02 am", "content": "Yes... disable/resize the red dots are really usefull for me!", "num_user_post": " 4", "author": "naamah75"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/chart-types/", "posts": [{"date": "February 27, 2016 - 9:24 am", "content": "Hi,sorry because of my English. in some cases, when i change the chart type to bar or column nothing display and in one case after the i change the type of chart, all of the field data was cleared and i don't know why.is there any limits in chart point for bar or column mode?", "num_user_post": " 4", "author": "NNH"}, {"date": "February 29, 2016 - 9:45 am", "content": "Hi, In the Bar mode a chart is created with time on Y-axis and the measured data on the x-axis represented as horizontal bars. Bar mode also defaults the Timescale property to 30. Check if with these settings you have sufficient data to visualize in the bar. You can increase the amount of data being visualized by increasing the number of results or days.Thanks,Adarsh", "num_user_post": " 62", "author": "Adarsh_Murthy"}, {"date": "February 29, 2016 - 4:15 pm", "content": "I will check it, Thanks Adrash.", "num_user_post": " 4", "author": "NNH"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/multiple-data-feeds-on-one-chart/", "posts": [{"date": "July 19, 2011 - 8:32 am", "content": "Hi ThingSpeak team. Great service! -I have played around with the charts a bit; really nice  One feature i'd like to request is to be able to show more than one graph in each chart.It would make it a lot easier to compare inside temperature to outside temperature or radiator forward temperature to return temperature, etc. I have tried to create an example below (photoshopped), to show my idea:  Possible options:-choose different colors for each graph-choose different line styles / thickness for each graph-common y-axis for all graphs in chart (equal scaling)-option to add more than 2 graphs to a chart It would also be nice to be able to show historical data from / to a specific time, IE thursday one week ago or some such! ", "num_user_post": " 5", "author": "spumanti"}, {"date": "May 27, 2012 - 6:05 pm", "content": "Hello,I successfully create a plugin with two or more curves, but I also seeking something more generic.https://www.thingspeak.com/plugins/801http://pastebin.com/cBP5V4sQThere are many things to fix can you help me?Your comments are welcome, I did not have much experience in javascript - I want a jQuery function that allows to wait for loading data before proceeding to highchart. – I try to get the parameters (color, thickness, ..) from the url – And finally, I try to retrieve the name of the feeds without making stupid test in the code.", "num_user_post": " 5", "author": "benni_75"}, {"date": "October 14, 2014 - 7:53 pm", "content": "We've recently added a plugin to display multiple series on a single chart.  To access it, create a new plugin and select 'Chart With Multiple Series' as the template.lee", "num_user_post": " 457", "author": "lee"}, {"date": "February 15, 2016 - 9:28 am", "content": "Hi, lee, your plugin to display multiple series is what im looking for. But i whant to display in the same chart diferent values from the same field.Like example Field 1: Temperatureand select to displaySeries1: TodaySeries1: 1 day agoSeries1: 2 day agoSeries1: 3 day agoSeries1: 4 day agoSeries1: 6 day agoSeries1: 7 day agoin such a way to make easy to compare the evolution of some field.", "num_user_post": " 8", "author": "oskimark1"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/best-way-to-do-9-channels-for-multiple-colors/", "posts": [{"date": "December 1, 2015 - 12:51 pm", "content": "I have an arduino that controls the lighting in my apartment. I'd like to have each color be a channel, but the bookshelf it is mounted to has 3 shelves (3 shelves x 3 (R,G, B) == 9 channels). Are there any plans to add a configurable amount of channels? Or any recommendations on how I could work around this?Thanks and very cool product!Regards,Chris", "num_user_post": " 1", "author": "clamport"}, {"date": "December 1, 2015 - 2:49 pm", "content": "clamport,Currently there are no limits imposed on the number of Channels a user may create. However, each Channel's Feed has 8 'Fields' and several additional meta data fields (ex: status, latitude, longitude, ect...). An update to a Channel's Feed may only include data written to any of these specified fields. It is possible to work around this limitation by doing some creative data mapping.For example, you may write to a Channel's Feed in the following wayfield1: shelf_numberfield2: red_valuefield3: green_valuefield4: blue_valueA MATLAB Analysis app may be used to then read the data from the Channel using the MATLAB function 'thingSpeakRead' and perform some action. A React app may be used to trigger the MATLAB Analysis app to execute the MATLAB code on data insertion to the Channel. The drawback of this approach, where a shelf is a different data point, is that data can only be written to a Channel every 15 seconds. You can use custom 'shelf' values which may set selves 1, 2, and 3 all to the specified RGB values or others which set shelves 1 and 2 or any combination.There is a slight workaround for a 'batch upload' using the MATLAB Analysis app. Please see lee's post for more information: http://community.thingspeak.com/forum/thingspeak-api/rfe-minimum-for-feed-api/#p2372", "num_user_post": " 4", "author": "hans"}]}]}