{"url": "https://community.thingspeak.com/forum/feature-requests/page-1/", "threads": [{"url": "https://community.thingspeak.com/forum/feature-requests/more-metadata-fields-to-channel/", "posts": [{"date": "June 28, 2014 - 8:51 am", "content": "I wish i had the ability to add more fields to a channel. Something similar to the Description.Those fields should be visible in the API call (https://thingspeak.com/channels/channelID/feed.json)but may not be visible in public/private channel pages.  You are great!", "num_user_post": " 12", "author": "DodBasim"}, {"date": "June 29, 2014 - 1:04 pm", "content": "Hi,Does the 'status' field cover what you're looking for?  Here's an example:https://api.thingspeak.com/channels/1417/status.json?results=30&days=5lee", "num_user_post": " 457", "author": "lee"}, {"date": "June 29, 2014 - 8:01 pm", "content": "No, look at 'custom_property' in the channels response belowchannel: {id: 1name: 'RPi'description: 'This is a very cool sensor'custom_property: 'Any Text/JSON/XML'latitude: '34.016331'longitude: '-118.191111'field1: 'CPU'created_at: '2014-06-24T05:21:38Z'updated_at: '2014-06-29T23:59:45Z'elevation: '40'last_entry_id: 1158}The idea is to give more info about the sensor/channel when calling with API", "num_user_post": " 12", "author": "DodBasim"}, {"date": "June 30, 2014 - 1:06 pm", "content": "Hi,We just added a new Channel property for you, called 'metadata'.  You can set it on the Channel settings page, and it can store an unlimited amount of JSON/XML or any other data.  If you want to include the metadata  when getting the Channel feeds, just add 'metadata=true'.  Please see https://thingspeak.com/docs/channels#get_feed for further documentation.lee", "num_user_post": " 457", "author": "lee"}, {"date": "July 1, 2014 - 4:59 am", "content": "Thank you very much for doing this.Once again, you showed how flexible and responsive you are.Keep up the good work", "num_user_post": " 12", "author": "DodBasim"}, {"date": "July 1, 2014 - 4:21 pm", "content": "One more thing...Do you think you will be able to add the option to update this field via HTTP POST call?One more thing 2...Any plans to add a global Status field to the channel that will be accessible via HTTP POST/GET?Thanks again...", "num_user_post": " 12", "author": "DodBasim"}, {"date": "July 2, 2014 - 11:46 am", "content": "Hi,We added the ability to update a Channel via the API: https://thingspeak.com/docs/channels#update .Please use the newly added 'metadata' field for status requests.  For example, you can store JSON metadata info as{ 'status': 'online', 'otherinfo', 'etc.' }and then parse out the status from the response.lee", "num_user_post": " 457", "author": "lee"}, {"date": "July 3, 2014 - 4:22 am", "content": "works like a charm", "num_user_post": " 12", "author": "DodBasim"}, {"date": "March 8, 2018 - 2:22 pm", "content": "Does not seem to work in thingSpeakRead() API call.", "num_user_post": " 27", "author": "heh"}, {"date": "March 8, 2018 - 3:18 pm", "content": "We currently do not support metadata in the thingSpeakRead MATLAB function, but you can use webread.indoorChannelData = webread(strcat('https://api.thingspeak.com/channels/', ...                                    num2str(indoorChannelID), ...                                    '/feeds.json?metadata=true&api_key=', ...                                    indoorChannelReadKey));", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/do-not-transmit-unencrypted-login-credentials-to-community-server/", "posts": [{"date": "December 7, 2016 - 12:39 pm", "content": "Dear Thingspeak Community administrators,I have just signed up for the forum and could not believe that the login credentials are not protected in any way. Even the password is being transmitted in complete clear text.Is this really necessary these days? Personally, I know better than to reuse passwords for different services, but still... So, I kindly ask you to either switch the whole server to TLS/SSL or, if you are concerned about the additional load, at least protect the login process including password reset, etc. Best regards,Kilian", "num_user_post": " 3", "author": "kilian"}, {"date": "March 7, 2018 - 3:19 pm", "content": "Killian,The ThingSpeak Community now supports HTTPS.  Thank you for your feedback.The ThingSpeak site also supports HTTPS, and did previously.", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/download-csv-clearing-data-improvements-requests/", "posts": [{"date": "January 2, 2018 - 10:21 pm", "content": "Hello, there is a good feature called 'Download all of this Channel's feeds in CSV format' but it would be even better if it would be possible to download the data for the last day/week/month/year instead of downloading the whole data.Also, it would be great to have the ability to clear the data for the last day/week/month/year instead of clearing all data.The ability to clear the data for the last day or week would be very useful when sensors for some reason start to send some wrong data to ThingSpeak.", "num_user_post": " 3", "author": "Deimos"}, {"date": "January 3, 2018 - 2:30 pm", "content": "You can complete the desired download with a REST API call. https://thingspeak.com/channels/276330/feed.csvorhttps://thingspeak.com/channels/276330/feed.jsonIf you want more than one day, add the days parameterhttps://thingspeak.com/channels/276330/feed.csv?days=3See the get channel feed documentation or get a channel field feed documentation for more parameters.You can append multiple parameters using &, for example:https://thingspeak.com/channels/276330/feed.json?days=3&sum=1440 If you want, go to your channel private view and use the 'Data Export' button there.  Its next to the 'Add Visualizations' button.  When you press the button, it builds the URL for you and opens a new tab (for .json or .xml).  Look at the address and you can modify it to what you need.  The default is 1 day or 8000 points.  For '.csv' you can see the address when you hover over the '.csv', or just change the address from '.json' to '.csv'.It is currently not possible to selectively delete data, I will look into if it could be included in a future update, thanks for your suggestions.", "num_user_post": " 401", "author": "cstapels"}, {"date": "January 8, 2018 - 5:51 pm", "content": "As of January 2018, ThingSpeak is not yet expiring any data.  Your past data usage does not count against your new capacity. If you intend to convert to a free license, the easiest thing you can do is slow down the data rate from your devices. Your existing data collected on ThingSpeak will remain. Slowing down of ingesting data to ThingSpeak will ensure you don't exhaust the capacity.  If you want to download a complete copy of your historical data, please reach out to support 'at' mathworks dot com with details about your channel that you want the data for.  We can email you a csv file or a link to the file of your complete data set.", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/mqtt-optimization/", "posts": [{"date": "June 27, 2017 - 7:18 am", "content": "The publish url for MQTT is unnecessarily long for a protocol designed to be efficient.'channels/123456/publish/fields/field1/APIKEY'Could be shortened to, for example:'c/123456/1/APIKEY'This saves 27 characters.", "num_user_post": " 1", "author": "ArbitraryUserN01"}, {"date": "November 22, 2017 - 4:56 pm", "content": "I totally agree!For instance, using popular Arduino library PubSubClient it is impossible to send data for all 8 fields at once because total string length exceeds predefined array of 128 bytes.", "num_user_post": " 2", "author": "CoreInside"}, {"date": "November 22, 2017 - 5:10 pm", "content": "As an example 160 bytes can become 115 without sacrificing ease of human-reading:channels/123456/publish/ABCDEFGHIJKLMNOP/field1=-123.45&field2=-123.45&field3=-123.45&field4=-123.45&field5=-123.45&field6=-123.45&field7=-123.45&field8=-123.45c/123456/p/ABCDEFGHIJKLMNOP/f1=-123.45&f2=-123.45&f3=-123.45&f4=-123.45&f5=-123.45&f6=-123.45&f7=-123.45&f8=-123.45Please support the short form!", "num_user_post": " 2", "author": "CoreInside"}, {"date": "November 29, 2017 - 9:07 am", "content": "You can easily adjust the Ardunio PubSubClient library to accommodate larger strings.In PubSubClient.h just increase MQTT_MAX_PACKET_SIZE.", "num_user_post": " 34", "author": "JasonW"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/user-level-chart-scaling/", "posts": [{"date": "October 24, 2017 - 9:29 am", "content": "Hello guys, newcomer here!Recently transferred my home automation project from Xively to Thingspeak - being drawn by the awesome Matlab support features.However, the feature that I miss the most from Xively is the ability to change the X-axis scaling of the charts by the user - if I understand correctly it can only be changed in the settings of the channel, but not in public view. In Xively anybody could make the chart show the data from the last hour/day/month etc. by just selecting the desired X-axis display range from the drop-down list.Is it so that on Thingspeak the only way to solve this issue is to create multiple Matlab plots, each with appropriate zoom level? Or maybe I'm missing something?Cheers!", "num_user_post": " 1", "author": "Maxisokol"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/any-way-to-place-a-line-on-the-chart-for-warning-levels-on-radiation-monitor/", "posts": [{"date": "September 2, 2017 - 4:40 pm", "content": "I am displaying radiation levels in uSV/H and Counts Per Minute.  Is there a way to place colored lines on my chart for the warning levels?  The warning levels for uSV/H (microSieverts per hour) are yellow (hazardous) - 0.56, and red (dangerous) - 1.88, and the warning levels for CPM are yellow - 60, and red - 200.  So I want to place a yellow and a red line on my charts to indicate hazardous and dangerous levels.", "num_user_post": " 1", "author": "lane5625"}, {"date": "September 14, 2017 - 3:44 pm", "content": "If you create a MATLAB visualization to create your plot, you can use refline to create a reference line.For example:plot(1:10,11:20);hold onhline=refline([0,15]);hline.Color = 'g';line2=refline([0 18]);line2.Color='r';line2.LineWidth=5;", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/esp32-arduino-library/", "posts": [{"date": "August 15, 2017 - 9:41 am", "content": "I am trying to compile code for my new esp32 module but thingspeak library won´t compile for esp32.I would like that someone with programming skills can update the old library, the old library works with my esp8266 and same code....", "num_user_post": " 1", "author": "Gottmoz9"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/javascript-query/", "posts": [{"date": "July 31, 2017 - 10:31 am", "content": "Not sure if this is already doable... In my JavaScript I have a number of variables as shown: stop = new google.maps.LatLng(49.093914487013, -117.71569423377514)waypts.push({location: stop,stopover: true The line in Bold is what I need help with. I have data transmitted to Thingspeak. I have an API that allows me to select the exact value to query; what I need to know is how to use a GET statement (Or anything that would work) to have that Stopover line be True or False based on the result. So IF the result queried by the API is over 8, it's TRUE, if it's under it is false. The API line looks like this:  GET https://api.thingspeak.com/channels/****/fields/1.json?results=2So How do I set that Bold field to query this and either be TRUE or FALSE based upon the result of this query? If you need any more info please reply and I can fill in any blanks, but I'm reallllly needing some help here. Thank you!      ", "num_user_post": " 8", "author": "jteindl"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/mqtt-bridge/", "posts": [{"date": "February 4, 2014 - 8:54 pm", "content": "From the website http://www.mqtt.orgMQTT is a machine-to-machine (M2M)/'Internet of Things' connectivity protocol. It was designed as an extremely lightweight publish/subscribe messaging transport. It is useful for connections with remote locations where a small code footprint is required and/or network bandwidth is at a premium.", "num_user_post": " 271", "author": "rw950431"}, {"date": "December 28, 2014 - 11:34 pm", "content": "+1  : )", "num_user_post": " 1", "author": "jonn26"}, {"date": "December 30, 2015 - 3:27 am", "content": "It would be nice if you could add MQTT support for thingspeak - e.g. that my IoT devices could publish and subscribe to topics using MQTT. This is very lightweight and easiest way to update topic feeds and receive updates from thingspeak apps.You don't have to implement any API, as MQTT is supported already by many platforms, just provide ability to either connect to your MQTT broker, or thingspeak should act like a MQTT client, connecting to any online MQTT broker as client.", "num_user_post": " 3", "author": "lingvo"}, {"date": "January 1, 2016 - 11:48 pm", "content": "This would be a great feature to have, as MQTT has become something of a standard, and ThingSpeak provides complementary functionality (the ability to archive and graphically display data). It would be wonderful to be able to have ThingSpeak 'subscribe' to an MQTT topic on a given broker and display and archive the data that comes in.", "num_user_post": " 1", "author": "JoeQ"}, {"date": "March 10, 2016 - 6:16 am", "content": "Hello, maybe I have sollution: http://community.thingspeak.com/forum/thingspeak-apps/mqspeak-mqtt-to-thinkspeak-bridge/", "num_user_post": " 3", "author": "buben"}, {"date": "July 11, 2016 - 7:36 pm", "content": "Thank you for your feature request. The development team is actively investigating support for MQTT protocol in Thingspeak. It will be very helpful to the team to get additional details of your application; Specifically, your anticipated workflows, performance requirements, and details about how you intend to use MQTT support. Please write to support@thingspeak.com and someone on the development team may be in touch with you directly.", "num_user_post": " 225", "author": "Vinod"}, {"date": "December 5, 2016 - 6:41 pm", "content": "Holy smokes Batman!  When did this happen? https://au.mathworks.com/help/thingspeak/mqtt-api.html Seems like its publish-only at this stage (no documented way to subscribe to a channel) but still a big step forward.  Good work guys", "num_user_post": " 271", "author": "rw950431"}, {"date": "December 6, 2016 - 8:32 am", "content": "Sharp eyes -- we went live yesterday with this.   And yes -- It's MQTT publish only at this point.All the best,-Rob", "num_user_post": " 47", "author": "Rob Purser"}, {"date": "December 6, 2016 - 4:55 pm", "content": "Top job, sterling work, well done! Is there any documentation available RE MQTT publish performance / latency / limits etc for free accounts?", "num_user_post": " 1", "author": "Joe_1"}, {"date": "December 6, 2016 - 7:20 pm", "content": "Here's the documentation: https://www.mathworks.com/help/thingspeak/mqtt-api.htmlUsers with free thingspeak accounts can only push data to a channel once every 15s. That holds true via the REST API and the MQTT API. The MQTT publish service is a Quality of Service (QoS) = 0 level API. There is currently no difference in the MQTT API for free v/s paid accounts.", "num_user_post": " 225", "author": "Vinod"}, {"date": "December 7, 2016 - 12:16 pm", "content": "First of all, thank you very much for implementing the MQTT publish.In my tests I have however noticed, that the server ignores Keep Alive values of greater than 60 seconds (technically speaking greater than 40) and drops the connection after short below 60 seconds of inactivity. The same is true for sessions with a Keep Alive value of 0 (i.e. disabled).This is standard-conforming behavior, as the server is allowed to disconnect at any time, regardless of the Keep Alive. However, it is not really nice regarding low-power applications, as one of two things currently have to happen:A Keep Alive of less than 60 has to be chosen and the client device has to wake up and send a packet every 55 seconds (to be safe). OrFor every data packet with a period of greater than one minute, a new TCP connection and MQTT session have to be established.This is would normally not be necessary, as TCP connections are able to stay inactive yet connected ('established') for hours (days, really). In fact, TCP itself knows no idle timeouts at all but has the capability of sending keep-alive packets on its own.So, I would like to request considering to significantly raise the server-side timeout, or even better adhere to the Keep Alive requested by the client. If there are any concerns that led to implementing this extremely short timeout (e.g. fear of DOS attacks), I would love to hear about them.For the time being, I recommend to all users to set a Keep Alive value of 55 seconds or less in their clients. Quite a few implementations seem to use a default value of 60, which is nasty in this case, as it is just over the threshold and will unfortunately lead to a full reconnect every minute instead of just a ping.Anyway, thanks again for the MQTT implementation and maybe someone is able to sort this out. Best regards,Kilian", "num_user_post": " 3", "author": "kilian"}, {"date": "December 7, 2016 - 4:15 pm", "content": "This being our initial release of the MQTT service, we had to make some trade-offs in our broker configuration.  This is because we don't have an infinite number of TCP sockets on the broker.  We want to give everyone a chance to try it out. So that means, at this time at least, the client connection time with the broker is limited. For now, MQTT clients should connect -> publish -> disconnect.  Once we get some usage data from the broker, we'll be able to optimize where we can.", "num_user_post": " 34", "author": "JasonW"}, {"date": "December 8, 2016 - 2:24 am", "content": "Thank you for the quick reply and the clarification. I understand your point. I have seen that the service is based on AWS but did not know how scalable the architecture of your implementation is. Maybe you could add some hints regarding the recommended use to the documentation. The provided examples sort of suggest a continuous connection.Anyway, thanks again for the MQTT service. Best regards,Kilian", "num_user_post": " 3", "author": "kilian"}, {"date": "July 29, 2017 - 1:34 am", "content": "Hi, When we use MQTT protocol to send data to server, can we check the response to verify if it was sent complete? And what function to get data use MQTT API. Thanks,Chung", "num_user_post": " 1", "author": "ChungTran"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/react-change-the-last-value-in-the-condition/", "posts": [{"date": "May 18, 2017 - 8:00 am", "content": "When Creating a React condition there are 4 fields to use when setting the condition.  Would like have a function in the ThingSpeak library (for the arduino) that could change this value.  Or at be able to set it to one of the 8 fieldsREACT condition setupCondition:     IF Channel                   ChannelID                   Field to test                   Test condition                    data to test against  -  need to be able to change this data from my programThanks", "num_user_post": " 1", "author": "BiggSmiles"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/iot-device-access/", "posts": [{"date": "February 14, 2017 - 10:10 am", "content": "Hi there,I am a post graduate masters student looking to do my research on IoT devices and how they are used in Distributed denial of service attack and the impacts involved. I want to do a simple experiment that involves connecting the devices. Can anyone please suggest how or where i can have free access to few IoT devices for my research. ", "num_user_post": " 1", "author": "u0750623"}, {"date": "April 1, 2017 - 3:54 pm", "content": "It depends on what you define as an IoT device If you consider an ESP8266 or similar microcontroller running custom firmware an IoT device, these cost very little and can be ordered online for a very, very reasonable price. Of course you'd have to program these to be IoT devices. ", "num_user_post": " 225", "author": "Vinod"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/remove-resize-dots-markers-on-line-spline/", "posts": [{"date": "May 29, 2016 - 1:56 am", "content": "Is possible to have the option to remove or resize the dots on the line and spline graph to achieve more minimalist and clean aspect to the graph? Thanks!", "num_user_post": " 4", "author": "naamah75"}, {"date": "January 4, 2017 - 2:04 pm", "content": " I see no one has replied to this yet, so I want to 'bump it up' as I'm interested in this request as well. ", "num_user_post": " 10", "author": "SilverNodashi"}, {"date": "January 10, 2017 - 11:34 pm", "content": "You could use the MATLAB Vizualizations app to do the plotting of the data and the MATLAB plots more configurable options that you may need. This MATLAB visualization app would be tied to an on-data insert to the channel. This way you have a constantly updating plot with your customizations.", "num_user_post": " 225", "author": "Vinod"}, {"date": "January 11, 2017 - 2:49 pm", "content": "Hi Vinod,This MATLAB visualization app would be tied to an on-data insert to the channelCan you explain a little more ... to hava a living plot? Thank you in advance", "num_user_post": " 91", "author": "piajola"}]}]}