{"url": "https://community.thingspeak.com/forum/feature-requests/page-4/", "threads": [{"url": "https://community.thingspeak.com/forum/feature-requests/multiple-y-axis-on-one-chart/", "posts": [{"date": "July 8, 2011 - 7:09 pm", "content": "I am also a wifi thermostat user and currently I am logging indoor, outdoor and target (temp the tstat is set to, programmed and sometimes overidden) temperature.  I'd love if all three plots were on the same chart so that I can see that I'm achieving my goal; to keep temp inside lower, but in unison with outdoor temp....if that makes sense.", "num_user_post": " 3", "author": "eisenhowerj"}, {"date": "July 9, 2011 - 2:30 pm", "content": "If this option were available I could point my customers to this service for storage of data from a remote monitoring product.", "num_user_post": " 2", "author": "Evova"}, {"date": "July 14, 2011 - 5:45 am", "content": "+1 for this feature request. I would like to show temperature and humidity in one chart.", "num_user_post": " 3", "author": "marten"}, {"date": "September 9, 2011 - 12:09 pm", "content": "+1 as well, for the same reasons as above.As I add more thermometers, I'd like to see the temps (indoor, outdoor, refrigerator, freezer, etc.) on one plot/chart/graphic.", "num_user_post": " 1", "author": "dgou"}, {"date": "September 17, 2011 - 2:46 pm", "content": "+1 for this feature request.Would love to have some more advanced chart options, including more plots in the same chart.  ", "num_user_post": " 5", "author": "spumanti"}, {"date": "October 14, 2014 - 7:53 pm", "content": "We've recently added a plugin to display multiple series on a single chart.  To access it, create a new plugin and select 'Chart With Multiple Series' as the template.lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/overlay-multiple-fields-in-single-chart/", "posts": [{"date": "November 28, 2011 - 5:31 am", "content": "The topic says it all.As well as other posters.A definite for plotting temperatures or bool values as they are related to temperatures.Is this feature being planned?ThanksDave", "num_user_post": " 1", "author": "djash40"}, {"date": "November 28, 2011 - 2:57 pm", "content": "ThingSpeak 2.0 has a new Chart App. In a future post, I will layout the features for 2.0 and the plans behind it. The feedback has been overwhelming about displaying multiple fields on the same chart. We will do that and also take it one step further.If you come up with any more ideas, feel free to share on this section of the forum.", "num_user_post": " 402", "author": "Hans"}, {"date": "March 19, 2012 - 8:57 am", "content": "Hello,multiple fields on the same chart will be terrific. +1 !any idea when ThingSpeak 2.0 is planned ? are there tutorials to benefit from the Google visualizations, just like gauge. I've seen that so many displays are possible...thanks", "num_user_post": " 1", "author": "julienser"}, {"date": "October 14, 2014 - 7:52 pm", "content": "We've recently added a plugin to display multiple series on a single chart.  To access it, create a new plugin and select 'Chart With Multiple Series' as the template.lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/search-channels-by-location/", "posts": [{"date": "February 20, 2014 - 9:49 pm", "content": "HiI would like to be able  to use the API to list public channels centered around a long/lat location? Something like http://api.thingspeak.com/channels/public?lon=123&lat=123&radius=50It would enable mashing data from channels with a GIS outputThanksAaron", "num_user_post": " 7", "author": "turboencabulator"}, {"date": "February 21, 2014 - 8:50 am", "content": "Aaron,Thanks for the feature request. We will implement this feature in a future update.We will provide an API call that returns channels with location data as not all channels have location data. Then, you will be able to search by lat and long and a distance in meters.Thanks again!Hans", "num_user_post": " 402", "author": "Hans"}, {"date": "August 5, 2014 - 3:10 pm", "content": "Hi Aaron,We recently added the ability to search public channels by location.  Here's the relevant documentation: https://thingspeak.com/docs/channels#index .Here's an example of searching for channels near Pittsburgh: https://thingspeak.com/channels/public?latitude=40.430224&longitude=-80.002441&distance=10 .lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/scaling-graphs/", "posts": [{"date": "April 19, 2011 - 10:11 pm", "content": "I'd like to see the capability to set the axis scale on the graphs.  I would guess the y axis especially since the x axis is controlled by the time scale you choose.You guys are making great progress so far.  This is very cool.Thank you,Bob", "num_user_post": " 12", "author": "bgardner"}, {"date": "July 8, 2011 - 7:28 pm", "content": "I also want this feature.  I am logging temperatures and they only span 20 degrees or so.  It would be nice to be able to set Y axis to a range.  For instance my indoor temps range from 76 to 85 degrees.  If I could set the range to 70-90, it would show more 'depth'? Not sure what the right word for that is.", "num_user_post": " 3", "author": "eisenhowerj"}, {"date": "December 8, 2011 - 6:13 am", "content": "I'd also like this capability. You can create new parameters like 'yScaleMax' and 'yScaleMin'. It would be helpful. ", "num_user_post": " 5", "author": "ricardo_ati"}, {"date": "October 17, 2012 - 7:59 am", "content": "yes indeed. And also add the possibility to define the minimum value and maximum of the yaxis.", "num_user_post": " 5", "author": "tparvais"}, {"date": "July 22, 2014 - 8:11 pm", "content": "Some time ago we added the ability to set the y-axis min and max via the chart options.  ( https://thingspeak.com/docs/charts#create )I apologize for not updating this thread sooner with this information.lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/feature-request-spline-charts/", "posts": [{"date": "April 3, 2014 - 9:59 am", "content": "Hi,I read somewhere on this forum that ThingSpeak's charts functionality is implemented using the highcharts.com charts library. They also support these really nice looking spline plots:http://www.highcharts.com/demo/spline-plot-bandsWould it be possible to support this chart type in ThingSpeak?Thanks, Malden", "num_user_post": " 15", "author": "Malden"}, {"date": "April 3, 2014 - 11:02 pm", "content": "Hi Malden,As requested, we've just added spline charts: https://thingspeak.com/channels/9/charts/1?results=10&type=spline .lee", "num_user_post": " 457", "author": "lee"}, {"date": "April 4, 2014 - 12:21 pm", "content": "Great. That was really quick. I might come back with more requests then Thanks a lot.Malden", "num_user_post": " 15", "author": "Malden"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/a-little-webspace/", "posts": [{"date": "March 10, 2014 - 11:38 am", "content": "Hi, the ability to add javascript plugins are awesome however Im trying to write an HTML5/CANVAS/Processing.js sketch.The big problem is processing.js includes no native commands for grabbing JSON data and the tutorials on the web are very sparse and assume a lot more knowledge of javascript passing variables to processing.For beginners the easiest method is to use loadstrings however this wont work unless your in the same domain as the data. So, I was wondering. A very small amount of webspace per user account would be beyond excellent as it would allow newbie users like me to just stick their code and any images/resources directly on the server and it should all just work!", "num_user_post": " 54", "author": "chrisjmears"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/add-hi-lo-avg-graph/", "posts": [{"date": "July 22, 2013 - 1:58 am", "content": "Hi,I would like to be able to show my data in a HI - LO - AVG graph (3 lines) based on the period length of the datasegment (using timescale for instance). This is very handy for instance when displaying temperaturedata over several days/weeks. regardsCorB", "num_user_post": " 37", "author": "CorBee"}, {"date": "December 3, 2013 - 6:49 pm", "content": "Hi,We use Highcharts to produce our charts, so if you know JavaScript you may be able to modify the JavaScript code to produce a customized graph: http://www.highcharts.com/docs/chart-and-series-types/chart-typeshttp://www.highcharts.com/docs/chart-concepts/series .lee", "num_user_post": " 457", "author": "lee"}, {"date": "December 28, 2013 - 3:19 am", "content": "Hello Lee,The responsetime is a bit long ... nearly half a year since I posted this. Sure I am able to create a javascript using highcharts to achieve this. But isnt the whole purpose of the feature requests than futile ? Since everybody can retrieve the raw data using JSON or other protocols we all can also create javascripts to display them in the fashion we wish ... The idea behing my request is that I think that many people like to check a datachannel with a hi-lo-average graph. Just as people also have asked several times to display the last uploaded value in the graphs as textbox. For me it has become unclear where you wish to go with the users coming with feature requests ? For the great service you are delivering to us in terms of datastorage this part of thingspeak (forum) seems to be less functional which is unfortunate I think.regardsCorBee", "num_user_post": " 37", "author": "CorBee"}, {"date": "December 29, 2013 - 6:32 pm", "content": "Hi CorBee,I apologize about the long response time, I only just became an employee this month and you're right, the forums had been neglected for some time.You are correct in asking for feature requests in this forum.  If enough users need the hi-lo-avg feature, yes we will implement it.  In the meantime, we will be adding the ability for charts to have multiple series first.Please keep the feedback coming, I'm checking these forums daily now and am working on greatly improving the ThingSpeak service.  Some things I'm currently working on: upgrading our backend servers, updating our Ruby/Rails versions, updating the user interface, updating the open-source version, and implementing new features.  Hopefully you'll see some noticeable improvements in the coming months!lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/display-realtime-value-big-number/", "posts": [{"date": "October 28, 2013 - 4:43 pm", "content": "Thank you very much for this amazing service, really nice.My sugestion is to display a big number with the last value received.It's the most interesting feature in xively that I would be happy to see here.Thank you", "num_user_post": " 1", "author": "anjoze"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/upgrade-forum-to-post-files-and-images/", "posts": [{"date": "June 18, 2013 - 3:15 pm", "content": "I have a project that I'd like to contribute as open source material.  Please consider upgrading forum to post files and images, making open source sharing possible.", "num_user_post": " 70", "author": "turgo"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/add-datetime-to-historic-upload-data/", "posts": [{"date": "May 31, 2013 - 8:58 am", "content": "Hi,Can you add a parameter when uploading historic data, so that when you upload eg. a csv file you can give the samples their correct moment in time?Something like field1=2,34   stamp=2013-02-17T12:06:03ZAnd it would be nice that the value is ignored when there is a sample at that moment already. (So no error situation)", "num_user_post": " 4", "author": "AFA58"}, {"date": "June 15, 2013 - 4:52 am", "content": "Historic data can be added by the .csv file upload.There you can add a datetime and values in for all fields.Mind you, ALL fields, so updating only one field is not possible.When you do upload, the new data is just added. So that means that when you upload the csv file 3 times, you have 3 times the amount of data points: for every timestamp 3.Sounds logical but is not really.What I would like is an option to correct data of specific fields at a specific datetime stamp- An option to overwrite datafields when one is present for that field at that datetime stamp. (Measured up to the second)- When you can set that option at the field level, you have also made it possible to correct only one field. For a given timestamp, make one field overwrite: The field to correct, and the rest not overwrite: stay as they are. (And there is not another value added)For example:2013-06-15 08:03:00,4,5,4Updates three fields, removes old values at that date time stamp2013-06-15 08:03:00,#,5,#Updates only Field2, Field1 and Field3 remain as they are (# is the code for that)Also an option to delete single field values  at a given datetime stamp would be niceExample:2013-06-15 08:03:00,#,@,#Removes the value for Field2 at that DateTime stamo (the @ code) and leaves the rest unchanged (The # code)", "num_user_post": " 4", "author": "AFA58"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/add-a-thinghttp-timestamp-variable/", "posts": [{"date": "May 20, 2013 - 1:08 am", "content": "Hi,I would like to see a timestamp variable added to THINGHTTP that can be used together with the %%trigger%% option. This has the advantage that a user can check when a message was send directly and it will also help understanding if a message from THINGHTTP somehow got delayed (since you can compare the timestamp with the time the message was delivered).Cor", "num_user_post": " 37", "author": "CorBee"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/allow-react-to-act-on-value-inoutside-band/", "posts": [{"date": "May 20, 2013 - 1:04 am", "content": "Hi,As a feature request I would like to see the option to use REACT to act on a value when its outside a given bandwidth.As an example: when you measure temperatures in a greenhouse you want to know when its getting too cold or when its getting too warm. All other temperatures are OK. For this a user would need to specify a higher limit and a lower limit so the system can signal accordingly.Currently this can only be achieved by setting 2 separate reacts for the same variable, one checking if the value is below a lower limit and one checking if its above a higher limit.This setup could then also be used (I hope) to do the opposite, so get a message when the temperature is OK and inside the band. Currently that is not at all possible.cheerCor", "num_user_post": " 37", "author": "CorBee"}]}]}