[{'url': u'https://community.thingspeak.com/forum/feature-requests/page-1/', 'threads': [{'url': u'https://community.thingspeak.com/forum/feature-requests/more-metadata-fields-to-channel/', 'posts': [{'date': u'June 28, 2014 - 8:51 am', 'content': u'I wish i had the ability to add more fields to a channel. Something similar to the Description.Those fields should be visible in the API call (https://thingspeak.com/channels/channelID/feed.json)but may not be visible in public/private channel pages.  You are great!', 'num_user_post': u' 12', 'author': u'DodBasim'}, {'date': u'June 29, 2014 - 1:04 pm', 'content': u"Hi,Does the 'status' field cover what you're looking for?  Here's an example:https://api.thingspeak.com/channels/1417/status.json?results=30&days=5lee", 'num_user_post': u' 457', 'author': u'lee'}, {'date': u'June 29, 2014 - 8:01 pm', 'content': u"No, look at 'custom_property' in the channels response belowchannel: {id: 1name: 'RPi'description: 'This is a very cool sensor'custom_property: 'Any Text/JSON/XML'latitude: '34.016331'longitude: '-118.191111'field1: 'CPU'created_at: '2014-06-24T05:21:38Z'updated_at: '2014-06-29T23:59:45Z'elevation: '40'last_entry_id: 1158}The idea is to give more info about the sensor/channel when calling with API", 'num_user_post': u' 12', 'author': u'DodBasim'}, {'date': u'June 30, 2014 - 1:06 pm', 'content': u"Hi,We just added a new Channel property for you, called 'metadata'.  You can set it on the Channel settings page, and it can store an unlimited amount of JSON/XML or any other data.  If you want to include the metadata  when getting the Channel feeds, just add 'metadata=true'.  Please see https://thingspeak.com/docs/channels#get_feed for further documentation.lee", 'num_user_post': u' 457', 'author': u'lee'}, {'date': u'July 1, 2014 - 4:59 am', 'content': u'Thank you very much for doing this.Once again, you showed how flexible and responsive you are.Keep up the good work', 'num_user_post': u' 12', 'author': u'DodBasim'}, {'date': u'July 1, 2014 - 4:21 pm', 'content': u'One more thing...Do you think you will be able to add the option to update this field via HTTP POST call?One more thing 2...Any plans to add a global Status field to the channel that will be accessible via HTTP POST/GET?Thanks again...', 'num_user_post': u' 12', 'author': u'DodBasim'}, {'date': u'July 2, 2014 - 11:46 am', 'content': u"Hi,We added the ability to update a Channel via the API: https://thingspeak.com/docs/channels#update .Please use the newly added 'metadata' field for status requests.  For example, you can store JSON metadata info as{ 'status': 'online', 'otherinfo', 'etc.' }and then parse out the status from the response.lee", 'num_user_post': u' 457', 'author': u'lee'}, {'date': u'July 3, 2014 - 4:22 am', 'content': u'works like a charm', 'num_user_post': u' 12', 'author': u'DodBasim'}, {'date': u'March 8, 2018 - 2:22 pm', 'content': u'Does not seem to work in\xa0thingSpeakRead() API call.', 'num_user_post': u' 27', 'author': u'heh'}, {'date': u'March 8, 2018 - 3:18 pm', 'content': u"We currently do not support metadata in the thingSpeakRead MATLAB function, but you can use webread.indoorChannelData = webread(strcat('https://api.thingspeak.com/channels/', ...                                    num2str(indoorChannelID), ...                                    '/feeds.json?metadata=true&api_key=', ...                                    indoorChannelReadKey));", 'num_user_post': u' 402', 'author': u'Hans'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/do-not-transmit-unencrypted-login-credentials-to-community-server/', 'posts': [{'date': u'December 7, 2016 - 12:39 pm', 'content': u'Dear Thingspeak Community administrators,I have just signed up for the forum and could not believe that the login credentials are not protected in any way. Even the password is being transmitted in complete clear text.Is this really necessary these days? Personally, I know better than to reuse passwords for different services, but still... So, I kindly ask you to either switch the whole server to TLS/SSL or, if you are concerned about the additional load, at least protect the login process including password reset, etc.\xa0Best regards,Kilian', 'num_user_post': u' 3', 'author': u'kilian'}, {'date': u'March 7, 2018 - 3:19 pm', 'content': u'Killian,The ThingSpeak Community now supports HTTPS.\xa0\xa0Thank you for your feedback.The ThingSpeak site also supports HTTPS, and did previously.', 'num_user_post': u' 401', 'author': u'cstapels'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/download-csv-clearing-data-improvements-requests/', 'posts': [{'date': u'January 2, 2018 - 10:21 pm', 'content': u"Hello, there is a good feature called 'Download all of this Channel's feeds in CSV format' but it would be even better if it would be possible\xa0to download\xa0the data for the last day/week/month/year instead\xa0of downloading the whole data.Also, it would be great to have the ability to clear the data\xa0for the last day/week/month/year instead of clearing all data.The ability to clear the data for the last day or week would\xa0be very useful when sensors for some reason start to send some wrong\xa0data to ThingSpeak.", 'num_user_post': u' 3', 'author': u'Deimos'}, {'date': u'January 3, 2018 - 2:30 pm', 'content': u"You can complete the desired download with a REST API call.\xa0https://thingspeak.com/channels/276330/feed.csvorhttps://thingspeak.com/channels/276330/feed.jsonIf you want more than one day, add the days parameterhttps://thingspeak.com/channels/276330/feed.csv?days=3See the get channel feed documentation or get a channel field feed documentation for more parameters.You can append multiple parameters using &, for example:https://thingspeak.com/channels/276330/feed.json?days=3&sum=1440\xa0If you want, go to your channel private view and use the 'Data Export' button there.\xa0 Its next to the 'Add Visualizations' button.\xa0 When you press the button, it builds the URL for you and opens a new tab (for .json or .xml).\xa0 Look at the address and you can modify it to what you need.\xa0 The default is 1 day or 8000 points.\xa0 For '.csv' you can see the address when you hover over the '.csv', or just change the address from '.json' to '.csv'.It is currently not possible to selectively delete data, I will look into if it could be included in a future update, thanks for your suggestions.", 'num_user_post': u' 401', 'author': u'cstapels'}, {'date': u'January 8, 2018 - 5:51 pm', 'content': u"As of January 2018, ThingSpeak is not yet expiring any data.\xa0 Your past data usage does not count against your new capacity. If you intend to convert to a free license, the easiest thing you can do is slow down the data rate from your devices. Your existing data collected on ThingSpeak will remain. Slowing down of ingesting data to ThingSpeak will ensure you don't exhaust the capacity.\xa0 If you want to download a complete copy of your historical data, please reach out to support 'at' mathworks dot com with details about your channel that you want the data for.\xa0 We can email you a csv file or a link to the file of your complete data set.", 'num_user_post': u' 401', 'author': u'cstapels'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/mqtt-optimization/', 'posts': [{'date': u'June 27, 2017 - 7:18 am', 'content': u"The publish url for MQTT is unnecessarily long for a protocol designed to be efficient.'channels/123456/publish/fields/field1/APIKEY'Could be shortened to, for example:'c/123456/1/APIKEY'This saves 27 characters.", 'num_user_post': u' 1', 'author': u'ArbitraryUserN01'}, {'date': u'November 22, 2017 - 4:56 pm', 'content': u'I totally agree!For instance, using popular Arduino library PubSubClient it is impossible to send data for all 8 fields at once because total string length exceeds predefined array of 128 bytes.', 'num_user_post': u' 2', 'author': u'CoreInside'}, {'date': u'November 22, 2017 - 5:10 pm', 'content': u'As an example 160 bytes can become 115 without sacrificing ease of human-reading:channels/123456/publish/ABCDEFGHIJKLMNOP/field1=-123.45&field2=-123.45&field3=-123.45&field4=-123.45&field5=-123.45&field6=-123.45&field7=-123.45&field8=-123.45c/123456/p/ABCDEFGHIJKLMNOP/f1=-123.45&f2=-123.45&f3=-123.45&f4=-123.45&f5=-123.45&f6=-123.45&f7=-123.45&f8=-123.45Please support the short form!', 'num_user_post': u' 2', 'author': u'CoreInside'}, {'date': u'November 29, 2017 - 9:07 am', 'content': u'You can easily adjust the Ardunio PubSubClient library to accommodate larger strings.In PubSubClient.h just increase MQTT_MAX_PACKET_SIZE.', 'num_user_post': u' 34', 'author': u'JasonW'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/user-level-chart-scaling/', 'posts': [{'date': u'October 24, 2017 - 9:29 am', 'content': u"Hello guys, newcomer here!Recently transferred my home automation project from Xively to Thingspeak - being drawn by the awesome Matlab support features.However, the feature that I miss the most from Xively is the ability to change the X-axis scaling of the charts by the user - if I understand correctly it can only be changed in the settings of the channel, but not in public view. In Xively anybody could make the chart show the data from the last hour/day/month etc. by just selecting the desired X-axis display range from the drop-down list.Is it so that on Thingspeak the only way to solve this issue is to create multiple Matlab plots, each with appropriate zoom level? Or maybe I'm missing something?Cheers!", 'num_user_post': u' 1', 'author': u'Maxisokol'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/any-way-to-place-a-line-on-the-chart-for-warning-levels-on-radiation-monitor/', 'posts': [{'date': u'September 2, 2017 - 4:40 pm', 'content': u'I am displaying radiation levels in uSV/H and Counts Per Minute. \xa0Is there a way to place colored lines on my chart for the warning levels? \xa0The warning levels for uSV/H (microSieverts per hour) are yellow (hazardous) - 0.56, and red (dangerous) - 1.88, and the warning levels for CPM are yellow - 60, and red - 200. \xa0So I want to place a yellow and a red line on my charts to indicate hazardous and dangerous levels.', 'num_user_post': u' 1', 'author': u'lane5625'}, {'date': u'September 14, 2017 - 3:44 pm', 'content': u"If you create a MATLAB visualization to create your plot, you can use refline to create a reference line.For example:plot(1:10,11:20);hold onhline=refline([0,15]);hline.Color = 'g';line2=refline([0 18]);line2.Color='r';line2.LineWidth=5;", 'num_user_post': u' 401', 'author': u'cstapels'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/esp32-arduino-library/', 'posts': [{'date': u'August 15, 2017 - 9:41 am', 'content': u'I am trying to compile code for my new esp32 module but thingspeak library won\xb4t compile for esp32.I would like that someone with programming skills can update the old library, the old library works with my esp8266 and same code....', 'num_user_post': u' 1', 'author': u'Gottmoz9'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/javascript-query/', 'posts': [{'date': u'July 31, 2017 - 10:31 am', 'content': u"Not sure if this is already doable...\xa0In my JavaScript I have a number of variables as shown:\xa0stop = new google.maps.LatLng(49.093914487013, -117.71569423377514)waypts.push({location: stop,stopover: true\xa0The line in Bold\xa0is what I need help with. I have data transmitted to Thingspeak. I have an API that allows me to select the exact value to query; what I need to know is how to use a GET statement (Or anything that would work) to have that Stopover\xa0line be True or False based on the result. So IF the result queried by the API is over 8, it's TRUE, if it's under it is false.\xa0The API line looks like this:\xa0\xa0GET https://api.thingspeak.com/channels/****/fields/1.json?results=2So How do I set that Bold\xa0field to query this and either be TRUE or FALSE based upon the result of this query?\xa0If you need any more info please reply and I can fill in any blanks, but I'm reallllly needing some help here.\xa0Thank you!\xa0\xa0\xa0\xa0\xa0\xa0", 'num_user_post': u' 8', 'author': u'jteindl'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/mqtt-bridge/', 'posts': [{'date': u'February 4, 2014 - 8:54 pm', 'content': u"From the website http://www.mqtt.orgMQTT is a machine-to-machine (M2M)/'Internet of Things' connectivity protocol. It was designed as an extremely lightweight publish/subscribe messaging transport. It is useful for connections with remote locations where a small code footprint is required and/or network bandwidth is at a premium.", 'num_user_post': u' 271', 'author': u'rw950431'}, {'date': u'December 28, 2014 - 11:34 pm', 'content': u'+1  : )', 'num_user_post': u' 1', 'author': u'jonn26'}, {'date': u'December 30, 2015 - 3:27 am', 'content': u"It would be nice if you could add MQTT support for thingspeak - e.g. that my IoT devices could publish and subscribe to topics using MQTT. This is very lightweight and easiest way to update topic feeds and receive updates from thingspeak apps.You don't have to implement any API, as MQTT is supported already by many platforms, just provide ability to either connect to your MQTT broker, or thingspeak should act like a MQTT client, connecting to any online MQTT broker as client.", 'num_user_post': u' 3', 'author': u'lingvo'}, {'date': u'January 1, 2016 - 11:48 pm', 'content': u"This would be a great feature to have, as MQTT has become something of a standard, and ThingSpeak provides complementary functionality (the ability to archive and graphically display data). It would be wonderful to be able to have ThingSpeak 'subscribe' to an MQTT topic on a given broker and display and archive the data that comes in.", 'num_user_post': u' 1', 'author': u'JoeQ'}, {'date': u'March 10, 2016 - 6:16 am', 'content': u'Hello, maybe I have sollution: http://community.thingspeak.com/forum/thingspeak-apps/mqspeak-mqtt-to-thinkspeak-bridge/', 'num_user_post': u' 3', 'author': u'buben'}, {'date': u'July 11, 2016 - 7:36 pm', 'content': u'Thank you for your feature request. The development team is actively investigating support for MQTT protocol in Thingspeak. It will be very helpful to the team to get additional details of your application; Specifically, your anticipated workflows, performance requirements, and details about how you intend to use MQTT support. Please write to support@thingspeak.com and someone on the development team may be in touch with you directly.', 'num_user_post': u' 225', 'author': u'Vinod'}, {'date': u'December 5, 2016 - 6:41 pm', 'content': u'Holy smokes Batman!\xa0 When did this happen? https://au.mathworks.com/help/thingspeak/mqtt-api.html\xa0Seems like its publish-only at this stage (no documented way to subscribe to a channel) but still a big step forward.\xa0 Good work guys', 'num_user_post': u' 271', 'author': u'rw950431'}, {'date': u'December 6, 2016 - 8:32 am', 'content': u"Sharp eyes -- we went live yesterday with this. \xa0 And yes -- It's MQTT publish only at this point.All the best,-Rob", 'num_user_post': u' 47', 'author': u'Rob Purser'}, {'date': u'December 6, 2016 - 4:55 pm', 'content': u'Top job, sterling work, well done! Is there any documentation available RE MQTT publish performance / latency / limits etc for free accounts?', 'num_user_post': u' 1', 'author': u'Joe_1'}, {'date': u'December 6, 2016 - 7:20 pm', 'content': u"Here's the documentation: https://www.mathworks.com/help/thingspeak/mqtt-api.htmlUsers with free thingspeak accounts can only push data to a channel once every 15s. That holds true via the REST API and the MQTT API. The MQTT publish service is a Quality of Service (QoS) = 0 level API.\xa0There is\xa0currently no difference in\xa0the MQTT API for free v/s paid accounts.", 'num_user_post': u' 225', 'author': u'Vinod'}, {'date': u'December 7, 2016 - 12:16 pm', 'content': u"First of all, thank you very much for implementing the MQTT publish.In my tests I have however noticed, that the server ignores Keep Alive values of greater than 60 seconds (technically speaking greater than 40) and drops the connection after short below 60 seconds of inactivity. The same is true for sessions with a Keep Alive value of 0 (i.e. disabled).This is standard-conforming behavior, as the server is allowed to disconnect at any time, regardless of the Keep Alive. However, it is not really nice regarding low-power applications, as one of two things currently have to happen:A Keep Alive of less than 60 has to be chosen and the client device has to wake up and send a packet every 55 seconds (to be safe). OrFor every data packet with a period of greater than one minute, a new TCP connection and MQTT session have to be established.This is would normally not be necessary, as TCP connections are able to stay inactive yet connected ('established') for hours (days, really). In fact, TCP itself knows no idle timeouts at all but has the capability of sending keep-alive packets on its own.So, I would like to request considering to significantly raise the server-side timeout, or even better adhere to the Keep Alive requested by the client. If there are any concerns that led to implementing this extremely short timeout (e.g. fear of DOS attacks), I would love to hear about them.For the time being, I recommend to all users to set a Keep Alive value of 55 seconds or less in their clients. Quite a few implementations seem to use a default value of 60, which is nasty in this case, as it is just over the threshold and will unfortunately lead to a full reconnect every minute instead of just a ping.Anyway, thanks again for the MQTT implementation and maybe someone is able to sort this out.\xa0Best regards,Kilian", 'num_user_post': u' 3', 'author': u'kilian'}, {'date': u'December 7, 2016 - 4:15 pm', 'content': u"This being our initial release of the MQTT service, we had to make some trade-offs in our broker configuration. \xa0This is because we don't have an infinite number of TCP sockets on the broker. \xa0We want to give everyone a chance to try it out. So that means, at this time at least, the client connection time with the broker is limited. For now, MQTT clients should connect -> publish -> disconnect. \xa0Once we get some usage data from the broker, we'll be able to optimize where we can.", 'num_user_post': u' 34', 'author': u'JasonW'}, {'date': u'December 8, 2016 - 2:24 am', 'content': u'Thank you for the quick reply and the clarification. I understand your point. I have seen that the service is based on AWS but did not know how scalable the architecture of your implementation is. Maybe you could add some hints regarding the recommended use to the documentation. The provided examples sort of suggest a continuous connection.Anyway, thanks again for the MQTT service.\xa0Best regards,Kilian', 'num_user_post': u' 3', 'author': u'kilian'}, {'date': u'July 29, 2017 - 1:34 am', 'content': u'Hi,\xa0When we use MQTT protocol to send data to server, can we check the response to verify if it was sent complete? And what function to get data use MQTT API.\xa0Thanks,Chung', 'num_user_post': u' 1', 'author': u'ChungTran'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/react-change-the-last-value-in-the-condition/', 'posts': [{'date': u'May 18, 2017 - 8:00 am', 'content': u'When Creating a React condition there are 4 fields to use when setting the condition.\xa0 Would like have a function in the ThingSpeak library (for the arduino) that could change this value.\xa0 Or at be able to set it to one of the 8 fieldsREACT condition setupCondition:\xa0\xa0\xa0\xa0 IF Channel\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0 ChannelID\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0 Field to test\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0 Test condition\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0\xa0 data to test against\xa0 -\xa0 need to be able to change this data from my programThanks', 'num_user_post': u' 1', 'author': u'BiggSmiles'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/iot-device-access/', 'posts': [{'date': u'February 14, 2017 - 10:10 am', 'content': u'Hi there,I am a post graduate masters student looking to do my research on IoT devices and how they are used in Distributed denial of service attack and the impacts involved. I want to do a simple experiment that involves connecting the devices. Can anyone please suggest how or where i can have free access to few IoT devices for my research.\xa0', 'num_user_post': u' 1', 'author': u'u0750623'}, {'date': u'April 1, 2017 - 3:54 pm', 'content': u"It depends on what you define as an IoT device\xa0If you consider an\xa0ESP8266 or similar microcontroller running custom firmware an IoT device, these\xa0cost very little and can be ordered online for a very, very reasonable price. Of course you'd have to program these to be IoT devices.\xa0", 'num_user_post': u' 225', 'author': u'Vinod'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/remove-resize-dots-markers-on-line-spline/', 'posts': [{'date': u'May 29, 2016 - 1:56 am', 'content': u'Is possible to have the option to remove or resize the dots on the line and spline graph to achieve more minimalist and clean aspect to the graph? Thanks!', 'num_user_post': u' 4', 'author': u'naamah75'}, {'date': u'January 4, 2017 - 2:04 pm', 'content': u"\xa0I see no one has replied to this yet, so I want to 'bump it up' as I'm interested in this request as well.\xa0", 'num_user_post': u' 10', 'author': u'SilverNodashi'}, {'date': u'January 10, 2017 - 11:34 pm', 'content': u'You could use the MATLAB Vizualizations app to do the plotting of the data and the MATLAB plots more configurable options that you may need. This MATLAB visualization app would be tied to an on-data insert to the channel. This way you have a constantly updating plot with your\xa0customizations.', 'num_user_post': u' 225', 'author': u'Vinod'}, {'date': u'January 11, 2017 - 2:49 pm', 'content': u'Hi Vinod,This MATLAB visualization app would be tied to an on-data insert to the channelCan you explain a little more ... to hava a living plot?\xa0Thank you in advance', 'num_user_post': u' 91', 'author': u'piajola'}]}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/page-2/', 'threads': [{'url': u'https://community.thingspeak.com/forum/feature-requests/matlab-charts-in-bigger-size/', 'posts': [{'date': u'June 11, 2016 - 1:37 am', 'content': u'It could be added to an HTML link to the matlab chart to open another tab in original size?Thank you.', 'num_user_post': u' 1', 'author': u'mtibi75'}, {'date': u'October 28, 2016 - 5:07 am', 'content': u'I would also like this \U0001f642', 'num_user_post': u' 4', 'author': u'Boggie'}, {'date': u'October 28, 2016 - 12:25 pm', 'content': u'Are you looking to view\xa0the MATLAB charts in a bigger size? You can do this today with something like this:https://thingspeak.com/apps/matlab_visualizations/<<YOUR_MATLAB_VIZUALIZATION_NUMBER>&gt;?height=400&width=800The height and width parameters are user configurable.For example, see this public MATLAB visualization:https://thingspeak.com/apps/matlab_visualizations/20199?height=400&width=800', 'num_user_post': u' 225', 'author': u'Vinod'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/ipv6-support/', 'posts': [{'date': u'June 20, 2016 - 6:13 pm', 'content': u'Could you start supporting IPv6 on api.thingspeak.com?', 'num_user_post': u' 2', 'author': u'buckett'}, {'date': u'June 23, 2016 - 1:59 pm', 'content': u'Thanks for the request. What are you expecting as support? Are you looking for an IPv6 address to send data to?', 'num_user_post': u' 402', 'author': u'Hans'}, {'date': u'October 21, 2016 - 8:05 am', 'content': u'Basically it would just be nice if api.thingspeak.com had a AAAA record in DNS and was listening on that IPv6 address, so that a node that only had a IPv6 address could send in data.\xa0', 'num_user_post': u' 2', 'author': u'buckett'}, {'date': u'October 21, 2016 - 2:33 pm', 'content': u"So you do have DNS capabilities on your device, correct?I'm curious, what are you working with that has only IPv6?", 'num_user_post': u' 34', 'author': u'JasonW'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/add-update-channel-feed-and-read-channel-feed-to-api-keys-tab/', 'posts': [{'date': u'October 20, 2016 - 7:41 pm', 'content': u'A small thing that would make my life easier would be to list the URLs needed to read and update the channel feed on the API keys tab. Currently there is how to use the master key to create/update/clear/delete a whole channel but not how to use the channel key to update the feed or read from the feed.I know its only a few clicks away but it would be convenient to have the urls all there so you could just cut and paste them.', 'num_user_post': u' 271', 'author': u'rw950431'}, {'date': u'October 20, 2016 - 11:59 pm', 'content': u'Thanks for the request. Are you looking for what is currently under the Data import/Export tab? Thanks.\xa0', 'num_user_post': u' 402', 'author': u'Hans'}, {'date': u'October 21, 2016 - 6:10 am', 'content': u"Doh!\xa0 So it is...\xa0 All those times I've fossicked through the docco pages and it was one click away...", 'num_user_post': u' 271', 'author': u'rw950431'}, {'date': u'October 21, 2016 - 8:23 am', 'content': u'\U0001f642 glad to help\xa0', 'num_user_post': u' 402', 'author': u'Hans'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/abillity-to-hide-channels-or-decide-which-is-shown-at-the-top/', 'posts': [{'date': u'October 20, 2016 - 6:47 am', 'content': u"I'm a happy user of ThingSpeak, and love how easy it is to get something up and running. But since a lot of loggers mean a lot of channels, and each channel can only hold 8 values per entry, I end up with a lot of channels. Some of these I use a lot, some not so much.\xa0Some of the the ones I dont use as much are the oldest ones, that is listed at the top, so I have to scroll down each time I go to the channels page.It would be great if I could mark a channel as 'hidden', and had to press a 'show hidden channels' on the 'my channels' page to see it.Otherwise it would be great to be able to order the channels in the list as I wish, so I could push the rarely used ones to the bottom.\xa0I hope someone reads this and decides its a good idea \U0001f642/Henrik", 'num_user_post': u' 4', 'author': u'Boggie'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/skip-nil-when-displaying-channel-status-updates/', 'posts': [{'date': u'August 27, 2016 - 7:51 am', 'content': u"Probably I misunderstand the idea which stands behind Channel Status Updates, but\xa0I'd expect\xa0this 'widget' to show last data (statuses) except for 'nil' values.At the moment\xa0a status entry gets 'nil' if it isn't posted along with data entry.And in a common scenario channel status is usually updated rarely (every 6 hours in my case), while data is posted rather frequently (every 5 minutes in my case), which effectively makes Channel Status Updates 'widget' look empty most of the time, which isn't convenient.I'd like to have an option like 'Don't show 'nil' values' for Channel Status Updates.BTW this 'widget' doesn't allow tuning like how many last entries to show, and I guess this limit is about 60 entries or so, which would be\xa0fine if empty values were ignored.", 'num_user_post': u' 4', 'author': u'Anton_K'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/react-no-data-check/', 'posts': [{'date': u'August 11, 2016 - 3:00 pm', 'content': u"In the React Application, I would like the 'Test Frequency' time to have longer times available in the drop down list.The current options are testing every 10, 30 and 60 minutes.I would like 12 and 24 hours to be added too. \xa0The ultimate would a user entered field for the number of minutes between checks.In my application, I'm expecting data to be logged every minute and would like to know if nothing gets logged. When that happens I know that some action will need to be taken to fix the problem.\xa0I use a React to test for no data being logged, when it receives no data, I use ThingHTTP to send a message to a Slack stream that eventually ends up on my phone. \xa0With Run only the first time - I may miss that one message. With Run every time - I would receive many messages before I have time to look into the problem. \xa0My plan is to have two React's, one set to check every 30 minutes for data and run the action one time and the second React to check every 24 hours and run the action every time. This would give a short notification that something is wrong and a daily reminder that something is wrong.Having a user configurable Test Frequency will allow the most flexibility, but I'm willing to settle on 12 or 24 hours.Another possible solution is to allow TimeControl to run a React script. Currently a time control doesn't allow you to run a React script.", 'num_user_post': u' 3', 'author': u'dstacer'}, {'date': u'August 12, 2016 - 12:10 am', 'content': u'Hi\xa0dstacer,\xa0Please read these messages and see if that can be of some help\xa0http://community.thingspeak.com/forum/thingspeak-apps/no-data-react-tweet-not-working/#p3049http://community.thingspeak.com/forum/thingspeak-apps/react-not-reacting-with-thinghttp/#p3127\xa0Good luckH.S.', 'num_user_post': u' 91', 'author': u'piajola'}, {'date': u'August 15, 2016 - 2:09 pm', 'content': u"The first link idea looks like it will work. \xa0I'll give that that a try.Schedule a time control to run once a day, running the short MATLAB code, looking for lack of data over 24 hours then send notification.The goal would be to only send a message once a day. \xa0How do you persist data out side of a channel or is the channel the only way to save data between runs of a MATLAB program?If I could keep track of when the last notification was sent, it could check more often. If the failure occurred one second after the last check, the notification may be close to two days old before it was sent. If I could save when the last notification was sent (for no data) then it could check more frequently but only send the notification\xa0once a day.It could use another channel to keep track of that but using another channel seems a bit overkill.", 'num_user_post': u' 3', 'author': u'dstacer'}, {'date': u'August 15, 2016 - 8:12 pm', 'content': u"Hi dstacer,or is the channel the only way to save data between runs of a MATLAB programTo me, your 'persist' is via another private channel (you are the only allowed to see it, if you need/wish). You have server memory for your variables when the code is running. You start the code the way you choose, it runs 1-2 seconds then you are out.Your workhorse channel A is checked 'every minute' via Matlab Analysis X, writing 'fails' to your (private) channel B ... then at 00:00:00 everyday via Matlab Analysis Y using webwrite sends all 'fails' to your 'box' or simply see channel B if you do not need/wish to know 'fails' inmediatelyusing another channel seems a bit overkillOverkill if you can 'persist' another way\xa0Again, good luck", 'num_user_post': u' 91', 'author': u'piajola'}, {'date': u'August 17, 2016 - 4:08 pm', 'content': u"Thanks for all of the suggestions. I have it working as desired.The problem to solve was 'Notify me once a day if you don't see any data for more than an hour'\xa0 This is designed to keep bugging me if there is a long term outage if my IOT device stops sending data.I use a time control to run the code once an hour.Here is my code:NotifyInterval = minutes(1440)\xa0 %Interval in minutes to send a notification, set to once a day%get the current date timeCurrentTime = datetime('now','TimeZone','America/New_York')\xa0\xa0\xa0\xa0\xa0 % use your TimeZone What time is it 'right now' (local) when running this%tinterval - calculated desired outage time intervalDataLossInterval = CurrentTime - hours(1)\xa0\xa0\xa0\xa0 % here 1 hour without data%Read the last data from channel[Data,LastTimeData] = thingSpeakRead(124xxxx , 'fields', [1]);\xa0 \xa0LastTimeData\xa0\xa0\xa0 % to see the time of your last recorded pointnodata = LastTimeData < DataLossIntervalif nodata\xa0\xa0\xa0 % Its past when we expected data so we need to notify but only want to notify every x hours\xa0\xa0\xa0 'no data'\xa0\xa0\xa0 %Read the last time we notified from a private channel\xa0\xa0\xa0 [Data,LastNotify] = thingSpeakRead(145xxxx ,'ReadKey','xxxxxxx', 'fields', [1]);\xa0 \xa0\xa0\xa0\xa0 LastNotify\xa0\xa0 % to see the time of your last recorded point you can erase this line\xa0\xa0\xa0 notify = CurrentTime - LastNotify\xa0\xa0\xa0 if notify > NotifyInterval\xa0\xa0\xa0\xa0\xa0\xa0\xa0 ' time to notify'\xa0\xa0\xa0\xa0\xa0\xa0\xa0 thingSpeakWrite(145xxx ,1,'WriteKey','xxxxxxxx'); % write a new entry to the last notified channel\xa0\xa0 \xa0\xa0\xa0\xa0 %Do what ever you want here to notify here,\xa0 I post to a slack channel that notifies my phone\xa0\xa0\xa0\xa0\xa0\xa0\xa0 dd = ['No Data Received since: ' datestr(LastTimeData)]\xa0\xa0\xa0\xa0\xa0\xa0\xa0 response = webwrite('https://xxxxxgroup.slack.com/services/hooks/slackbot?token=xxxxxxxxxxxxxxxxxxx&channel=%23channeame',dd)\xa0\xa0\xa0 endend", 'num_user_post': u' 3', 'author': u'dstacer'}, {'date': u'August 17, 2016 - 5:01 pm', 'content': u"Hi dstacer, I have it working as desired.Glad to know you are an 'Ioter' in ThingSpeak now ... your Thing is Speaking to you \xa0Cheers", 'num_user_post': u' 91', 'author': u'piajola'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/reference-status-variables/', 'posts': [{'date': u'August 2, 2016 - 3:35 am', 'content': u"hi.i have 2 issues.1. is there any progress in a\xa0\xa0 'modify' , or 'delete' \xa0record feature \xa0, of\xa0the data set accumulated within thingspeak ?\xa0 right now it seems we can only accumulate data \xa0and erase a whole channel ?\xa02. same issue actually\xa0\xa0 \xa0what i need is a reference \xa0single \xa0record , which \xa0presents \xa0a status of variables whitin my runtime algorithm (lets say - pump is running \xa0or \xa0pump is closed \xa0 or \xa0too humid \xa0or not enough light or just \xa0true/false flags)\xa0this record will be modified according to decitions made by algorithm.\xa0So\xa0its \xa0like holding a profile\xa0of\xa0a process running.\xa0i could ofcourse add new record to existing db , \xa0and read it as most current status to relate to.\xa0but it makes no sense \xa0for obvious reasons. just a dumb data accumulation.\xa0thanks\xa0\xa0oded", 'num_user_post': u' 3', 'author': u'oded'}, {'date': u'August 2, 2016 - 10:13 pm', 'content': u'As you have found thingspeak is set up to log time-series data: there is no modify or delete commands.\xa0Sounds like you actually want a key/value store like mongodb or redis.\xa0 Theres a list of free ones in this stackoverflow thread ', 'num_user_post': u' 271', 'author': u'rw950431'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/multiplication-between-fields/', 'posts': [{'date': u'July 5, 2016 - 5:44 am', 'content': u'HiI have Lan Controller 2.0. I sending data from 2 sensor (current and voltage) to field 1 and field 2. But I need view power (W) and energy (Wh), but I cannot multiply data before sending. Can I multiply 2 fields (power= current*voltage) in charts?Thank you for your answer.Brano', 'num_user_post': u' 1', 'author': u'BranoMo'}, {'date': u'July 5, 2016 - 6:51 pm', 'content': u'Not with the basic TS charts..\xa0But you should be able to do it in a Matlab visualisaton- hopefully someone who knows matlab can help with code.', 'num_user_post': u' 271', 'author': u'rw950431'}, {'date': u'July 11, 2016 - 10:42 am', 'content': u"As rw950431 user mentioned, you wouldn't be able to implement the multiplication in the basic ThingSpeak charts. You could implement this in one of two ways:1. Create a chart using a MATLAB Visualization\xa0App. Refer to the following page for examples:https://www.mathworks.com/help/thingspeak/matlab-visualizations-app.html2. Create a custom Plugin App. Refer to the following page for examples:https://www.mathworks.com/help/thingspeak/plugins-app.html\xa0Here is an example of implementing this logic in a MATLAB Visualization App [replace channeID, read_API_Key, voltage_field_number, current_field_number with appropriate values]:\xa0[voltage, time] = thingSpeakRead(<channelID>, 'ReadKey', '<read_API_Key>', 'Fields', <voltage_field_number>, 'NumPoints', 10);current = thingSpeakRead(<channelID>, 'ReadKey', '<read_API_Key>', 'Fields', <current_field_number>, 'NumPoints', 10);power = current .* voltage;thingSpeakPlot(time, power)", 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/disable-chart-data-sample-markers/', 'posts': [{'date': u'July 20, 2015 - 1:08 am', 'content': u"The round red blobs that mark the data samples on the charts are useful to identify individual samples, but it would be really nice to be able to disable them as an edit chart display option.In situations where a fine detailed chart line is required the sample markers completely swamp the data line. It's like a fine line drawing done with a crayon. If I reduce the number of displayed samples the number of markers reduce but so does the resolution of the data line.I'm new to ThingSpeak and I really like it, but to optionally disable the display of the markers would be really nice.Is this possible?Thanks.", 'num_user_post': u' 5', 'author': u'rod'}, {'date': u'July 20, 2015 - 8:46 am', 'content': u"Hi,You can create a JavaScript plugin, paste in the charting code, and modify the markers there.  You'd just have to modify the lines:  marker: { radius: 3 }Here is some documentation for other chart options if you're using a custom plugin: http://api.highcharts.com/highcharts .lee", 'num_user_post': u' 457', 'author': u'lee'}, {'date': u'July 20, 2015 - 6:40 pm', 'content': u"Hi Lee,I'm really unfamiliar with using plugins in this situation. I have followed the examples for the Google Gauge plugin and modified aspects of the gauge but how do I get from there to getting the code for the charts and installing and displaying charts via a plugin.I understand the concept but I would really appreciate some direction. It looks really flexible and I'm keen to get involved but could you point me to a tutorial or give some simple guidance?Thanks for your comments and help.", 'num_user_post': u' 5', 'author': u'rod'}, {'date': u'July 21, 2015 - 11:37 am', 'content': u"Hi,Can you try using the 'Chart with Multiple Series' template for a new plugin?  All of the chart code should be there for you to modify.Alternatively, you can try viewing the page source at https://thingspeak.com/channels/9/charts/1 , and copying all of that code into a new plugin.If you're still stuck, let me know your channel number and I can create a plugin for you.  (You'll have to make sure your chart is public.)lee", 'num_user_post': u' 457', 'author': u'lee'}, {'date': u'July 21, 2015 - 5:45 pm', 'content': u"Thanks for the help Lee. I have modified the above example (My House Light) and have achieved a zero (1) marker size which allows the chart line to look very nice and detailed. I'm very impressed with what can be achieved with custom plugins.Unfortunately all the code looks very unfamiliar to an embedded C programmer like me. If I dived in it would take a lot of time to generate the whole application from scratch and I can't do that right now.For my purpose the standard public charts are very good, the only thing missing is a check box to reduce the marker size as part of the chart options. It would be so simple and make such a huge improvement to the appearance of the charts.Is this something you would support or possibly even be able to do?", 'num_user_post': u' 5', 'author': u'rod'}, {'date': u'July 22, 2015 - 8:54 am', 'content': u"Hi,We'll keep this in mind when we work on improving the charting options, it's a good suggestion.lee", 'num_user_post': u' 457', 'author': u'lee'}, {'date': u'May 29, 2016 - 2:02 am', 'content': u'Yes... disable/resize the red dots are really usefull for me!', 'num_user_post': u' 4', 'author': u'naamah75'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/chart-types/', 'posts': [{'date': u'February 27, 2016 - 9:24 am', 'content': u"Hi,sorry because of my English. in some cases, when i change the chart type to bar or column nothing display and in one case after the i change the type of chart, all of the field data was cleared and i don't know why.is there any limits in chart point for bar or column mode?", 'num_user_post': u' 4', 'author': u'NNH'}, {'date': u'February 29, 2016 - 9:45 am', 'content': u'Hi, In the Bar mode a chart is created with time on Y-axis and the measured data on the x-axis represented as horizontal bars. Bar mode also defaults the Timescale property to 30. Check if with these settings you have sufficient data to visualize in the bar. You can increase the amount of data being visualized by increasing the number of results or days.Thanks,Adarsh', 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}, {'date': u'February 29, 2016 - 4:15 pm', 'content': u'I will check it, Thanks Adrash.', 'num_user_post': u' 4', 'author': u'NNH'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/multiple-data-feeds-on-one-chart/', 'posts': [{'date': u'July 19, 2011 - 8:32 am', 'content': u"Hi ThingSpeak team.\xa0Great service! -I have played around with the charts a bit; really nice \xa0One feature i'd like to request is to be able to show more than one graph in each chart.It would make it a lot easier to compare inside temperature to outside temperature or radiator forward temperature to return temperature, etc.\xa0I have tried to create an example below (photoshopped), to show my idea:\xa0\xa0Possible options:-choose different colors for each graph-choose different line styles / thickness for each graph-common y-axis for all graphs in chart (equal scaling)-option to add more than 2 graphs to a chart\xa0It would also be nice to be able to show historical data from / to a specific time, IE thursday one week ago or some such!\xa0", 'num_user_post': u' 5', 'author': u'spumanti'}, {'date': u'May 27, 2012 - 6:05 pm', 'content': u'Hello,I successfully create a plugin with two or more curves, but I also seeking something more generic.https://www.thingspeak.com/plugins/801http://pastebin.com/cBP5V4sQThere are many things to fix can you help me?Your comments are welcome, I did not have much experience in javascript\xa0- I want a jQuery function that allows to wait for loading data before proceeding to highchart. – I try to get the parameters (color, thickness, ..) from the url – And finally, I try to retrieve the name of the feeds without making stupid test in the code.', 'num_user_post': u' 5', 'author': u'benni_75'}, {'date': u'October 14, 2014 - 7:53 pm', 'content': u"We've recently added a plugin to display multiple series on a single chart.  To access it, create a new plugin and select 'Chart With Multiple Series' as the template.lee", 'num_user_post': u' 457', 'author': u'lee'}, {'date': u'February 15, 2016 - 9:28 am', 'content': u'Hi, lee, your plugin to display multiple series is what im looking for. But i whant to display in the same chart diferent values from the same field.Like example Field 1: Temperatureand select to displaySeries1: TodaySeries1: 1 day agoSeries1: 2 day agoSeries1: 3 day agoSeries1: 4 day agoSeries1: 6 day agoSeries1: 7 day agoin such a way to make easy to compare the evolution of some field.', 'num_user_post': u' 8', 'author': u'oskimark1'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/best-way-to-do-9-channels-for-multiple-colors/', 'posts': [{'date': u'December 1, 2015 - 12:51 pm', 'content': u"I have an arduino that controls the lighting in my apartment. I'd like to have each color be a channel, but the bookshelf it is mounted to has 3 shelves (3 shelves x 3 (R,G, B) == 9 channels). Are there any plans to add a configurable amount of channels? Or any recommendations on how I could work around this?Thanks and very cool product!Regards,Chris", 'num_user_post': u' 1', 'author': u'clamport'}, {'date': u'December 1, 2015 - 2:49 pm', 'content': u"clamport,Currently there are no limits imposed on the number of Channels a user may create. However, each Channel's Feed has 8 'Fields' and several additional meta data fields (ex: status, latitude, longitude, ect...). An update to a Channel's Feed may only include data written to any of these specified fields. It is possible to work around this limitation by doing some creative data mapping.For example, you may write to a Channel's Feed in the following wayfield1: shelf_numberfield2: red_valuefield3: green_valuefield4: blue_valueA MATLAB Analysis app may be used to then read the data from the Channel using the MATLAB function 'thingSpeakRead' and perform some action. A React app may be used to trigger the MATLAB Analysis app to execute the MATLAB code on data insertion to the Channel. The drawback of this approach, where a shelf is a different data point, is that data can only be written to a Channel every 15 seconds. You can use custom 'shelf' values which may set selves 1, 2, and 3 all to the specified RGB values or others which set shelves 1 and 2 or any combination.There is a slight workaround for a 'batch upload' using the MATLAB Analysis app. Please see lee's post for more information: http://community.thingspeak.com/forum/thingspeak-api/rfe-minimum-for-feed-api/#p2372", 'num_user_post': u' 4', 'author': u'hans'}]}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/page-3/', 'threads': [{'url': u'https://community.thingspeak.com/forum/feature-requests/math-in-channels/', 'posts': [{'date': u'May 15, 2013 - 1:18 pm', 'content': u"I recently discovered that my newly installed bee hive scale is temperature sensitive.  I can filter out the temperature-induced error with a simple compensation factor, but that means I need to be able to add 0.033 times the temperature to the weight.Really, any deeper hooks into the data would be much appreciated, but there would be great value in the ability to do some basic processing in the cloud.  I can add a feed for adjusted weight in my channel, but that requires dismantling the bee hive and the scale scale and uploading new firmware.  That's an annoying process when I just want to be able to tweak the real-time graphing of raw data that's otherwise streaming beautifully!", 'num_user_post': u' 1', 'author': u'Deamiter'}, {'date': u'June 2, 2015 - 3:12 am', 'content': u'I would really like this option too, it would be nice to have an option to do some basic math (addition, subtraction, division, multiplication) with the data in the cloud without having to edit the program running in the device...', 'num_user_post': u' 1', 'author': u'timoee'}, {'date': u'June 2, 2015 - 11:11 am', 'content': u'Hi,Thanks for the requests, we are very much aware of this need and are working towards addressing this in a future update to our application.lee', 'num_user_post': u' 457', 'author': u'lee'}, {'date': u'September 30, 2015 - 10:32 am', 'content': u"Check out the MATLAB Analysis and Visualizations apps built into ThingSpeak.Here's the announcement: http://community.thingspeak.com/2015/08/you-have-collected-lots-of-iot-data/", 'num_user_post': u' 402', 'author': u'Hans'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/feature-request/', 'posts': [{'date': u'January 12, 2015 - 6:36 am', 'content': u"With devices like the Arduino Yun, it is possible to attach a webcam and take a picture.Although there are multiple tutorials out ther which allow you to connect the yun to a dropbox account to store the images it would be nice if we could have an addition to the api to allow a single png file to be uploaded along with the data stream. That way we could keep all out web connected data on one service.For my application, alongside the iot data I am logging it would be useful to have a physical view of the enviroment for which I am monitoring (See if its cloudy, rainy, someone is in the shot etc).for example an &image=001.pngI'm not talking about using thingspeak to store an ever growing sequence of png files. simply the ability to take a single small png picture every 15 seconds or so overwriting the last image.If anyone wants more than this. A sequence of images, or live streaming they can always go the more complex dropbox/live youtube streaming method as already documented.", 'num_user_post': u' 54', 'author': u'chrisjmears'}, {'date': u'August 5, 2015 - 5:04 pm', 'content': u"Is there something new about this subject? Did you resolve your problem? I have a project which also require to send a pictures. At the moment I am thinking to send the binary of the pictures throw the data stream but still i have no idea how do this task. Anybody know how much data you can send throw the channel ?I really would like to know more about this subject. I've seen the blog of this guy how do something similar but sending, i think, only the value of 8 colors after analyse the picture in the arduino, before to send the resutls:http://robmyers.org/2011/04/14/logging_colours_to_thingspeak/ Thanks in advance.", 'num_user_post': u' 2', 'author': u'Pulpoensalsa'}, {'date': u'August 6, 2015 - 8:46 am', 'content': u"Hi,Each channel field can hold a maximum of 255 characters, so storing an image is not currently possible.  If your image can fit in 16KB, you can store it in the channel's metadata field, but this would only store the most recent image (updating the metadata field would overwrite the previous value).lee", 'num_user_post': u' 457', 'author': u'lee'}, {'date': u'August 6, 2015 - 5:04 pm', 'content': u'Thanks lee for your quick answer.I think using the Metadata field could nice for mi idea. I will research a little bit more in this platform (ThingSpeak) and let see how I can manage.Juan Pedro', 'num_user_post': u' 2', 'author': u'Pulpoensalsa'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/chart-start-daytime/', 'posts': [{'date': u'July 23, 2015 - 5:23 pm', 'content': u'The more I use ThingSpeak the more I like it, but I need to be able to select in Chart Options not only the number of data samples but also the chart start day.If you have a month of data and you want to look at only one day it would be really nice (in fact essential) to be able to select the start day. Is this possible?Thanks.', 'num_user_post': u' 5', 'author': u'rod'}, {'date': u'July 24, 2015 - 8:51 am', 'content': u"Hi,You can specify the start datetime, for reference please see: https://thingspeak.com/docs/charts .  This isn't available in the chart options, although you can specify it if you open the full URL for the chart, for example: https://thingspeak.com/channels/9/charts/1?start=2015-07-01&end=2015-07-02&average=60 .lee", 'num_user_post': u' 457', 'author': u'lee'}, {'date': u'July 26, 2015 - 6:53 pm', 'content': u'Thanks Lee, that works well.For others trying this,  just be sure that the chart is public or use the api key.It would be good if the start/end  day/time could also be added to the chart options with the average value. It would not need to be per field just for the overall channel.If this could be added, being able to go back to a particular day would be very valuable.Thanks', 'num_user_post': u' 5', 'author': u'rod'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/disablingdeleting-comments-in-the-public-view-of-a-channel/', 'posts': [{'date': u'May 19, 2015 - 5:10 am', 'content': u"I have created a Channel in Thingspeak and made it public. I don't mind others viewing my data however, there is one arsehole (yeah, arsehole is the correct word to use here!) that sabotage this.He left a childish comment there and there is no way I can delete it. And there also isn't a way for me to disable comments.And there isn't a way for me to report arseholes like this!Take a look here and you'll know what I mean.https://thingspeak.com/channels/36852", 'num_user_post': u' 2', 'author': u'jinfeei'}, {'date': u'May 19, 2015 - 9:00 am', 'content': u'Hi,Thanks for letting us know about this, we deleted the comment from your channel.  We will investigate a solution for this type of behavior in the future, but if it ever happens again please feel free to email us at support@thingspeak.com .lee', 'num_user_post': u' 457', 'author': u'lee'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/last-n-record-in-a-channel/', 'posts': [{'date': u'May 19, 2015 - 5:17 am', 'content': u"I thought this should be obvious, but wouldn't it be essential to have only the last n values in a channel?   (Say, last 100 values...)Or am I using it wrongly?Thanks!", 'num_user_post': u' 2', 'author': u'jinfeei'}, {'date': u'May 19, 2015 - 8:44 am', 'content': u"Hi,We choose to store all values that you send to your channel forever, so that you can look back at your historical data and plot or analyze it.  If you just want the last 100 results, you can always use the parameter 'results=100' in your queries:  https://thingspeak.com/docs/channels#get_feed .  For charts and some feed queries, the default is 100 results already.lee", 'num_user_post': u' 457', 'author': u'lee'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/get-multiple-locations-on-map/', 'posts': [{'date': u'May 4, 2015 - 4:45 am', 'content': u"Hi,I'm looking to pull all the lat,lng fields of all my channels and plot them on a map. I couldn't find a simple way to do this yet. Is it possible to query all channels for a specific field? This also brings up another problem with API keys per channel, is there a master API key to access all my private channels info without having to enter a READ API KEY for each channel ?Should I run my on server and access db directly? Would that cause any issues?Thanks,Z", 'num_user_post': u' 3', 'author': u'zozsoy'}, {'date': u'May 4, 2015 - 8:57 am', 'content': u"Hi,You can request data for all of your channels at once, please see the documentation titled 'List My Channels' at https://thingspeak.com/docs/channels#index (scroll down a little from here).  Yes, there is an account API key which is used to perform this request. You can run your own server too, that wouldn't cause any issues.lee", 'num_user_post': u' 457', 'author': u'lee'}, {'date': u'May 12, 2015 - 4:57 am', 'content': u"Thank you for the reply, I see that I'm able to list channels however I have a different use case, I hope you can point me in the right direction:2 issues I see:-I'm looking to get the locations of all the channels at once in a json.What I've seen is I can set location=true PER CHANNEL and lat&long will be included in the response but this is not enough.- Location data is set per feed, If I request location and location was not included in the latest feed update, these fields are blank. Shouldn't location info persist into the channel itself, not just some variable that were sent as part of a feed update?e.g. iot device sends ONLY location in entry_id = 32iot device sends ONLY other info in entry_id = 33...query for channels.json&location=true shows lat&long= nullShould I mess with the DB to persist these values from previous updates into new updates so they are kept across feed updates?ORShould I mess with the controller to go back in DB to get values for lat&long fields?ORBrilliant thingspeak coders can think of a better approach? Thanks,Z", 'num_user_post': u' 3', 'author': u'zozsoy'}, {'date': u'May 12, 2015 - 6:06 am', 'content': u"I'll reply to myself not to waste anyone's time  Apparently channel feed and channel itself are already seperated. All I had to do is update the channel's latitude&longitude which persists. NOT send lat&long as a channel feed update.Thanks,", 'num_user_post': u' 3', 'author': u'zozsoy'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/digital-chart/', 'posts': [{'date': u'April 14, 2015 - 11:31 am', 'content': u"Great software! I have been having fun playing with it.I'd love to see a 'logic' chart, that would plot a single integer value as eight discrete logic channels. This would be very useful for monitoring digital inputs and outputs conveniently.", 'num_user_post': u' 3', 'author': u'mikronauts'}, {'date': u'April 18, 2015 - 10:05 pm', 'content': u"You can try to to change a chart to a step chart by using 'step=true'. This is good for representing digital info. Here's an example, using my chart: http://api.thingspeak.com/channels/3/charts/1?results=10&step=true", 'num_user_post': u' 402', 'author': u'Hans'}, {'date': u'April 19, 2015 - 10:39 am', 'content': u"Thank you - that is an interesting mode, and I will try it.I was actually hoping for a logic analyzer like view, that would show the low eight bits in a value as separate logic traces.For now, I can create a separate channel, and just use 0 / 1 for each trace, but having a logic display would save bandwidth for the thingspeak servers.Now I just have to figure out why my updates stop sometimes. Time to add more diagnostics to my RPi Python code...Hans said You can try to to change a chart to a step chart by using 'step=true'. This is good for representing digital info. Here's an example, using my chart: http://api.thingspeak.com/channels/3/charts/1?results=10&step=true", 'num_user_post': u' 3', 'author': u'mikronauts'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/multi-graph-colors-on-plug-in/', 'posts': [{'date': u'April 2, 2015 - 8:14 am', 'content': u"Hi All,Im new here and what a breath of fresh air this site is to me. It would be real nice for the  multi-graph plug in if the colors for each individual graph (series) could be taken from the channel setup, why the need to specify the colors 2's and cause confusion?ThanksRay", 'num_user_post': u' 11', 'author': u'rayellam'}, {'date': u'April 2, 2015 - 8:40 am', 'content': u"Hi Ray,The plugins are separate from the channels, so the series colors have to be defined within a plugin.  You can make a plugin for somebody else's channel data, and if you don't own the channel you have to specify the color somewhere, so we chose to make the selection within the plugin.lee", 'num_user_post': u' 457', 'author': u'lee'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/time-service/', 'posts': [{'date': u'February 13, 2015 - 10:43 pm', 'content': u'It would be nice to have a time service to synchronise a RTC. NTP and SNTP are not easy to implement.Input: time zoneOutput: date time in ISO8601 format (http://en.wikipedia.org/wiki/ISO_8601)Thanks!', 'num_user_post': u' 13', 'author': u'Michel_J'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/server-side-summingaveraging/', 'posts': [{'date': u'December 30, 2014 - 2:09 am', 'content': u"Viewing channel data in detail as well as aggregated is a common use of time seried data. The automatic summing and averaging features on the channel feeds are great, but the limit of 8000 underlying data point limit is a real showstopper. With measurements taken at 16 s intervals the aggregated feeds are limited to less than two days.The suggested solution on this forum is to download the data, aggregate them, and upload the data to a new channel. This is of course possible, but requires both programing skills and and an available suitable computer (iPads wont do). The user also har to do this processing on a regular basis (a scheduled job) in order to keep the aggregated channels up to date.It woud therefore be great if this could be done server side. Provide every field in the channel setup with a summing option (checkboxes for hourly and daily, and a sum/average/median/... dropbox). The server could then automatically do the summing/averaging/etc. to a 'hidden channel' at the end of every day/hour. Aggregated request could then get data from this 'hidden channel' instead of real time summing/averaging. This would probably reduce the server overall load.When this option is changed for a field the server could que a job resumming the field to the hidden channel.This would make this great server even greater, and extend the possibilities to do both coarse and detailed graphs on the same data series. Great for both temperature and energy monitoring.", 'num_user_post': u' 4', 'author': u'larsilund'}, {'date': u'December 30, 2014 - 9:21 am', 'content': u"Hi Lars,We do some of what you're suggesting on a daily basis already.  For example, if you set a sum/average/median value of 1440 (or daily), we store that data in a separate 'hidden channel' that can then be quickly requested again.  The first time the request is made, the response will be slow since the data has to be calculated, but on subsequent requests of precalculated data the response will be fast.  Here's an example: http://api.thingspeak.com/channels/9/feeds.json?days=10&sum=daily .lee", 'num_user_post': u' 457', 'author': u'lee'}, {'date': u'December 30, 2014 - 4:26 pm', 'content': u'Does that mean that the limit of 8000 underlying values do not exist when requests are made for 1440/daily?Can i make requests for daily sums for longer periods?Is there another limit for such feed requsts?To make great applications based on any tool you must know the strengths and limitations of that tool. I would appreciate well documented limitations. A well-documented error return when the limits are exceeded would also be appreciated. Just returning null values does not give many hints for debugging. Lars', 'num_user_post': u' 4', 'author': u'larsilund'}, {'date': u'December 31, 2014 - 9:09 am', 'content': u'Hi Lars,Yes the 8000 results limit does not apply for daily feeds if sum/average/median/timescale are used.  You can make requests for as many days as you want; there is no limit for these requests.We will work on improving our documentation and returned errors. lee', 'num_user_post': u' 457', 'author': u'lee'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/send-thinghttp-value-to-a-channel-1/', 'posts': [{'date': u'November 13, 2014 - 2:40 am', 'content': u'It would be nice to be able to use a ThingHTTP value to feed a field on a channel.', 'num_user_post': u' 2', 'author': u'ezubiria'}, {'date': u'November 13, 2014 - 9:05 am', 'content': u'Hi,We will look into adding this feature, thanks for the suggestion!lee', 'num_user_post': u' 457', 'author': u'lee'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/key-management/', 'posts': [{'date': u'November 3, 2014 - 7:10 am', 'content': u"One area in which Thingspeak seems to fall down a bit compared to xively is key management. Say for example I produce a IoT project which I want to produce a small run of. For the device imagine i'm using an arduino with a cheap 16x2lcd shield with 6 buttons If I use thingspeak and talkback that means I need a way of getting a 16 character thingspeak key into the controller and a 16 character talkback key into the controller. I also need to store the channel number for thingspeak and the channel number for talkback.Thats a lot of keys to try and get an end user to enter via an lcd keypad.Ideally it would be nice to have an API which just lets me give each user say an 8 character unique key which when entered can respond with the users unique keys for thingspeak, talkback and both channel numbers.kind of a provisioning API.I've been messing about trying to find a way to do this with the current apps. The best I've got to is:Create a provisioning channel and hard code the key for this channel into the firmwareSend an update from the device to the provisioning channel. something likehttps://api.thingspeak.com/update?api_key=XXXXXXXXXXXXXXXX&field1=PROVISION_SERIAL_NO,3374-3H8Ua react then picks up the PROVISION_SERIAL_NO,3374-3H8Uand triggers a similarly names Thing HTTP.This then places a talkback command with the new keys. something likehttps://api.thingspeak.com/talkbacks/539/commands?api_key=XXXXXXXXXXXXXXXX&command_string=PROVISION_FOR_SERIAL_NO,3374-3H8U,123456,YYYYYYYYYYYYYYYY,567,ZZZZZZZZZZZZZZZZSo the pseudocode for the provisioning on the arduino would beInform user 'Registering with server' Please waitRequest provisiondelay(5000);Request command responsebyte attempts=1;while (requested serial key != recieved serial key){Request provisiondelay 5000Re Request command responseattempts++if(attempts==6){Inform the user 'There is a problem. Please check your Serial number'delay(5000);break;}}if Serial key matches the serial key that was requested{Inform the user 'Controller registered OK'Delay(5000)Write data to eepromsoft reset without delay}Of course the down side of this approach means I need to manually create a react for each unique user and also a thinghttp for each user.Additionally, if anyone is able to get hold of the provisioning channel key, they can then listen for a provision request on the channel and grab the resultant talkback. They then have the keys for my device.Its all a bit messy ", 'num_user_post': u' 54', 'author': u'chrisjmears'}, {'date': u'November 7, 2014 - 11:32 am', 'content': u'Hi Chris,Thanks for the suggestions, we will discuss API key management internally and look for ways to improve it in the future.lee', 'num_user_post': u' 457', 'author': u'lee'}]}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/page-4/', 'threads': [{'url': u'https://community.thingspeak.com/forum/feature-requests/multiple-y-axis-on-one-chart/', 'posts': [{'date': u'July 8, 2011 - 7:09 pm', 'content': u"I am also a wifi thermostat user and currently I am logging indoor, outdoor and target (temp the tstat is set to, programmed and sometimes overidden) temperature. \xa0I'd love if all three plots were on the same chart so that I can see that I'm achieving my goal; to keep temp inside lower, but in unison with outdoor temp....if that makes sense.", 'num_user_post': u' 3', 'author': u'eisenhowerj'}, {'date': u'July 9, 2011 - 2:30 pm', 'content': u'If this option were available I could point my customers to this service for storage of data from a remote monitoring product.', 'num_user_post': u' 2', 'author': u'Evova'}, {'date': u'July 14, 2011 - 5:45 am', 'content': u'+1 for this feature request. I would like to show temperature and humidity in one chart.', 'num_user_post': u' 3', 'author': u'marten'}, {'date': u'September 9, 2011 - 12:09 pm', 'content': u"+1 as well, for the same reasons as above.As I add more thermometers, I'd like to see the temps (indoor, outdoor, refrigerator, freezer, etc.) on one plot/chart/graphic.", 'num_user_post': u' 1', 'author': u'dgou'}, {'date': u'September 17, 2011 - 2:46 pm', 'content': u'+1 for this feature request.Would love to have some more advanced chart options, including more plots in the same chart.\xa0 ', 'num_user_post': u' 5', 'author': u'spumanti'}, {'date': u'October 14, 2014 - 7:53 pm', 'content': u"We've recently added a plugin to display multiple series on a single chart.  To access it, create a new plugin and select 'Chart With Multiple Series' as the template.lee", 'num_user_post': u' 457', 'author': u'lee'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/overlay-multiple-fields-in-single-chart/', 'posts': [{'date': u'November 28, 2011 - 5:31 am', 'content': u'The topic says it all.As well as other posters.A definite for plotting temperatures or bool values as they are related to temperatures.Is this feature being planned?ThanksDave', 'num_user_post': u' 1', 'author': u'djash40'}, {'date': u'November 28, 2011 - 2:57 pm', 'content': u'ThingSpeak 2.0 has a new Chart App. In a future post, I will layout the features for 2.0 and the plans behind it. The feedback has been overwhelming about displaying multiple fields on the same chart. We will do that and also take it one step further.If you come up with any more ideas, feel free to share on this section of the forum.', 'num_user_post': u' 402', 'author': u'Hans'}, {'date': u'March 19, 2012 - 8:57 am', 'content': u"Hello,multiple fields on the same chart will be terrific. +1 !any idea when ThingSpeak 2.0 is planned ?\xa0are there tutorials to benefit from the Google visualizations, just like gauge. I've seen that so many displays are possible...thanks", 'num_user_post': u' 1', 'author': u'julienser'}, {'date': u'October 14, 2014 - 7:52 pm', 'content': u"We've recently added a plugin to display multiple series on a single chart.  To access it, create a new plugin and select 'Chart With Multiple Series' as the template.lee", 'num_user_post': u' 457', 'author': u'lee'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/search-channels-by-location/', 'posts': [{'date': u'February 20, 2014 - 9:49 pm', 'content': u'HiI would like to be able  to use the API to list public channels centered around a long/lat location? Something like http://api.thingspeak.com/channels/public?lon=123&lat=123&radius=50It would enable mashing data from channels with a GIS outputThanksAaron', 'num_user_post': u' 7', 'author': u'turboencabulator'}, {'date': u'February 21, 2014 - 8:50 am', 'content': u'Aaron,Thanks for the feature request. We will implement this feature in a future update.We will provide an API call that returns channels with location data as not all channels have location data. Then, you will be able to search by lat and long and a distance in meters.Thanks again!Hans', 'num_user_post': u' 402', 'author': u'Hans'}, {'date': u'August 5, 2014 - 3:10 pm', 'content': u"Hi Aaron,We recently added the ability to search public channels by location.  Here's the relevant documentation: https://thingspeak.com/docs/channels#index .Here's an example of searching for channels near Pittsburgh: https://thingspeak.com/channels/public?latitude=40.430224&longitude=-80.002441&distance=10 .lee", 'num_user_post': u' 457', 'author': u'lee'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/scaling-graphs/', 'posts': [{'date': u'April 19, 2011 - 10:11 pm', 'content': u"I'd like to see the capability to set the axis scale on the graphs. \xa0I would guess the y axis especially since the x axis is controlled by the time scale you choose.You guys are making great progress so far. \xa0This is very cool.Thank you,Bob", 'num_user_post': u' 12', 'author': u'bgardner'}, {'date': u'July 8, 2011 - 7:28 pm', 'content': u"I also want this feature. \xa0I am logging temperatures and they only span 20 degrees or so. \xa0It would be nice to be able to set Y axis to a range. \xa0For instance my indoor temps range from 76 to 85 degrees. \xa0If I could set the range to 70-90, it would show more 'depth'? Not sure what the right word for that is.", 'num_user_post': u' 3', 'author': u'eisenhowerj'}, {'date': u'December 8, 2011 - 6:13 am', 'content': u"I'd also like this capability. You can create new parameters like 'yScaleMax' and 'yScaleMin'. It would be helpful. ", 'num_user_post': u' 5', 'author': u'ricardo_ati'}, {'date': u'October 17, 2012 - 7:59 am', 'content': u'yes indeed. And also add the possibility to define the minimum value and maximum of the yaxis.', 'num_user_post': u' 5', 'author': u'tparvais'}, {'date': u'July 22, 2014 - 8:11 pm', 'content': u'Some time ago we added the ability to set the y-axis min and max via the chart options.  ( https://thingspeak.com/docs/charts#create )I apologize for not updating this thread sooner with this information.lee', 'num_user_post': u' 457', 'author': u'lee'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/feature-request-spline-charts/', 'posts': [{'date': u'April 3, 2014 - 9:59 am', 'content': u"Hi,I read somewhere on this forum that ThingSpeak's charts functionality is implemented using the highcharts.com charts library. They also support these really nice looking spline plots:http://www.highcharts.com/demo/spline-plot-bandsWould it be possible to support this chart type in ThingSpeak?Thanks, Malden", 'num_user_post': u' 15', 'author': u'Malden'}, {'date': u'April 3, 2014 - 11:02 pm', 'content': u"Hi Malden,As requested, we've just added spline charts: https://thingspeak.com/channels/9/charts/1?results=10&type=spline .lee", 'num_user_post': u' 457', 'author': u'lee'}, {'date': u'April 4, 2014 - 12:21 pm', 'content': u'Great. That was really quick. I might come back with more requests then Thanks a lot.Malden', 'num_user_post': u' 15', 'author': u'Malden'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/a-little-webspace/', 'posts': [{'date': u'March 10, 2014 - 11:38 am', 'content': u'Hi, the ability to add javascript plugins are awesome however Im trying to write an HTML5/CANVAS/Processing.js sketch.The big problem is processing.js includes no native commands for grabbing JSON data and the tutorials on the web are very sparse and assume a lot more knowledge of javascript passing variables to processing.For beginners the easiest method is to use loadstrings however this wont work unless your in the same domain as the data. So, I was wondering. A very small amount of webspace per user account would be beyond excellent as it would allow newbie users like me to just stick their code and any images/resources directly on the server and it should all just work!', 'num_user_post': u' 54', 'author': u'chrisjmears'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/add-hi-lo-avg-graph/', 'posts': [{'date': u'July 22, 2013 - 1:58 am', 'content': u'Hi,I would like to be able to show my data in a HI - LO - AVG graph (3 lines) based on the period length of the datasegment (using timescale for instance). This is very handy for instance when displaying temperaturedata over several days/weeks. regardsCorB', 'num_user_post': u' 37', 'author': u'CorBee'}, {'date': u'December 3, 2013 - 6:49 pm', 'content': u'Hi,We use Highcharts to produce our charts, so if you know JavaScript you may be able to modify the JavaScript code to produce a customized graph: http://www.highcharts.com/docs/chart-and-series-types/chart-typeshttp://www.highcharts.com/docs/chart-concepts/series .lee', 'num_user_post': u' 457', 'author': u'lee'}, {'date': u'December 28, 2013 - 3:19 am', 'content': u'Hello Lee,The responsetime is a bit long ... nearly half a year since I posted this. Sure I am able to create a javascript using highcharts to achieve this. But isnt the whole purpose of the feature requests than futile ? Since everybody can retrieve the raw data using JSON or other protocols we all can also create javascripts to display them in the fashion we wish ... The idea behing my request is that I think that many people like to check a datachannel with a hi-lo-average graph. Just as people also have asked several times to display the last uploaded value in the graphs as textbox. For me it has become unclear where you wish to go with the users coming with feature requests ? For the great service you are delivering to us in terms of datastorage this part of thingspeak (forum) seems to be less functional which is unfortunate I think.regardsCorBee', 'num_user_post': u' 37', 'author': u'CorBee'}, {'date': u'December 29, 2013 - 6:32 pm', 'content': u"Hi CorBee,I apologize about the long response time, I only just became an employee this month and you're right, the forums had been neglected for some time.You are correct in asking for feature requests in this forum.  If enough users need the hi-lo-avg feature, yes we will implement it.  In the meantime, we will be adding the ability for charts to have multiple series first.Please keep the feedback coming, I'm checking these forums daily now and am working on greatly improving the ThingSpeak service.  Some things I'm currently working on: upgrading our backend servers, updating our Ruby/Rails versions, updating the user interface, updating the open-source version, and implementing new features.  Hopefully you'll see some noticeable improvements in the coming months!lee", 'num_user_post': u' 457', 'author': u'lee'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/display-realtime-value-big-number/', 'posts': [{'date': u'October 28, 2013 - 4:43 pm', 'content': u"Thank you very much for this amazing service, really nice.My sugestion is to display a big number with the last value received.It's the most interesting feature in xively that I would be happy to see here.Thank you", 'num_user_post': u' 1', 'author': u'anjoze'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/upgrade-forum-to-post-files-and-images/', 'posts': [{'date': u'June 18, 2013 - 3:15 pm', 'content': u"I have a project that I'd like to contribute as open source material.  Please consider upgrading forum to post files and images, making open source sharing possible.", 'num_user_post': u' 70', 'author': u'turgo'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/add-datetime-to-historic-upload-data/', 'posts': [{'date': u'May 31, 2013 - 8:58 am', 'content': u'Hi,Can you add a parameter when uploading historic data, so that when you upload eg. a csv file you can give the samples their correct moment in time?Something like field1=2,34   stamp=2013-02-17T12:06:03ZAnd it would be nice that the value is ignored when there is a sample at that moment already. (So no error situation)', 'num_user_post': u' 4', 'author': u'AFA58'}, {'date': u'June 15, 2013 - 4:52 am', 'content': u'Historic data can be added by the .csv file upload.There you can add a datetime and values in for all fields.Mind you, ALL fields, so updating only one field is not possible.When you do upload, the new data is just added. So that means that when you upload the csv file 3 times, you have 3 times the amount of data points: for every timestamp 3.Sounds logical but is not really.What I would like is an option to correct data of specific fields at a specific datetime stamp- An option to overwrite datafields when one is present for that field at that datetime stamp. (Measured up to the second)- When you can set that option at the field level, you have also made it possible to correct only one field. For a given timestamp, make one field overwrite: The field to correct, and the rest not overwrite: stay as they are. (And there is not another value added)For example:2013-06-15 08:03:00,4,5,4Updates three fields, removes old values at that date time stamp2013-06-15 08:03:00,#,5,#Updates only Field2, Field1 and Field3 remain as they are (# is the code for that)Also an option to delete single field values  at a given datetime stamp would be niceExample:2013-06-15 08:03:00,#,@,#Removes the value for Field2 at that DateTime stamo (the @ code) and leaves the rest unchanged (The # code)', 'num_user_post': u' 4', 'author': u'AFA58'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/add-a-thinghttp-timestamp-variable/', 'posts': [{'date': u'May 20, 2013 - 1:08 am', 'content': u'Hi,I would like to see a timestamp variable added to THINGHTTP that can be used together with the %%trigger%% option. This has the advantage that a user can check when a message was send directly and it will also help understanding if a message from THINGHTTP somehow got delayed (since you can compare the timestamp with the time the message was delivered).Cor', 'num_user_post': u' 37', 'author': u'CorBee'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/allow-react-to-act-on-value-inoutside-band/', 'posts': [{'date': u'May 20, 2013 - 1:04 am', 'content': u'Hi,As a feature request I would like to see the option to use REACT to act on a value when its outside a given bandwidth.As an example: when you measure temperatures in a greenhouse you want to know when its getting too cold or when its getting too warm. All other temperatures are OK. For this a user would need to specify a higher limit and a lower limit so the system can signal accordingly.Currently this can only be achieved by setting 2 separate reacts for the same variable, one checking if the value is below a lower limit and one checking if its above a higher limit.This setup could then also be used (I hope) to do the opposite, so get a message when the temperature is OK and inside the band. Currently that is not at all possible.cheerCor', 'num_user_post': u' 37', 'author': u'CorBee'}]}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/page-5/', 'threads': [{'url': u'https://community.thingspeak.com/forum/feature-requests/weblog-functionality/', 'posts': [{'date': u'March 15, 2013 - 6:22 pm', 'content': u'Just add the widget with simple text log with timestamp updated with API GET/POST.', 'num_user_post': u' 1', 'author': u'Klaudiusz'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/help-me-to-find-a-master-thesis-topic-about-iot/', 'posts': [{'date': u'March 28, 2012 - 4:24 pm', 'content': u"Hi,I'm studying master of Information Management Systems and I'm interested in IoT subjects a lot and I like to work on it in my PhD too, but I couldn't still find proper topic for my thesis. I had some ideas and I worked on some of them, but my professor didn't accept them. Actually he doesn't have any ideas either because he's not familiar with IoT.I like to do my research on IoT with integration of some topics like health issues or Cities/Urabn issues. Unfortunately the thesis should contains implementation part too and I have to show some statistical reports and analyse data to prove results. They won't accept theoretical research, but it's acceptable if I use simulators in my thesis and I have to use some published papers as my references too. In another word it shouldn't be a completely innovate idea that nobody worked before. These are our faculty rules! I'm not a software developer and I just worked with C++ but I'll be able to learn simple programming if needed. I have about 5 months to complete my thesis and I would be appreciated if someone helps me find my master thesis topic. I should mention that it's better to choose a simple project at this step that I can finish and give results from it in this short time and then I will expand my research related to this topic in Ph.D.Thanks in advancedArmin", 'num_user_post': u' 1', 'author': u'armin'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/delete-bad-data-points/', 'posts': [{'date': u'July 8, 2011 - 7:23 pm', 'content': u'Scaling would help mitigate the problem with this, but when one of my data points is bad it throws off the scale of the chart. \xa0I plan on putting some error correction in my script but the option would be nice.', 'num_user_post': u' 3', 'author': u'eisenhowerj'}, {'date': u'July 12, 2011 - 1:58 pm', 'content': u'There are two API parameters that might help you filter bad data.You can filter using min and max parameters. So, set min=100 and max=200 and you will only see values between 100 and 200.', 'num_user_post': u' 402', 'author': u'Hans'}, {'date': u'December 8, 2011 - 6:03 am', 'content': u'Yes it is true, with the limits you can hide bad data, but they remain there.It is better to delete them.', 'num_user_post': u' 5', 'author': u'ricardo_ati'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/number-of-fields/', 'posts': [{'date': u'November 16, 2011 - 10:09 am', 'content': u'Do you have any plans to increase the number of fields per channel.For my project, I need more than 8 fields.', 'num_user_post': u' 2', 'author': u'noname'}, {'date': u'November 17, 2011 - 12:49 am', 'content': u'No\xa0immediate\xa0plans to expand the fields inside of channel. Our schema\xa0is centered around 8 general data fields.Can you use multiple channels for your project?', 'num_user_post': u' 402', 'author': u'Hans'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/support-for-picaxe-microcontrolers/', 'posts': [{'date': u'October 7, 2011 - 12:06 pm', 'content': u"i'd love to thingspeak to my picaxe 08m2 chips, please!...thanks for thingspeak - it's a great idea!", 'num_user_post': u' 2', 'author': u'thingspeak-marc'}, {'date': u'October 13, 2011 - 12:42 am', 'content': u"I don't know much about Picaxe - do they have an\xa0Ethernet\xa0board? If so could you send me a link? Maybe I will get one for my collection and try to figure it out... I have about 20\xa0Ethernet\xa0boards...", 'num_user_post': u' 402', 'author': u'Hans'}, {'date': u'October 13, 2011 - 1:43 am', 'content': u"please accept my apologies for not providing very helpful informationin the following- am a novice to electronics & picaxe ... and thingspeak.\xa0i could not find an ethernet shield on http://www.picaxe.com/Hardware,but\xa0a (web)socket framework\xa0... e.g. 'Javascript Sockets' (http://code.google.com/p/jssockets/) ...in combination with a serial server program\xa0... e.g. Picaxe's 'macaxepad' or\xa0 'serproxy' ....\xa0can access it's data via a usb/serial port.\xa0i do not know if this is important:picaxe runs at a default speed of 4800 baude, it's usb/serial connector (the 'programmer cable') receives reversed signals (in comparison to arduino)and it comes in a range of 8 - 20 pin microcontroller chips (which makes picaxe a cheap-to-build and flexible developing environment)", 'num_user_post': u' 2', 'author': u'thingspeak-marc'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/possibility-to-display-shorter-time-period-in-hours/', 'posts': [{'date': u'July 14, 2011 - 5:53 am', 'content': u'I would like to have the possibility to show a shorter time period in my charts:like:\xa0hours=[hours to include in feed]', 'num_user_post': u' 3', 'author': u'marten'}, {'date': u'July 14, 2011 - 11:58 pm', 'content': u"You can get close using a combination of 'results' and 'timescale'Here's an example:\xa0http://api.thingspeak.com/channels/9/charts/1?timescale=60&width=455&height=260&results=600", 'num_user_post': u' 402', 'author': u'Hans'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/shorter-field-parameters-when-updating-channel/', 'posts': [{'date': u'July 9, 2011 - 2:27 pm', 'content': u'I am using an embedded device to deliver data and have limited space for the URL/data I send. Having to include the full field parameter names wasted quite a few bytes when using all channels.Could we be allowed to use numeric field parameter instead?i.e.\xa01=123.456&2=123.456&3=123.456\xa0Thank you', 'num_user_post': u' 2', 'author': u'Evova'}, {'date': u'July 10, 2011 - 2:03 pm', 'content': u'Done.', 'num_user_post': u' 457', 'author': u'lee'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/thingtweet-with-multiple-commands-relayed-in-the-order-in-which-they-are-tweeted/', 'posts': [{'date': u'June 8, 2011 - 3:27 pm', 'content': u"I have noticed when using TweetControl, multiple tweet controls can be\xa0executed\xa0at the same time, but instead of the ThingHTTP requests being sent in the order they were entered in twitter, they are sent in the relative order of when they were created in the ThingHTTP app. (or alphabetical order? one of the two.)\xa0I was hoping to create some sort of way to enter variables via twitter e.g. #thingspeak #dimLight #(10, 20, 30, 40, 50, 60...) using different http requests as a variable thing so that my microcontroller can discern more complicated commands with 'variables'\xa0any chance of that happening?\xa0\xa0", 'num_user_post': u' 8', 'author': u'mc'}, {'date': u'June 8, 2011 - 7:24 pm', 'content': u'Well, the fact that it worked with multiple hashtags at all is the mystery. I guess that is good design. We will check out the order issue though. Thanks for discovering a new feature \U0001f642', 'num_user_post': u' 402', 'author': u'Hans'}, {'date': u'June 8, 2011 - 7:26 pm', 'content': u"The Twitter status (without the hashtags) is sent to the ThingHTTP request as a parameter called 'status'. \xa0So if you post to Twitter like this:30 #thingspeak #dimLightand have your ThingHTTP body set up as:status=%%status%%Then ThingHTTP will post to your microcontroller with:status=30\xa0Let us know if this helped you out!", 'num_user_post': u' 457', 'author': u'lee'}, {'date': u'June 8, 2011 - 8:14 pm', 'content': u"We also just changed the triggers for you so that your ThingHTTP's will be processed in the correct order. \xa0So a Twitter status of:#thingspeak #trigger1 #trigger2 #trigger3will process the ThingHTTPs in this order:trigger1, trigger2, trigger3with a 1 second delay between each request.", 'num_user_post': u' 457', 'author': u'lee'}, {'date': u'June 9, 2011 - 10:45 am', 'content': u"that is spectacular! \U0001f642 thanks much.\xa0I did try posting to twitter in that form ('20\xa0#thingspeak\xa0#A')\xa0and setting up the ThingHTTP body ('status=%%status%')\xa0that way, but the http post request that got to my microcontroller was this:\xa0POST / HTTP/1.1User-Agent: ThingHTTP/1.0Host: api.thingspeak.comAccept: */*Content-Type: application/x-www-form-urlencodedConnection: closeContent-Length: 16\xa0did i miss something?\xa0", 'num_user_post': u' 8', 'author': u'mc'}, {'date': u'June 9, 2011 - 3:35 pm', 'content': u'Did you try:status=%%status%%instead of:status=%%status%?\xa0The other fields look correct for your ThingHTTP, but you may want to double-check:Method: POSTContent Type:\xa0application/x-www-form-urlencodedHTTP Version: 1.1', 'num_user_post': u' 457', 'author': u'lee'}, {'date': u'June 13, 2011 - 3:12 pm', 'content': u'yes... Sorry, i must have missed that last one copy and pasting it. but that is correct,\xa0i have tried both POST and GET and regardless of weather I fill in the field for Content Type in POST, the content type is returned to my microcontroller as that. I tried HTTP version 1.1 and 1.0.\xa0', 'num_user_post': u' 8', 'author': u'mc'}, {'date': u'June 13, 2011 - 11:27 pm', 'content': u"Ok let's test to see how your ThingHTTP POST looks from a third-party's perspective. \xa0Change the URL for one of your ThingHTTPs to:http://posttestserver.com/post.phpYou should then be able to use TweetControl and see the result as the last entry on this page:http://posttestserver.com/data/2011/When you find your entry, please paste your link, for example mine is:http://posttestserver.com/data/2011/06/13/21.11.34832950073", 'num_user_post': u' 457', 'author': u'lee'}, {'date': u'June 14, 2011 - 8:04 am', 'content': u'http://posttestserver.com/data/2011/06/14/06.01.221785817936For the sake of being thorough, the ThingHTTP setup is:Name:Command AURL:http://posttestserver.com/post.phpHTTP Auth Username:\xa0HTTP Auth Password:\xa0Method:GETContent Type:\xa0HTTP Version:1.0Host:\xa0Headers:Name: cmd\xa0Value: &&A\xa0Body:status=%%status%%Parse String:\xa0Created:Wed, Jun 1 at 2:54 pm', 'num_user_post': u' 8', 'author': u'mc'}, {'date': u'June 14, 2011 - 12:14 pm', 'content': u'ThingHTTP only sends the Body portion for POSTs. \xa0So change to:Method: POSTContent Type:\xa0application/x-www-form-urlencodedHTTP Version: 1.1The status should work correctly after that.', 'num_user_post': u' 457', 'author': u'lee'}, {'date': u'June 14, 2011 - 12:51 pm', 'content': u'OH! got it. silly mistake (of course): in my code i look for one new line character instead of two for a POST. Thanks much!\xa0', 'num_user_post': u' 8', 'author': u'mc'}, {'date': u'June 14, 2011 - 3:00 pm', 'content': u'Good to hear!', 'num_user_post': u' 457', 'author': u'lee'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/being-able-to-remove-the-iobridge-graph-in-the-channels-section/', 'posts': [{'date': u'June 3, 2011 - 2:12 pm', 'content': u'See topic title \U0001f609\xa0', 'num_user_post': u' 3', 'author': u'seigel'}, {'date': u'June 6, 2011 - 6:48 am', 'content': u'The example ioBridge chart is now automatically removed if your channel has recent data to display.', 'num_user_post': u' 457', 'author': u'lee'}, {'date': u'June 7, 2011 - 12:35 am', 'content': u'Awesome and thank you!\xa0So Do you have fun doing this and what are your future plans? \xa0Great service!\xa0CheersJames.', 'num_user_post': u' 3', 'author': u'seigel'}, {'date': u'June 7, 2011 - 12:49 am', 'content': u"I have great fun doing this! \xa0There is no shortage of interesting problems to work on with ThingSpeak, and we're continually working to provide you with the most feature-rich service we can. \xa0As for future plans, a lot of that is up to the community. \xa0Keep asking for new things, and we'll keep providing them.", 'num_user_post': u' 457', 'author': u'lee'}, {'date': u'June 7, 2011 - 8:33 am', 'content': u"Do you have a model to keep this going? \xa0I am sure it isn't free. \U0001f642", 'num_user_post': u' 3', 'author': u'seigel'}, {'date': u'June 7, 2011 - 5:10 pm', 'content': u'I have to admit this is one of the things I have thought about also.\xa0Bob', 'num_user_post': u' 12', 'author': u'bgardner'}, {'date': u'June 7, 2011 - 5:40 pm', 'content': u"I'm just a programmer that builds websites, but the ThingSpeak service is paid for by ioBridge (http://www.iobridge.com/). \xa0They make money off of their hardware and other services, so if you want to support us, buy some ioBridge products and tell them Lee sent you!", 'num_user_post': u' 457', 'author': u'lee'}, {'date': u'June 7, 2011 - 6:13 pm', 'content': u"Thanks for the\xa0endorsement\xa0Lee. I am glad you're with us. You're work is awesome.But, Lee is right. ThingSpeak is another service offered by ioBridge. ThingSpeak started off as a private ioBridge API. We\xa0decided\xa0to open it up, give the project a name, and upload the source to GitHub. In order to create an internet of things, you need all things to play. So, if you have ioBridge stuff you can get it work with anything, or have any HTTP supported sensor, microcontroller,\xa0shield, etc. work with\xa0each other.The ThingSpeak service, as it is, will remain free. Users that want dedicated instances or private installs for commercial apps, are free to contact us. We have a number of partnerships with hardware companies and will\xa0announce\xa0some major integration projects soon. We also have a bunch of startups prototyping with us, rather than starting from scratch.So far, the project has been very\xa0successful. Thanks in large part to the community trying and inventing new things. We look forward to releasing more apps and seeing how you use them.", 'num_user_post': u' 402', 'author': u'Hans'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/export-uploaded-data/', 'posts': [{'date': u'June 2, 2011 - 4:27 pm', 'content': u'Is there a way to export the data that has been uploaded to a channel? This would be a great feature.If I have overseen the possibility, please let me know.\xa0Thanks,Marcel', 'num_user_post': u' 2', 'author': u'marcelhell'}, {'date': u'June 2, 2011 - 5:04 pm', 'content': u'Marcel:You can use the API to get data out. You can export data formatted as JSON, XML, or CSV.Ex. http://api.thingspeak.com/channels/(channel_id)/feed.csvThen, you can tack on parameters to control how much data and when.is that what you are looking for?\xa0', 'num_user_post': u' 402', 'author': u'Hans'}, {'date': u'June 2, 2011 - 5:12 pm', 'content': u'Yes, thanks!', 'num_user_post': u' 2', 'author': u'marcelhell'}]}, {'url': u'https://community.thingspeak.com/forum/feature-requests/speak-and-read-thingtweet-with-arduino/', 'posts': [{'date': u'April 25, 2011 - 2:59 am', 'content': u"Hai.\xa0I'm working with arduino and wiz810mj for send and received twitter massages.With Thingtweet for it.Any possibilities with gps location?\xa0JecksonIndonesia\xa0@JecksonSB", 'num_user_post': u' 1', 'author': u'jeckson'}]}]}]