{"url": "https://community.thingspeak.com/forum/feature-requests/page-5/", "threads": [{"url": "https://community.thingspeak.com/forum/feature-requests/weblog-functionality/", "posts": [{"date": "March 15, 2013 - 6:22 pm", "content": "Just add the widget with simple text log with timestamp updated with API GET/POST.", "num_user_post": " 1", "author": "Klaudiusz"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/help-me-to-find-a-master-thesis-topic-about-iot/", "posts": [{"date": "March 28, 2012 - 4:24 pm", "content": "Hi,I'm studying master of Information Management Systems and I'm interested in IoT subjects a lot and I like to work on it in my PhD too, but I couldn't still find proper topic for my thesis. I had some ideas and I worked on some of them, but my professor didn't accept them. Actually he doesn't have any ideas either because he's not familiar with IoT.I like to do my research on IoT with integration of some topics like health issues or Cities/Urabn issues. Unfortunately the thesis should contains implementation part too and I have to show some statistical reports and analyse data to prove results. They won't accept theoretical research, but it's acceptable if I use simulators in my thesis and I have to use some published papers as my references too. In another word it shouldn't be a completely innovate idea that nobody worked before. These are our faculty rules! I'm not a software developer and I just worked with C++ but I'll be able to learn simple programming if needed. I have about 5 months to complete my thesis and I would be appreciated if someone helps me find my master thesis topic. I should mention that it's better to choose a simple project at this step that I can finish and give results from it in this short time and then I will expand my research related to this topic in Ph.D.Thanks in advancedArmin", "num_user_post": " 1", "author": "armin"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/delete-bad-data-points/", "posts": [{"date": "July 8, 2011 - 7:23 pm", "content": "Scaling would help mitigate the problem with this, but when one of my data points is bad it throws off the scale of the chart.  I plan on putting some error correction in my script but the option would be nice.", "num_user_post": " 3", "author": "eisenhowerj"}, {"date": "July 12, 2011 - 1:58 pm", "content": "There are two API parameters that might help you filter bad data.You can filter using min and max parameters. So, set min=100 and max=200 and you will only see values between 100 and 200.", "num_user_post": " 402", "author": "Hans"}, {"date": "December 8, 2011 - 6:03 am", "content": "Yes it is true, with the limits you can hide bad data, but they remain there.It is better to delete them.", "num_user_post": " 5", "author": "ricardo_ati"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/number-of-fields/", "posts": [{"date": "November 16, 2011 - 10:09 am", "content": "Do you have any plans to increase the number of fields per channel.For my project, I need more than 8 fields.", "num_user_post": " 2", "author": "noname"}, {"date": "November 17, 2011 - 12:49 am", "content": "No immediate plans to expand the fields inside of channel. Our schema is centered around 8 general data fields.Can you use multiple channels for your project?", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/support-for-picaxe-microcontrolers/", "posts": [{"date": "October 7, 2011 - 12:06 pm", "content": "i'd love to thingspeak to my picaxe 08m2 chips, please!...thanks for thingspeak - it's a great idea!", "num_user_post": " 2", "author": "thingspeak-marc"}, {"date": "October 13, 2011 - 12:42 am", "content": "I don't know much about Picaxe - do they have an Ethernet board? If so could you send me a link? Maybe I will get one for my collection and try to figure it out... I have about 20 Ethernet boards...", "num_user_post": " 402", "author": "Hans"}, {"date": "October 13, 2011 - 1:43 am", "content": "please accept my apologies for not providing very helpful informationin the following- am a novice to electronics & picaxe ... and thingspeak. i could not find an ethernet shield on http://www.picaxe.com/Hardware,but a (web)socket framework ... e.g. 'Javascript Sockets' (http://code.google.com/p/jssockets/) ...in combination with a serial server program ... e.g. Picaxe's 'macaxepad' or  'serproxy' .... can access it's data via a usb/serial port. i do not know if this is important:picaxe runs at a default speed of 4800 baude, it's usb/serial connector (the 'programmer cable') receives reversed signals (in comparison to arduino)and it comes in a range of 8 - 20 pin microcontroller chips (which makes picaxe a cheap-to-build and flexible developing environment)", "num_user_post": " 2", "author": "thingspeak-marc"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/possibility-to-display-shorter-time-period-in-hours/", "posts": [{"date": "July 14, 2011 - 5:53 am", "content": "I would like to have the possibility to show a shorter time period in my charts:like: hours=[hours to include in feed]", "num_user_post": " 3", "author": "marten"}, {"date": "July 14, 2011 - 11:58 pm", "content": "You can get close using a combination of 'results' and 'timescale'Here's an example: http://api.thingspeak.com/channels/9/charts/1?timescale=60&width=455&height=260&results=600", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/shorter-field-parameters-when-updating-channel/", "posts": [{"date": "July 9, 2011 - 2:27 pm", "content": "I am using an embedded device to deliver data and have limited space for the URL/data I send. Having to include the full field parameter names wasted quite a few bytes when using all channels.Could we be allowed to use numeric field parameter instead?i.e. 1=123.456&2=123.456&3=123.456 Thank you", "num_user_post": " 2", "author": "Evova"}, {"date": "July 10, 2011 - 2:03 pm", "content": "Done.", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/thingtweet-with-multiple-commands-relayed-in-the-order-in-which-they-are-tweeted/", "posts": [{"date": "June 8, 2011 - 3:27 pm", "content": "I have noticed when using TweetControl, multiple tweet controls can be executed at the same time, but instead of the ThingHTTP requests being sent in the order they were entered in twitter, they are sent in the relative order of when they were created in the ThingHTTP app. (or alphabetical order? one of the two.) I was hoping to create some sort of way to enter variables via twitter e.g. #thingspeak #dimLight #(10, 20, 30, 40, 50, 60...) using different http requests as a variable thing so that my microcontroller can discern more complicated commands with 'variables' any chance of that happening?  ", "num_user_post": " 8", "author": "mc"}, {"date": "June 8, 2011 - 7:24 pm", "content": "Well, the fact that it worked with multiple hashtags at all is the mystery. I guess that is good design. We will check out the order issue though. Thanks for discovering a new feature 🙂", "num_user_post": " 402", "author": "Hans"}, {"date": "June 8, 2011 - 7:26 pm", "content": "The Twitter status (without the hashtags) is sent to the ThingHTTP request as a parameter called 'status'.  So if you post to Twitter like this:30 #thingspeak #dimLightand have your ThingHTTP body set up as:status=%%status%%Then ThingHTTP will post to your microcontroller with:status=30 Let us know if this helped you out!", "num_user_post": " 457", "author": "lee"}, {"date": "June 8, 2011 - 8:14 pm", "content": "We also just changed the triggers for you so that your ThingHTTP's will be processed in the correct order.  So a Twitter status of:#thingspeak #trigger1 #trigger2 #trigger3will process the ThingHTTPs in this order:trigger1, trigger2, trigger3with a 1 second delay between each request.", "num_user_post": " 457", "author": "lee"}, {"date": "June 9, 2011 - 10:45 am", "content": "that is spectacular! 🙂 thanks much. I did try posting to twitter in that form ('20 #thingspeak #A') and setting up the ThingHTTP body ('status=%%status%') that way, but the http post request that got to my microcontroller was this: POST / HTTP/1.1User-Agent: ThingHTTP/1.0Host: api.thingspeak.comAccept: */*Content-Type: application/x-www-form-urlencodedConnection: closeContent-Length: 16 did i miss something? ", "num_user_post": " 8", "author": "mc"}, {"date": "June 9, 2011 - 3:35 pm", "content": "Did you try:status=%%status%%instead of:status=%%status%? The other fields look correct for your ThingHTTP, but you may want to double-check:Method: POSTContent Type: application/x-www-form-urlencodedHTTP Version: 1.1", "num_user_post": " 457", "author": "lee"}, {"date": "June 13, 2011 - 3:12 pm", "content": "yes... Sorry, i must have missed that last one copy and pasting it. but that is correct, i have tried both POST and GET and regardless of weather I fill in the field for Content Type in POST, the content type is returned to my microcontroller as that. I tried HTTP version 1.1 and 1.0. ", "num_user_post": " 8", "author": "mc"}, {"date": "June 13, 2011 - 11:27 pm", "content": "Ok let's test to see how your ThingHTTP POST looks from a third-party's perspective.  Change the URL for one of your ThingHTTPs to:http://posttestserver.com/post.phpYou should then be able to use TweetControl and see the result as the last entry on this page:http://posttestserver.com/data/2011/When you find your entry, please paste your link, for example mine is:http://posttestserver.com/data/2011/06/13/21.11.34832950073", "num_user_post": " 457", "author": "lee"}, {"date": "June 14, 2011 - 8:04 am", "content": "http://posttestserver.com/data/2011/06/14/06.01.221785817936For the sake of being thorough, the ThingHTTP setup is:Name:Command AURL:http://posttestserver.com/post.phpHTTP Auth Username: HTTP Auth Password: Method:GETContent Type: HTTP Version:1.0Host: Headers:Name: cmd Value: &&A Body:status=%%status%%Parse String: Created:Wed, Jun 1 at 2:54 pm", "num_user_post": " 8", "author": "mc"}, {"date": "June 14, 2011 - 12:14 pm", "content": "ThingHTTP only sends the Body portion for POSTs.  So change to:Method: POSTContent Type: application/x-www-form-urlencodedHTTP Version: 1.1The status should work correctly after that.", "num_user_post": " 457", "author": "lee"}, {"date": "June 14, 2011 - 12:51 pm", "content": "OH! got it. silly mistake (of course): in my code i look for one new line character instead of two for a POST. Thanks much! ", "num_user_post": " 8", "author": "mc"}, {"date": "June 14, 2011 - 3:00 pm", "content": "Good to hear!", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/being-able-to-remove-the-iobridge-graph-in-the-channels-section/", "posts": [{"date": "June 3, 2011 - 2:12 pm", "content": "See topic title 😉 ", "num_user_post": " 3", "author": "seigel"}, {"date": "June 6, 2011 - 6:48 am", "content": "The example ioBridge chart is now automatically removed if your channel has recent data to display.", "num_user_post": " 457", "author": "lee"}, {"date": "June 7, 2011 - 12:35 am", "content": "Awesome and thank you! So Do you have fun doing this and what are your future plans?  Great service! CheersJames.", "num_user_post": " 3", "author": "seigel"}, {"date": "June 7, 2011 - 12:49 am", "content": "I have great fun doing this!  There is no shortage of interesting problems to work on with ThingSpeak, and we're continually working to provide you with the most feature-rich service we can.  As for future plans, a lot of that is up to the community.  Keep asking for new things, and we'll keep providing them.", "num_user_post": " 457", "author": "lee"}, {"date": "June 7, 2011 - 8:33 am", "content": "Do you have a model to keep this going?  I am sure it isn't free. 🙂", "num_user_post": " 3", "author": "seigel"}, {"date": "June 7, 2011 - 5:10 pm", "content": "I have to admit this is one of the things I have thought about also. Bob", "num_user_post": " 12", "author": "bgardner"}, {"date": "June 7, 2011 - 5:40 pm", "content": "I'm just a programmer that builds websites, but the ThingSpeak service is paid for by ioBridge (http://www.iobridge.com/).  They make money off of their hardware and other services, so if you want to support us, buy some ioBridge products and tell them Lee sent you!", "num_user_post": " 457", "author": "lee"}, {"date": "June 7, 2011 - 6:13 pm", "content": "Thanks for the endorsement Lee. I am glad you're with us. You're work is awesome.But, Lee is right. ThingSpeak is another service offered by ioBridge. ThingSpeak started off as a private ioBridge API. We decided to open it up, give the project a name, and upload the source to GitHub. In order to create an internet of things, you need all things to play. So, if you have ioBridge stuff you can get it work with anything, or have any HTTP supported sensor, microcontroller, shield, etc. work with each other.The ThingSpeak service, as it is, will remain free. Users that want dedicated instances or private installs for commercial apps, are free to contact us. We have a number of partnerships with hardware companies and will announce some major integration projects soon. We also have a bunch of startups prototyping with us, rather than starting from scratch.So far, the project has been very successful. Thanks in large part to the community trying and inventing new things. We look forward to releasing more apps and seeing how you use them.", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/export-uploaded-data/", "posts": [{"date": "June 2, 2011 - 4:27 pm", "content": "Is there a way to export the data that has been uploaded to a channel? This would be a great feature.If I have overseen the possibility, please let me know. Thanks,Marcel", "num_user_post": " 2", "author": "marcelhell"}, {"date": "June 2, 2011 - 5:04 pm", "content": "Marcel:You can use the API to get data out. You can export data formatted as JSON, XML, or CSV.Ex. http://api.thingspeak.com/channels/(channel_id)/feed.csvThen, you can tack on parameters to control how much data and when.is that what you are looking for? ", "num_user_post": " 402", "author": "Hans"}, {"date": "June 2, 2011 - 5:12 pm", "content": "Yes, thanks!", "num_user_post": " 2", "author": "marcelhell"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/speak-and-read-thingtweet-with-arduino/", "posts": [{"date": "April 25, 2011 - 2:59 am", "content": "Hai. I'm working with arduino and wiz810mj for send and received twitter massages.With Thingtweet for it.Any possibilities with gps location? JecksonIndonesia @JecksonSB", "num_user_post": " 1", "author": "jeckson"}]}]}