{"url": "https://community.thingspeak.com/forum/feature-requests/page-3/", "threads": [{"url": "https://community.thingspeak.com/forum/feature-requests/math-in-channels/", "posts": [{"date": "May 15, 2013 - 1:18 pm", "content": "I recently discovered that my newly installed bee hive scale is temperature sensitive.  I can filter out the temperature-induced error with a simple compensation factor, but that means I need to be able to add 0.033 times the temperature to the weight.Really, any deeper hooks into the data would be much appreciated, but there would be great value in the ability to do some basic processing in the cloud.  I can add a feed for adjusted weight in my channel, but that requires dismantling the bee hive and the scale scale and uploading new firmware.  That's an annoying process when I just want to be able to tweak the real-time graphing of raw data that's otherwise streaming beautifully!", "num_user_post": " 1", "author": "Deamiter"}, {"date": "June 2, 2015 - 3:12 am", "content": "I would really like this option too, it would be nice to have an option to do some basic math (addition, subtraction, division, multiplication) with the data in the cloud without having to edit the program running in the device...", "num_user_post": " 1", "author": "timoee"}, {"date": "June 2, 2015 - 11:11 am", "content": "Hi,Thanks for the requests, we are very much aware of this need and are working towards addressing this in a future update to our application.lee", "num_user_post": " 457", "author": "lee"}, {"date": "September 30, 2015 - 10:32 am", "content": "Check out the MATLAB Analysis and Visualizations apps built into ThingSpeak.Here's the announcement: http://community.thingspeak.com/2015/08/you-have-collected-lots-of-iot-data/", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/feature-request/", "posts": [{"date": "January 12, 2015 - 6:36 am", "content": "With devices like the Arduino Yun, it is possible to attach a webcam and take a picture.Although there are multiple tutorials out ther which allow you to connect the yun to a dropbox account to store the images it would be nice if we could have an addition to the api to allow a single png file to be uploaded along with the data stream. That way we could keep all out web connected data on one service.For my application, alongside the iot data I am logging it would be useful to have a physical view of the enviroment for which I am monitoring (See if its cloudy, rainy, someone is in the shot etc).for example an &image=001.pngI'm not talking about using thingspeak to store an ever growing sequence of png files. simply the ability to take a single small png picture every 15 seconds or so overwriting the last image.If anyone wants more than this. A sequence of images, or live streaming they can always go the more complex dropbox/live youtube streaming method as already documented.", "num_user_post": " 54", "author": "chrisjmears"}, {"date": "August 5, 2015 - 5:04 pm", "content": "Is there something new about this subject? Did you resolve your problem? I have a project which also require to send a pictures. At the moment I am thinking to send the binary of the pictures throw the data stream but still i have no idea how do this task. Anybody know how much data you can send throw the channel ?I really would like to know more about this subject. I've seen the blog of this guy how do something similar but sending, i think, only the value of 8 colors after analyse the picture in the arduino, before to send the resutls:http://robmyers.org/2011/04/14/logging_colours_to_thingspeak/ Thanks in advance.", "num_user_post": " 2", "author": "Pulpoensalsa"}, {"date": "August 6, 2015 - 8:46 am", "content": "Hi,Each channel field can hold a maximum of 255 characters, so storing an image is not currently possible.  If your image can fit in 16KB, you can store it in the channel's metadata field, but this would only store the most recent image (updating the metadata field would overwrite the previous value).lee", "num_user_post": " 457", "author": "lee"}, {"date": "August 6, 2015 - 5:04 pm", "content": "Thanks lee for your quick answer.I think using the Metadata field could nice for mi idea. I will research a little bit more in this platform (ThingSpeak) and let see how I can manage.Juan Pedro", "num_user_post": " 2", "author": "Pulpoensalsa"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/chart-start-daytime/", "posts": [{"date": "July 23, 2015 - 5:23 pm", "content": "The more I use ThingSpeak the more I like it, but I need to be able to select in Chart Options not only the number of data samples but also the chart start day.If you have a month of data and you want to look at only one day it would be really nice (in fact essential) to be able to select the start day. Is this possible?Thanks.", "num_user_post": " 5", "author": "rod"}, {"date": "July 24, 2015 - 8:51 am", "content": "Hi,You can specify the start datetime, for reference please see: https://thingspeak.com/docs/charts .  This isn't available in the chart options, although you can specify it if you open the full URL for the chart, for example: https://thingspeak.com/channels/9/charts/1?start=2015-07-01&end=2015-07-02&average=60 .lee", "num_user_post": " 457", "author": "lee"}, {"date": "July 26, 2015 - 6:53 pm", "content": "Thanks Lee, that works well.For others trying this,  just be sure that the chart is public or use the api key.It would be good if the start/end  day/time could also be added to the chart options with the average value. It would not need to be per field just for the overall channel.If this could be added, being able to go back to a particular day would be very valuable.Thanks", "num_user_post": " 5", "author": "rod"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/disablingdeleting-comments-in-the-public-view-of-a-channel/", "posts": [{"date": "May 19, 2015 - 5:10 am", "content": "I have created a Channel in Thingspeak and made it public. I don't mind others viewing my data however, there is one arsehole (yeah, arsehole is the correct word to use here!) that sabotage this.He left a childish comment there and there is no way I can delete it. And there also isn't a way for me to disable comments.And there isn't a way for me to report arseholes like this!Take a look here and you'll know what I mean.https://thingspeak.com/channels/36852", "num_user_post": " 2", "author": "jinfeei"}, {"date": "May 19, 2015 - 9:00 am", "content": "Hi,Thanks for letting us know about this, we deleted the comment from your channel.  We will investigate a solution for this type of behavior in the future, but if it ever happens again please feel free to email us at support@thingspeak.com .lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/last-n-record-in-a-channel/", "posts": [{"date": "May 19, 2015 - 5:17 am", "content": "I thought this should be obvious, but wouldn't it be essential to have only the last n values in a channel?   (Say, last 100 values...)Or am I using it wrongly?Thanks!", "num_user_post": " 2", "author": "jinfeei"}, {"date": "May 19, 2015 - 8:44 am", "content": "Hi,We choose to store all values that you send to your channel forever, so that you can look back at your historical data and plot or analyze it.  If you just want the last 100 results, you can always use the parameter 'results=100' in your queries:  https://thingspeak.com/docs/channels#get_feed .  For charts and some feed queries, the default is 100 results already.lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/get-multiple-locations-on-map/", "posts": [{"date": "May 4, 2015 - 4:45 am", "content": "Hi,I'm looking to pull all the lat,lng fields of all my channels and plot them on a map. I couldn't find a simple way to do this yet. Is it possible to query all channels for a specific field? This also brings up another problem with API keys per channel, is there a master API key to access all my private channels info without having to enter a READ API KEY for each channel ?Should I run my on server and access db directly? Would that cause any issues?Thanks,Z", "num_user_post": " 3", "author": "zozsoy"}, {"date": "May 4, 2015 - 8:57 am", "content": "Hi,You can request data for all of your channels at once, please see the documentation titled 'List My Channels' at https://thingspeak.com/docs/channels#index (scroll down a little from here).  Yes, there is an account API key which is used to perform this request. You can run your own server too, that wouldn't cause any issues.lee", "num_user_post": " 457", "author": "lee"}, {"date": "May 12, 2015 - 4:57 am", "content": "Thank you for the reply, I see that I'm able to list channels however I have a different use case, I hope you can point me in the right direction:2 issues I see:-I'm looking to get the locations of all the channels at once in a json.What I've seen is I can set location=true PER CHANNEL and lat&long will be included in the response but this is not enough.- Location data is set per feed, If I request location and location was not included in the latest feed update, these fields are blank. Shouldn't location info persist into the channel itself, not just some variable that were sent as part of a feed update?e.g. iot device sends ONLY location in entry_id = 32iot device sends ONLY other info in entry_id = 33...query for channels.json&location=true shows lat&long= nullShould I mess with the DB to persist these values from previous updates into new updates so they are kept across feed updates?ORShould I mess with the controller to go back in DB to get values for lat&long fields?ORBrilliant thingspeak coders can think of a better approach? Thanks,Z", "num_user_post": " 3", "author": "zozsoy"}, {"date": "May 12, 2015 - 6:06 am", "content": "I'll reply to myself not to waste anyone's time  Apparently channel feed and channel itself are already seperated. All I had to do is update the channel's latitude&longitude which persists. NOT send lat&long as a channel feed update.Thanks,", "num_user_post": " 3", "author": "zozsoy"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/digital-chart/", "posts": [{"date": "April 14, 2015 - 11:31 am", "content": "Great software! I have been having fun playing with it.I'd love to see a 'logic' chart, that would plot a single integer value as eight discrete logic channels. This would be very useful for monitoring digital inputs and outputs conveniently.", "num_user_post": " 3", "author": "mikronauts"}, {"date": "April 18, 2015 - 10:05 pm", "content": "You can try to to change a chart to a step chart by using 'step=true'. This is good for representing digital info. Here's an example, using my chart: http://api.thingspeak.com/channels/3/charts/1?results=10&step=true", "num_user_post": " 402", "author": "Hans"}, {"date": "April 19, 2015 - 10:39 am", "content": "Thank you - that is an interesting mode, and I will try it.I was actually hoping for a logic analyzer like view, that would show the low eight bits in a value as separate logic traces.For now, I can create a separate channel, and just use 0 / 1 for each trace, but having a logic display would save bandwidth for the thingspeak servers.Now I just have to figure out why my updates stop sometimes. Time to add more diagnostics to my RPi Python code...Hans said You can try to to change a chart to a step chart by using 'step=true'. This is good for representing digital info. Here's an example, using my chart: http://api.thingspeak.com/channels/3/charts/1?results=10&step=true", "num_user_post": " 3", "author": "mikronauts"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/multi-graph-colors-on-plug-in/", "posts": [{"date": "April 2, 2015 - 8:14 am", "content": "Hi All,Im new here and what a breath of fresh air this site is to me. It would be real nice for the  multi-graph plug in if the colors for each individual graph (series) could be taken from the channel setup, why the need to specify the colors 2's and cause confusion?ThanksRay", "num_user_post": " 11", "author": "rayellam"}, {"date": "April 2, 2015 - 8:40 am", "content": "Hi Ray,The plugins are separate from the channels, so the series colors have to be defined within a plugin.  You can make a plugin for somebody else's channel data, and if you don't own the channel you have to specify the color somewhere, so we chose to make the selection within the plugin.lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/time-service/", "posts": [{"date": "February 13, 2015 - 10:43 pm", "content": "It would be nice to have a time service to synchronise a RTC. NTP and SNTP are not easy to implement.Input: time zoneOutput: date time in ISO8601 format (http://en.wikipedia.org/wiki/ISO_8601)Thanks!", "num_user_post": " 13", "author": "Michel_J"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/server-side-summingaveraging/", "posts": [{"date": "December 30, 2014 - 2:09 am", "content": "Viewing channel data in detail as well as aggregated is a common use of time seried data. The automatic summing and averaging features on the channel feeds are great, but the limit of 8000 underlying data point limit is a real showstopper. With measurements taken at 16 s intervals the aggregated feeds are limited to less than two days.The suggested solution on this forum is to download the data, aggregate them, and upload the data to a new channel. This is of course possible, but requires both programing skills and and an available suitable computer (iPads wont do). The user also har to do this processing on a regular basis (a scheduled job) in order to keep the aggregated channels up to date.It woud therefore be great if this could be done server side. Provide every field in the channel setup with a summing option (checkboxes for hourly and daily, and a sum/average/median/... dropbox). The server could then automatically do the summing/averaging/etc. to a 'hidden channel' at the end of every day/hour. Aggregated request could then get data from this 'hidden channel' instead of real time summing/averaging. This would probably reduce the server overall load.When this option is changed for a field the server could que a job resumming the field to the hidden channel.This would make this great server even greater, and extend the possibilities to do both coarse and detailed graphs on the same data series. Great for both temperature and energy monitoring.", "num_user_post": " 4", "author": "larsilund"}, {"date": "December 30, 2014 - 9:21 am", "content": "Hi Lars,We do some of what you're suggesting on a daily basis already.  For example, if you set a sum/average/median value of 1440 (or daily), we store that data in a separate 'hidden channel' that can then be quickly requested again.  The first time the request is made, the response will be slow since the data has to be calculated, but on subsequent requests of precalculated data the response will be fast.  Here's an example: http://api.thingspeak.com/channels/9/feeds.json?days=10&sum=daily .lee", "num_user_post": " 457", "author": "lee"}, {"date": "December 30, 2014 - 4:26 pm", "content": "Does that mean that the limit of 8000 underlying values do not exist when requests are made for 1440/daily?Can i make requests for daily sums for longer periods?Is there another limit for such feed requsts?To make great applications based on any tool you must know the strengths and limitations of that tool. I would appreciate well documented limitations. A well-documented error return when the limits are exceeded would also be appreciated. Just returning null values does not give many hints for debugging. Lars", "num_user_post": " 4", "author": "larsilund"}, {"date": "December 31, 2014 - 9:09 am", "content": "Hi Lars,Yes the 8000 results limit does not apply for daily feeds if sum/average/median/timescale are used.  You can make requests for as many days as you want; there is no limit for these requests.We will work on improving our documentation and returned errors. lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/send-thinghttp-value-to-a-channel-1/", "posts": [{"date": "November 13, 2014 - 2:40 am", "content": "It would be nice to be able to use a ThingHTTP value to feed a field on a channel.", "num_user_post": " 2", "author": "ezubiria"}, {"date": "November 13, 2014 - 9:05 am", "content": "Hi,We will look into adding this feature, thanks for the suggestion!lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/feature-requests/key-management/", "posts": [{"date": "November 3, 2014 - 7:10 am", "content": "One area in which Thingspeak seems to fall down a bit compared to xively is key management. Say for example I produce a IoT project which I want to produce a small run of. For the device imagine i'm using an arduino with a cheap 16x2lcd shield with 6 buttons If I use thingspeak and talkback that means I need a way of getting a 16 character thingspeak key into the controller and a 16 character talkback key into the controller. I also need to store the channel number for thingspeak and the channel number for talkback.Thats a lot of keys to try and get an end user to enter via an lcd keypad.Ideally it would be nice to have an API which just lets me give each user say an 8 character unique key which when entered can respond with the users unique keys for thingspeak, talkback and both channel numbers.kind of a provisioning API.I've been messing about trying to find a way to do this with the current apps. The best I've got to is:Create a provisioning channel and hard code the key for this channel into the firmwareSend an update from the device to the provisioning channel. something likehttps://api.thingspeak.com/update?api_key=XXXXXXXXXXXXXXXX&field1=PROVISION_SERIAL_NO,3374-3H8Ua react then picks up the PROVISION_SERIAL_NO,3374-3H8Uand triggers a similarly names Thing HTTP.This then places a talkback command with the new keys. something likehttps://api.thingspeak.com/talkbacks/539/commands?api_key=XXXXXXXXXXXXXXXX&command_string=PROVISION_FOR_SERIAL_NO,3374-3H8U,123456,YYYYYYYYYYYYYYYY,567,ZZZZZZZZZZZZZZZZSo the pseudocode for the provisioning on the arduino would beInform user 'Registering with server' Please waitRequest provisiondelay(5000);Request command responsebyte attempts=1;while (requested serial key != recieved serial key){Request provisiondelay 5000Re Request command responseattempts++if(attempts==6){Inform the user 'There is a problem. Please check your Serial number'delay(5000);break;}}if Serial key matches the serial key that was requested{Inform the user 'Controller registered OK'Delay(5000)Write data to eepromsoft reset without delay}Of course the down side of this approach means I need to manually create a react for each unique user and also a thinghttp for each user.Additionally, if anyone is able to get hold of the provisioning channel key, they can then listen for a provision request on the channel and grab the resultant talkback. They then have the keys for my device.Its all a bit messy ", "num_user_post": " 54", "author": "chrisjmears"}, {"date": "November 7, 2014 - 11:32 am", "content": "Hi Chris,Thanks for the suggestions, we will discuss API key management internally and look for ways to improve it in the future.lee", "num_user_post": " 457", "author": "lee"}]}]}