{"url": "https://community.thingspeak.com/forum/general/page-11/", "threads": [{"url": "https://community.thingspeak.com/forum/general/max-number-of-channels-per-account/", "posts": [{"date": "July 25, 2014 - 10:06 am", "content": "Hi.I seem to recall when I first signed up reading there was a maximum number of 99 channels per account? I cant find that documentation now. Whats the maximum number of channels per account please?", "num_user_post": " 54", "author": "chrisjmears"}, {"date": "July 25, 2014 - 10:34 am", "content": "Hi,We don't place any limits on the number of channels per account.lee", "num_user_post": " 457", "author": "lee"}, {"date": "July 28, 2014 - 2:47 am", "content": "So Lee,Whats thingspeak/Io Bridges view on me starting off by using thingspeak for a very small startup business. Probably selling less than a 200 units (200 channels) in total and then as I scale up either moving to using Iobrides proper offering or running my own ThingSpeak server and licencing the talkback app.I'm just fleshing out my business mode. i dont curently have the resource/technical knowledge or the time to run the actual server part of this so it makes sense for me to start using thingspeak for the inital volume and then later move to something more commercial that iobridge has.Please can you help me understand. If I wanted to move say 200 users to either a proper Iobridge solution or a self hosted thingspeak server later. What can IoBridge offer?", "num_user_post": " 54", "author": "chrisjmears"}, {"date": "July 29, 2014 - 5:07 pm", "content": "Hi,I'm not responsible for this aspect of the business, can you please email support@iobridge.com with this question?lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/general/very-sluggish-response-when-logged-in/", "posts": [{"date": "July 15, 2014 - 9:56 am", "content": "Hi, my channel 5384 is extremely slow to response when I am logged in. Even when Im on another tab, for example editing the setting or particularly if I am trying to make changes to the graph settings or even scroll.Is there a reason for this. Other public channels seem fine?", "num_user_post": " 54", "author": "chrisjmears"}, {"date": "July 15, 2014 - 11:14 am", "content": "Hi,You may have too many data points on all of your charts, which can cause your browser to run slowly as lots of RAM and CPU are required for all of that data.  You can try changing your chart settings to use an average function to reduce the number of data points that are displayed.lee", "num_user_post": " 457", "author": "lee"}, {"date": "July 16, 2014 - 7:16 am", "content": "Hi Lee,I have 4 charts on the page. each is pulling 7200 data points. 28,800 doesnt seem like a lot for a modern machine to handle", "num_user_post": " 54", "author": "chrisjmears"}, {"date": "July 16, 2014 - 11:14 am", "content": "Hi,We use HighCharts to draw the charts, and you can test out your browser's ability to load data points by changing some values here: http://www.highcharts.com/studies/performance.php?seriesType=line&markers=on&chartCount=16&seriesPerChart=2&pointsPerSeries=2000&chartWidth=250&libSource=http%3A%2F%2Fcode.highcharts.com%2Fhighcharts.js .  My browser takes 8 seconds to load this data, and the page is very sluggish.  The points on this test page are generated randomly and there is no backend server sending the data, so performance is completely dependent on your browser and computer specs.  I agree that 28,800 data points don't seem like that many, but when each point is rendered via JavaScript and SVG it does unfortunately cause performance to suffer.lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/general/thingspeak-cloud-service-availability/", "posts": [{"date": "July 16, 2014 - 4:20 am", "content": "Hi,I would like to have a response from ThingSpeak to my question:We are planning an internal IoT related hackathon in my company and considering using the cloud-based ThingSpeak platform as the hackathon middleware.We are planning to have up to 1000 concurrent users (in peak) during 24-48 hours period between 8th-9th of September, 2014.I would like to ask if we can have some service availability and/or support commitment from ThingSpeak in order to be sure that when we run our hackathon the platform is up and running or if it is down we can have a support to contact to. If such an SLA commitment is preconditioned, please let me know the terms.Thanks.", "num_user_post": " 1", "author": "micthi"}]}, {"url": "https://community.thingspeak.com/forum/general/ongoing-issue-clearing-channel-feeds/", "posts": [{"date": "July 8, 2014 - 7:49 am", "content": "I had around 330,000 entries in my channel. Of course my remote device was still posting every 15 seconds. The best I can figure, if I go to clear the channel. The process starts but then when my device puts up a new entry the clearing of the channel stops. This means I need to clear many many times to completely clear the channel.Is this a known issue. To my mind, if you go to clear a channel it should ignore any new posts until such times as the channel has cleared?", "num_user_post": " 54", "author": "chrisjmears"}, {"date": "July 8, 2014 - 1:56 pm", "content": "Hi,Sorry about this, we previously had a 10 second timeout  enabled which caused the channel clearing to stop after 10 seconds.  We've since removed this, so channels should clear properly now (the problem wasn't with simultaneous updates to the channel).lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/general/issues-with-dates-on-csv-files/", "posts": [{"date": "May 31, 2014 - 7:18 pm", "content": "Hi,i uploaded a cvs file with about 60 datapoints (3 fileds); the first date is 16 april 14 (16/04/14); however on the graph is show different dates, the first date is shown as 6th jan 14 and the rest of the dates are worng on the graph, however i exported the data and the csv files show the correct dates. Any ideas?thanks,ken", "num_user_post": " 5", "author": "kenkoknz"}, {"date": "June 1, 2014 - 12:14 pm", "content": "Hi Ken,I'll take a look at this issue, can you email the CSV file to: support at iobridge dot com?lee", "num_user_post": " 457", "author": "lee"}, {"date": "June 3, 2014 - 1:08 am", "content": "Hi Lee,Thnks for the response. I have email you the csv file, the public feed is: https://thingspeak.com/channels/12615Cheers,Ken", "num_user_post": " 5", "author": "kenkoknz"}, {"date": "June 4, 2014 - 2:58 am", "content": "Hi Lee,Thanks for the advice, it was the date format that was the problem; Down under, we are used to the dd/mm/yyyy format. I manage to convert the date format using excel to yyyy-mm-dd and it works, even with the - in place of the /, so all good.Excellent support and responsiveness.Cheers,Ken", "num_user_post": " 5", "author": "kenkoknz"}]}, {"url": "https://community.thingspeak.com/forum/general/thingspeak/", "posts": [{"date": "May 20, 2014 - 7:57 am", "content": "hiI am searching for the IOT platform and i come across ThingSpeak. I want to confirm that it is a cloud based service or it provides with platform and also about its channels.ThanksNancy", "num_user_post": " 4", "author": "nancy"}, {"date": "May 20, 2014 - 11:05 am", "content": "Hi Nancy,Yes ThingSpeak is a cloud-based service, and we also have an open source version of ThingSpeak that you can install on your own servers.lee", "num_user_post": " 457", "author": "lee"}, {"date": "May 21, 2014 - 12:32 am", "content": "Hi Lee,Thanks for the reply. And what about its channel and it is only in ruby or is available in JAVA also?Nancy", "num_user_post": " 4", "author": "nancy"}, {"date": "May 21, 2014 - 11:05 am", "content": "If you install the open source version on a server, it is only available in Ruby.  However if you're just trying to connect to ThingSpeak as a client, you can use any programming language that can make HTTP requests.lee", "num_user_post": " 457", "author": "lee"}, {"date": "May 21, 2014 - 11:30 pm", "content": "Thanks Lee for your answer.Nancy", "num_user_post": " 4", "author": "nancy"}]}, {"url": "https://community.thingspeak.com/forum/general/circular-buffer/", "posts": [{"date": "April 29, 2014 - 3:55 pm", "content": "Does thingspeak have a mechanism to limit the total number of rows allowed for a given channel? And could one modify that limit in the Github version? I have been using the Github version locally to allow faster upload rates (1Hz) and I'd like to limit the total number of rows to 1hr at 1hz (or 3600 rows).", "num_user_post": " 5", "author": "hank4stmb"}, {"date": "April 29, 2014 - 4:41 pm", "content": "Hi,Unfortunately we don't provide a mechanism to limit the number of rows per hour.  The open source version could be modified to add this functionality though.lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/general/i-can-not-download-my-data/", "posts": [{"date": "March 12, 2014 - 12:13 pm", "content": "Hi all, I'm a long time user of Thingspeak and everything had worked ok. But now I can not download the data to the one of my channels. I only managed to download a CSV with headers but no data. I need the data field 1 of this channel https://thingspeak.com/channels/7753Someone can help me?Best regards", "num_user_post": " 4", "author": "gepeto"}, {"date": "March 12, 2014 - 2:44 pm", "content": "apparently is my user account.I can not download any of my data channels ", "num_user_post": " 4", "author": "gepeto"}, {"date": "March 12, 2014 - 5:36 pm", "content": "Hi,Your Channel may have too much data to download currently.  We'll fix this issue in the future and let you know when it's ready.lee", "num_user_post": " 457", "author": "lee"}, {"date": "March 13, 2014 - 5:47 pm", "content": "Hi gepeto,This historical graphing and export tool may help you also:http://community.thingspeak.com/forum/announcements/thingspeak-live-chart-multi-channel-second-axis-historical-data-csv-export/", "num_user_post": " 70", "author": "turgo"}, {"date": "March 14, 2014 - 4:17 pm", "content": "turgo said Hi gepeto,This historical graphing and export tool may help you also:http://community.thingspeak.com/forum/announcements/thingspeak-live-chart-multi-channel-second-axis-historical-data-csv-export/turgo, thank you very much for the html. I tried it and I can plot but I can not download the CSV.The page goes blank when try to open http://www.highcharts.com/studies/csv-export/csv.php I think this url is outdated These data are very important to me, I do not think I can do that experiment again   Any suggestion?", "num_user_post": " 4", "author": "gepeto"}, {"date": "March 15, 2014 - 6:30 pm", "content": "Hi gepeto,I tried it with all 1670 points of your data and it worked.  I'd be happy to help further.  Contact me if you would like the HTML graph page, or the data.  Personal Message me on the Arduino forum.  You can click the link to the Arduino forum in my post, and then register on the forum.-Turgo", "num_user_post": " 70", "author": "turgo"}, {"date": "March 17, 2014 - 11:14 am", "content": "turgo said Hi gepeto,I tried it with all 1670 points of your data and it worked.  I'd be happy to help further.  Contact me if you would like the HTML graph page, or the data.  Personal Message me on the Arduino forum.  You can click the link to the Arduino forum in my post, and then register on the forum.-TurgoTurgo Thanks, now I succeeded download all data. Great HTML, very useful", "num_user_post": " 4", "author": "gepeto"}, {"date": "April 1, 2014 - 11:23 pm", "content": "Hi,We just released a new feature that allows you to download all of your Channel data.  To do so, open your Channel in a web browser, click on the 'Data Import / Export' tab, and you should see a button to download your data in CSV format.lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/general/has-the-behaviour-of-median10-changed/", "posts": [{"date": "March 12, 2014 - 6:56 am", "content": "I noticed this last night. I assumed corrupt data so I cleared the channel but same again todayapi.thingspeak.com/channels/5384/feed.csv?&days=1&median=10gives the result:created_atfield1field2field3field4field5field6field7field82014-03-12 10:20:00 UTC260012014-03-12 10:30:00 UTC260002014-03-12 10:40:00 UTC260002014-03-12 10:50:00 UTC26000i.e field 1 & 2 which contain temperature data are blankbut when I do api.thingspeak.com/channels/5384/feed.csv?&days=1I getcreated_atentry_idfield1field2field3field4field5field6field7field82014-03-12 10:22:49 UTC13.54.52560010.0/0.0/28.0/40.0/       570/1/v2.0rc322014-03-12 10:23:01 UTC23.54.52560000.0/0.0/28.0/40.0/       600/1/v2.0rc322014-03-12 10:23:13 UTC33.54.52560000.0/0.0/28.0/40.0/       600/1/v2.0rc322014-03-12 10:23:25 UTC444.52560000.0/0.0/28.0/40.0/       600/1/v2.0rc322014-03-12 10:23:37 UTC53.54.52560000.0/0.0/28.0/40.0/       600/1/v2.0rc322014-03-12 10:23:49 UTC63.54.52560000.0/0.0/28.0/40.0/       600/1/v2.0rc322014-03-12 10:24:01 UTC73.54.52560000.0/0.0/28.0/40.0/       600/1/v2.0rc322014-03-12 10:24:13 UTC844.52560000.0/0.0/28.0/40.0/       600/1/v2.0rc322014-03-12 10:24:25 UTC944.52560000.0/0.0/28.0/40.0/       600/1/v2.0rc322014-03-12 10:24:37 UTC1044.52560000.0/0.0/28.0/40.0/       600/1/v2.0rc322014-03-12 10:24:49 UTC1144.52560000.0/0.0/28.0/40.0/       600/1/v2.0rc322014-03-12 10:25:01 UTC12452560010.0/0.0/28.0/40.0/       600/1/v2.0rc322014-03-12 10:25:13 UTC1344.52560010.0/0.0/28.0/40.0/       600/1/v2.0rc32So there is data in field 1 and field 2. its just not being averaged!", "num_user_post": " 54", "author": "chrisjmears"}, {"date": "March 12, 2014 - 5:46 pm", "content": "Hi,Some of your feed entries have spaces before the numerical values, which is causing our system to interpret your data as strings rather than numbers.  Please try changing your Channel updates so that they send '8.5' rather than ' 8.5', for example.lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/general/about-thingspeak/", "posts": [{"date": "February 14, 2014 - 4:11 am", "content": "Hi all,We are currently working in a project related with physiological signal based on human emotion recognition in which we need to store large amount of information from multiple sensors.We are looking for a Cloud Platform to store our data sensor and Thingspeak could be a possibility. We would like to resolve some doubts:1)If we use the online thingspeak cloud,  is there any limitation on storage capacity or data processing?2) About uploading data, could we create unlimited channels?3) Could we upload data from multiple channels simultaneously?4) In general, Is there any limitation on uploading or downloading data?5)  If I start using thingspeak normally and then would like to migrate to open source API and have my own server. Is there a way to get all my data?Thank you in advanceLucia", "num_user_post": " 4", "author": "luhues"}, {"date": "February 14, 2014 - 10:15 am", "content": "Hi Lucia,Here are the answers to your questions:1)If we use the online thingspeak cloud, is there any limitation on storage capacity or data processing? No.2) About uploading data, could we create unlimited channels? Yes.3) Could we upload data from multiple channels simultaneously? Yes (via separate HTTP requests).4) In general, Is there any limitation on uploading or downloading data? There is a rate limit of one update per Channel every 15 seconds.5) If I start using thingspeak normally and then would like to migrate to open source API and have my own server. Is there a way to get all my data? Yes, you can download the data as CSV and then import it to your own server.lee", "num_user_post": " 457", "author": "lee"}, {"date": "February 15, 2014 - 1:18 am", "content": "Lee's reply above is the official word, but I have some observations about accessing historical data:If you have a year long data set of 15 second averages, its about two million points.  You can only retrieve 8000 at a time.  When you do repeated requests for 8000 points, ThingSpeak delays the response.  It typically is about a minute and a half.  To download a years worth of data this way would take 6.5 hours, although partway in, I usually run into some error that does not let me continue.  I have created a web page that loads and graphs historical ThingSpeak data, so you can try this out for yourself, and see how ThingSpeak serves the data:http://community.thingspeak.com/forum/announcements/thingspeak-live-chart-multi-channel-second-axis-historical-data-csv-export/I like ThingSpeak.  There are practicalities to consider with large data sets.", "num_user_post": " 70", "author": "turgo"}, {"date": "February 17, 2014 - 5:39 am", "content": "Thanks a lot for your prompt reply, lee and turgoThinkspeak is a good option for my project. I'm going to try how ThingSpeak serves the dataThank,Lucía", "num_user_post": " 4", "author": "luhues"}, {"date": "March 4, 2014 - 4:14 am", "content": "Hi all,I have a new question: If we install Thingspeak in our own server,  would we have the rate limit of one update per Channel every 15 seconds?Thank you in advance,Lucía", "num_user_post": " 4", "author": "luhues"}, {"date": "March 4, 2014 - 11:28 am", "content": "Hi,If you use the open source version of ThingSpeak the rate limit is off by default, but can easily be changed here: https://github.com/iobridge/thingspeak/blob/master/config/initializers/constants.rb#L6 .lee", "num_user_post": " 457", "author": "lee"}, {"date": "March 6, 2014 - 6:32 am", "content": "Thanks a lot, lee Lucía", "num_user_post": " 4", "author": "luhues"}]}, {"url": "https://community.thingspeak.com/forum/general/strange-number-format-in-my-csv-file/", "posts": [{"date": "February 5, 2014 - 1:17 am", "content": "Hi All,Wasn't sure if anybody else had seen this...Am getting a strange 'double decimal' in my csv dumps from thingspeak. Looks like it's mixing up data across the fields.  Here's what I get when i dump csv from field3:created_atentry_idfield32014-02-05 04:02:40 UTC3200250464.0369.002014-02-05 04:03:40 UTC32003113284.369.002014-02-05 04:04:40 UTC3200480743.0369.002014-02-05 04:05:40 UTC3200520545.0369.002014-02-05 04:06:40 UTC32006177545.369.002014-02-05 04:07:40 UTC32007110674.369.00Notice the double decimal in field 3.  Any ideas what could be going wrong?All the other fields format correctly.Cheers,Andrew", "num_user_post": " 6", "author": "acarre"}, {"date": "February 5, 2014 - 1:05 pm", "content": "Hi Andrew,I'll take a look at this, what channel number is this data for?  lee", "num_user_post": " 457", "author": "lee"}, {"date": "February 5, 2014 - 11:23 pm", "content": "Hi Lee,It was channel 9585, but I've fixed it. It wasn't Thingspeak at all, but rather the data I was posting to it. I was posting from an Arduino a floating point number. Unfortunately I had done a bodgy job of converting it from an integer causing a strange memory overflow (multiple decimals) . A silly mistake, but all good now.Cheers,Andrew", "num_user_post": " 6", "author": "acarre"}]}, {"url": "https://community.thingspeak.com/forum/general/help-crossdomain-xml-do-i-need-to-understand-it/", "posts": [{"date": "June 26, 2013 - 10:07 am", "content": "Hi,I have no idea about these things. I notice that you give a link to your crossdomain.xml fileI understand this instructs the browser that its ok to load files from their domain.I plan to let my processing.js sketch load the csv data like thisloadstrings('api.thingspeak.com/blah blah blah')But will it work.Do I need to do anything special with the http://api.thingspeak.com/crossdomain.xml link provided", "num_user_post": " 54", "author": "chrisjmears"}, {"date": "June 26, 2013 - 2:20 pm", "content": "We added the crossdomain.xml link for Flash apps. I am pretty sure if you make an HTTP call via Flash it will check that file. I do not think Processing uses it, but I could be wrong.Let us know how it works for you.Thanks,Hans", "num_user_post": " 402", "author": "Hans"}]}]}