{"url": "https://community.thingspeak.com/forum/general/page-5/", "threads": [{"url": "https://community.thingspeak.com/forum/general/all-my-data-and-channels-disappeared-after-paying-for-service/", "posts": [{"date": "February 10, 2017 - 10:11 pm", "content": "I had a working thingspeak free account that has been collecting data.Today I upgraded to the 'home' account for two devices/channels. After creating the account on Mathworks, it successfully linked the two accounts, and on thingspeak I could see I had 66M messages/yr. I was also successful in uploading data every 2 seconds. After running it for several minutes, I was able to download data as a CSV and verify it was storing the data as expected. Good so far...Two hours later, I log into thingspeak, and it says I have a free account with only 3M message/year, all my data is gone, all my channels and fields are gone. It's like a blank account! Has anyone else actually paid for this service? Has it been reliable at all? Is there any chance of getting my data back, or is this thingspeak kind of hobbyist/student play toy, and not for serious IoT data collection?", "num_user_post": " 3", "author": "kf6bbl"}, {"date": "February 10, 2017 - 11:07 pm", "content": "We received your support email as well. You most likely have two accounts. Make sure that you use your email address to sign in instead of the username. I will follow up with you directly. ", "num_user_post": " 402", "author": "Hans"}, {"date": "February 11, 2017 - 2:10 am", "content": "SOLVED. thanks", "num_user_post": " 3", "author": "kf6bbl"}]}, {"url": "https://community.thingspeak.com/forum/general/cant-login/", "posts": [{"date": "December 20, 2016 - 10:06 am", "content": "I've suddenly started receiving 'incorrect username or password' when trying to log in with my correct password and when I try to send a recovery email to my address it says there is no account associated with it.My public channels still work and my devices are still sending data ", "num_user_post": " 1", "author": "rich"}, {"date": "December 20, 2016 - 10:35 am", "content": "Please log in with the email address used to create your account and your ThingSpeak password. If you don't remember your email ID, please contact us with a channel number and user ID.", "num_user_post": " 225", "author": "Vinod"}, {"date": "December 21, 2016 - 10:58 am", "content": "As Vinod suggested, try the email address for your user account. This will help you log into ThingSpeak. Rest assured that no data has been lost. If you need to find your email address, please contact support at ThingSpeak.", "num_user_post": " 402", "author": "Hans"}, {"date": "January 19, 2017 - 12:50 am", "content": " Hello,I have same problem, I can't log in to my account. I can see my public account, I use correct password, and can't reset using 'Forgot your password?' link. Can you help me?My public channel is https://thingspeak.com/channels/110909Profile link: https://thingspeak.com/users/ntsc443User name: ntsc443Thank you", "num_user_post": " 1", "author": "ntsc443"}, {"date": "January 19, 2017 - 10:13 am", "content": "It appears the email address used to create the account had a typo and the forgot password emails were bouncing. I have requested the team to correct the typo. Please try again and see if you get the email to your account.", "num_user_post": " 225", "author": "Vinod"}, {"date": "February 2, 2017 - 8:15 pm", "content": "I last used my Thingspeak account in September 2016. Today when I tried logging in it says invalid username and password. My username is roboboom. Has the free account I created deleted by Thingspeak ?", "num_user_post": " 1", "author": "roboboom"}, {"date": "February 2, 2017 - 8:58 pm", "content": "You still have an account. Do you know the email address of the account? That is what is required to log into ThingSpeak now. If you do not know the email address, send us a message to support[at]thingspeak.com and we will help you out. Everything about your account is intact.", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/general/multiple-charts-for-one-field/", "posts": [{"date": "January 22, 2017 - 8:35 am", "content": "I'm sending power values to field 1 of a channel, and I would like to show multiple charts for that field with different time scales, and also to show the average over a day to show power consumption without having to manually edit the chart each time, but now I can only create a single chart for field 1.I workaround might be to create more fields with the same value, but there must be a better way... Thanks.", "num_user_post": " 1", "author": "cnxsoft"}]}, {"url": "https://community.thingspeak.com/forum/general/sunset-related-terms-of-usage/", "posts": [{"date": "January 9, 2017 - 2:05 am", "content": "Is it possible to get a confirmation that the secured communication on port 443 for upload & download of data by commercially deployed devices will be guaranteed for 5-10 years, to avoid recall of devices. If not, is there a way to do Firmware upgrade Over the Air e.g. for ESP8266 based devices using the Thingspeak cloud service?", "num_user_post": " 1", "author": "rishimohindra"}, {"date": "January 9, 2017 - 4:46 pm", "content": "ThingSpeak does not currently provide a feature to allow updating custom firmware on your devices. Typically the device vendors create the device update solution as they want to be in control of the device firmware and the distribution of the firmware. Third-party solutions exist that provide this functionality.  Regarding your service guarantee question please feel free to contact sales directly by completing the Contact Us form at https://thingspeak.com/prices", "num_user_post": " 225", "author": "Vinod"}]}, {"url": "https://community.thingspeak.com/forum/general/recent-changes/", "posts": [{"date": "December 21, 2016 - 3:44 am", "content": "You may have noticed that MathWorks modified the account system (breaking most functionality in the progress) and introduced api limits.This is a sign to move somewhere else, because MathWorks won't stop until ThingSpeak generates revenue. And it TG can't generate revenue they will shut it down. So whatever the outcome, you lose.", "num_user_post": " 2", "author": "mnt"}, {"date": "December 21, 2016 - 10:56 am", "content": "Thanks for your post. We have definitely made changes in response to many user requests for commercial licenses for ThingSpeak. We also added MQTT as a way to send data to ThingSpeak. Some users had issues with the new sign in process. The main change is that we require everyone to sign in with an email address instead of a username. Make sure that you are signing in with your email address. No data is lost. No functionality has been removed. I can work with you over email to make sure your account is intact.The fact that ThingSpeak is one of the longest lived IoT services out there (6+ years) speaks to our commitment to the people in the ThingSpeak community.  One of the reasons for adding the paid option was that we receive multiple emails a day requesting commercial use, and questions about the longevity of the service without a viable economic model.  The paid options provide that to those people.  We didn’t pick the limits on the free account level at random:  We looked at usage patterns, and selected limits that would allow more than 99% of current users to continue with the free option.", "num_user_post": " 402", "author": "Hans"}, {"date": "December 21, 2016 - 12:41 pm", "content": "I have used Thingspeak for over three years and have found the many apps, especially the original ThingHttp, React and Plugins to be very useful and  easy to use and a great addition to the platform. For example, I can control ZigBee Xbee's from ThingHttp using a script in the body and can copy and paste and just change radio and gateway IDs in the script for multiple Xbee's / gateways.I now also use MATLAB visualizations that are now included with TS since MathWorks took over. These are great for filling in missing data, moving to new channels and removing spurious data. Wind Velocity compass plot,Most other IoT platforms either have complex setups and then charge for additional functionality and do not have the easy to use Apps that are already incorporated into TS.Unlike mnt's post above, I have found no change or break in functionality and wonder what he is referring to????Yes, the new login makes you use an e-mail address but that was all that changed for me.If transmitting 85 fields every 15 minutes or 170 fields every 30 mins is not enough for personal use, then you may be doing it wrong!.. using an API to check a channel status does not count towards the limits, as I understand it... just the API writing to a channel field.I have not had time to utilize the trial MATLAB toolboxes and great things like the 'neural network learning' but see these as a great add on even if they cost.A lot of other IoT sites charge for basic services and then have different levels of service and apps which are charged for in addition.I believe that ThingSpeak is a GREAT tool and service even if the API levels have been reduced for a personal account...It still gives you the ability to perform multiple tasks and data manipulation and to test out various sensors and systems - for free.If you are prototyping a system to use commercially and require control, easy to use integrated Apps and Plugins then ThingSpeak with the new MathWorks functions is a great platform to use.When you need to launch your products/systems commercially, you have everything ready and just need to upgrade to a paid account. The Paid account gives the added benefits of over 10 times the number of write requests and the ability to write every second rather than 15 seconds like the free account. For the price and the functions available and upgraded functionality it is well worth it!ThingsSpeak is a great service - Thank You MathWorks!", "num_user_post": " 1", "author": "Songman999"}, {"date": "December 30, 2016 - 12:38 pm", "content": "I have to agree with Songman999. My company has been using Thingspeak for about a year now to manage data collection for devices installed across the continental US. It has been a great tool to develop with and it was amazing that it was a free service for so long. It is reasonable to charge for the maintenance and development of the platform.Mnt, what functionality have you seen reduced, removed, or broken? If anything, the transition to a paid service has been less complicated than I expected. The purchasing of the appropriate number of licenses is simple and has worked well because it is built into the MathWorks' License Center.ThingSpeak has been and I expect will continue to be a great platform for developing data collection hardware systems and it's integration with MATLAB make it solid choice for then analyzing that collected data.It seems to me that Hans has addressed any legitimate concerns. The fact that 99% of users are producing data to the platform at low enough a rate that they continue to have a free option is a great.", "num_user_post": " 1", "author": "jhkWaltham"}, {"date": "January 3, 2017 - 5:49 am", "content": "I have found no change or break in functionalityI could not login and there is no mention that you have to use your email now anywhere. Fail. Next tried to recover my password, the recoverylink on the TS website leads to a MW-account-only recovery option. Fail. I found out about the changed login via google, and only because i found a forum posts here that complained about this exact thing.questions about the longevity of the service without a viable economic modelIf you want to build a viable business with managable risk you have to get pricing feedback from your customers from day one and not after you got a metric ton of users that are used to freemium.", "num_user_post": " 2", "author": "mnt"}]}, {"url": "https://community.thingspeak.com/forum/general/thingspeak-com-terms-of-use-question/", "posts": [{"date": "September 25, 2016 - 8:25 am", "content": "Hello I have a question about the terms of use, If I develop a product like a datalogger and I add a feature to log the data to thingspeak I'm I able to sell this product? If this isn't the case, can I sell the hardware closed source and the software open source? Thanks in advance!", "num_user_post": " 1", "author": "littleboot"}, {"date": "December 22, 2016 - 11:11 am", "content": "Hello and thank you for contacting us.  Selling data loggers that send data to ThingSpeak is definitely your choice along with the decision to use open or closed source.  Our terms require that the account used by each data logger has the appropriate license option and that depends on the use of each logger.For more specific help please feel free to complete the Contact Us form on our how to buy page so that someone can help you directly.", "num_user_post": " 4", "author": "Robert Mawrey"}]}, {"url": "https://community.thingspeak.com/forum/general/finding-total-messages-stored/", "posts": [{"date": "December 11, 2016 - 12:40 am", "content": "Is there going to be a way to monitor the total number of points being stored?  Currently the account usage only contains number of new messages being added..    I guess you can figure it out by fetching the last record number of each channel but a summary figure would be nice..", "num_user_post": " 271", "author": "rw950431"}, {"date": "December 21, 2016 - 11:00 am", "content": "Thanks for the suggestion. We will keep this in mind for future releases.", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/general/getting-channel-values-from-api/", "posts": [{"date": "December 2, 2016 - 11:51 am", "content": "Hi,  Id like a Linux box to get the last posted value of my channel on demand.  I understand I can get a range of values from here from apieg http://api.thingspeak.com/channels/9/feeds.csv?start=2011-11-11%2010:10:10&end=2011-11-11%2011:11:11I wish  to get the last value from a Linux box eg wget ...  What are my option from the api?  thanks in advance", "num_user_post": " 4", "author": "wizbrewery"}, {"date": "December 3, 2016 - 10:23 pm", "content": "http://api.thingspeak.com/channels/9/feeds.csv?results=1 For variants see https://au.mathworks.com/help/thingspeak/get-a-channel-feed.html", "num_user_post": " 271", "author": "rw950431"}]}, {"url": "https://community.thingspeak.com/forum/general/not-updating-the-chart-on-thingspeak-channel/", "posts": [{"date": "November 23, 2016 - 4:11 am", "content": "Hi,Every thing was working then yesterday the chart does not get updated. The channel stats shows that data is updated but the chart does not update. public channel: https://thingspeak.com/channels/91156Advice appreciatedThanksKen", "num_user_post": " 5", "author": "kenkoknz"}, {"date": "November 23, 2016 - 1:00 pm", "content": "Hi Ken, On checking the data in the channel: https://thingspeak.com/channels/91156/feeds.json?results=10I found that 2016-11-21 20:09:33 (EST) was the last valid data point. All data points after that are null values. Could you check your device (or data source) to find the cause of the null values?Charts only display non null numeric values. Since all values after 20:09:33 (EST) are null values, the chart is not displaying the latest data.", "num_user_post": " 62", "author": "Adarsh_Murthy"}, {"date": "November 25, 2016 - 3:05 pm", "content": "Hi, thks for your explaination, i use node red to send the data using thingspeak node. It was working no problems before and i did not changed anything. From your suggestion It would seems that the payload is not sent, but it does send null, strange as i did not alter anything.", "num_user_post": " 5", "author": "kenkoknz"}]}, {"url": "https://community.thingspeak.com/forum/general/thingspeak-timestamp-in-milliseconds-possible/", "posts": [{"date": "November 17, 2016 - 6:54 am", "content": "Hey! I was wondering if it is possible to get the exact timestamp of data being created.Now the datimeformat is restricted to seconds, but it would be interesting to get the millisecond or even microsecond data of an entry being created.Is there any way to change the datetime settings to a more precise one? Thank you!", "num_user_post": " 3", "author": "wasted"}]}, {"url": "https://community.thingspeak.com/forum/general/why-disconnection/", "posts": [{"date": "October 23, 2016 - 5:09 am", "content": "hi everbodyit is about 2 weeks I can not upload data to my channel, 122500.is there any problem with the thingspeak server?thanks in advance", "num_user_post": " 1", "author": "abdolhamednik"}, {"date": "October 23, 2016 - 10:12 pm", "content": "There are no known issues with the ThingSpeak server at this time. Are you sure you are using the right API keys for writing to the ThingSpeak channel?Are you sure your devices are functioning correctly and they have internet connectivity?Can you create a new channel from a computer on the same network as the device and try to write to it following the instructions on the right side of the page here:https://thingspeak.com/channels/CHANNEL_NUM/import_export", "num_user_post": " 225", "author": "Vinod"}]}, {"url": "https://community.thingspeak.com/forum/general/pull-data-from-arduino-datalogger-sd-and-write-to-thingspeak/", "posts": [{"date": "October 21, 2016 - 6:32 pm", "content": "I've been reading a number of similar posts, but I don't think they articulate my particular question.I want to log 5 fields once per second.  That would obviously exceed the once per 15 second rule.  Is the intention to limit the amount of API calls to Thingspeak, or to limit the total data?  I would like to write once per second to my SD datalogger and then send a burst of 5 x 15= 75 datapoints at a time.  Each would have an RTC logged as well.I am also concerned that if I have a loss of connectivity that my data continues to record.  A 8Gb SD card will handle enough data for several months.  Say I lose connectivity for a few days until I can get to the remote site.  Will ThingSpeak allow me to 'catch up' and do a data dump when my remote datalogger finally gets back online? Thanks.", "num_user_post": " 2", "author": "Wayne"}, {"date": "October 22, 2016 - 12:02 pm", "content": "Writing to your SD card and then uploading all 5 fields 75 datapoints at a time should work. If you can store data on your SD card in CSV format you can always import the data into a channel to backfill the data for the period your device has lost connectivity.", "num_user_post": " 225", "author": "Vinod"}]}]}