{"url": "https://community.thingspeak.com/forum/general/page-2/", "threads": [{"url": "https://community.thingspeak.com/forum/general/powersupply-with-long-wire-gives-problems/", "posts": [{"date": "April 28, 2018 - 1:33 pm", "content": "Hi,I have a 5 volt powersupply (2,5 A) and I have connected a long wire (+/- 4 meters) to the 5V side.Then I reduce the 5V to 3.3V with a Lm1117 and connected the esp8266 to it with the 3.3V.Without the 4 meters wire between the powersupply and the LM1777 everything works fine.But as soon I extende the distance to the powersupply with the 4 meter (speaker)wire the ESP8266 doen's work nanymore or not reliable (sometime I can ping it).I also tried to add capacitors to the esp8266 between ground en 3.3v. I tried 1uf,  10uf en a 100uf electrolyt all the same time.It improved a litte bit but still a lot of troubble.I don't understand why the 4 meter of wire is a problem and how i can solve it.Thanks in advance", "num_user_post": " 2", "author": "fiets"}, {"date": "April 29, 2018 - 2:19 am", "content": "Its possible the wire is not thick enough to carry the current needed to power the ESP8266.   Are you able to measure the voltage that arrives at the LM1117?   I'm guessing that it will well below 5V.You could try some thicker cable, like the sort they use in car lights.", "num_user_post": " 271", "author": "rw950431"}, {"date": "April 29, 2018 - 9:12 am", "content": "Its speaker cable, I think 2,5 mm thick and only 4 meters. So that should be enough.And yes the voltage on the in-side of the lm1117 is above 5V and on the out-side its 3,3 v. So thats looks good.Also I have tried serveral powersupply's but with all of them the same problem.I was thinking of picking up noice so thats why I added the capacitors.", "num_user_post": " 2", "author": "fiets"}, {"date": "May 1, 2018 - 12:22 am", "content": "Its possible that the voltage is high enough when the device is listening but drops below minimum when it transmits. Were you able to observe the voltage when you are pinging it, for example?", "num_user_post": " 271", "author": "rw950431"}]}, {"url": "https://community.thingspeak.com/forum/general/matlab-analysis-and-data-inserts/", "posts": [{"date": "March 16, 2018 - 9:16 am", "content": "Can running analysis script access data that was inserted by an outside source after the script was started?If yes, then how to tell this script that it should ignore it, because another script instance will process this new data insert?", "num_user_post": " 27", "author": "heh"}, {"date": "March 20, 2018 - 2:57 pm", "content": "So, the analysis script is going to run up to 20seconds for free accounts and 60sec for commercial accounts. If you your first line is a thingSpeakRead, you will only get data that is in the channel at that moment. If you do another read at the end of the time, you may get new data in the channel.What are you looking to do?", "num_user_post": " 402", "author": "Hans"}, {"date": "April 11, 2018 - 1:15 am", "content": "As I thought, your idea of using Matlab Analysis did not work for batch inserts. And likely won't work for individual record inserts either.In my case, the script is triggered on each batch insert, but it runs with random delays. Sometimes it could be minutes between actual runs and then it may execute several run instances at the same time.Because there is no reliable way to determine what recordset each such instance has to process, it often processes same data batch several times or misses to process a number of consecutive data batches.I am trying to run data analysis and push alerts to external relay server. Matlab Analysis seems useless for this purpose, because there is no way to implement incremental processing of data. The script often misses some datapoints or throws a bunch of duplicates, and either is not good.", "num_user_post": " 27", "author": "heh"}, {"date": "April 16, 2018 - 7:50 pm", "content": "Hello, ThingSpeak development & support.Did my previous post make any sense to you?Are there any plans to resolve the issue?Waiting for your reply ...Regards", "num_user_post": " 27", "author": "heh"}, {"date": "April 17, 2018 - 10:54 am", "content": "I would recommend having two channels: one that contains the raw data and one that will contain the processed data.In your MATLAB analytics code, I will start by reading data from the processed data channel and get the last time stamp (if there is one). I would use that time stamp in a second thingSpeakRead in your analysis to get data from the raw channel. Use a a DateRange of Now to the last time stamped processed.This technique should help greatly in getting consistent analysis and avoid analyzing duplicate data.", "num_user_post": " 402", "author": "Hans"}, {"date": "April 17, 2018 - 3:56 pm", "content": "Thank you - I thought of a similar approach too,but in order to implement this solution correctlyI need more information about your ThingSpeakserver concurrency model.Are analysis jobs run sequentially or they arecompletely asynchronous and run in parallel?Thanks", "num_user_post": " 27", "author": "heh"}, {"date": "April 17, 2018 - 11:07 pm", "content": "Depending on a number of factors that include your data collection rate, the conditions that trigger the MATLAB Analysis job to run (if it is set up to be run by a React app) , and the length of time your MATLAB code takes to execute, among other factors, can result in your analysis jobs running in parallel.The approach I would recommend that works best is for the raw data to be logged to a certain channel, and a TimeControl be used to schedule a MATLAB analysis job that runs at a frequency of once every 60 minutes. This Analysis reads the data from the 'raw data' channel from the time the last datapoint data was written to the 'derived data' channel until 'now' and writes the processed data to the derived channel. If the processing takes >20s per evaluation (total time), you may need to purchase a Standard license that allows your code a window of 60s to complete execution.I don't see why this needs any knowledge of the internals of ThingSpeak. I also would argue that any solution that requires this knowledge is brittle.PS: Technical Support is just one of the benefits of purchasing a ThingSpeak license. If you need assistance on demand, I would strongly urge you to purchase a license.", "num_user_post": " 225", "author": "Vinod"}, {"date": "April 18, 2018 - 11:36 am", "content": "VinodI still think of whether I want to use ThingSpeak and buy a license. It has too many issues and I would not care about ThingSpeak internals if it worked reasonably well.Unfortunately, ThingSpeak lacks many basic features and in its current state it is more a toy than a tool. Using it for anything useful requires odd tricks like creating separate channels for data processing history, or tagging data records and so on.Please, consider my questions as a guide to what your framework needs in order to be attractive to potential users. In some sense it is me, who is helping you to make it a successful commercial product.Back to my previous question - could you give me a straight answer about concurrency?", "num_user_post": " 27", "author": "heh"}, {"date": "April 19, 2018 - 5:29 pm", "content": "Heh,We have a very large number of users for whom ThingSpeak works really well and who appreciate the features of the service. Many of our users pay for the features the ThingSpeak platform provides, so we must be doing something right 😉 We are also always open to constructive feedback on how we can improve the service and add features that will benefit our user community. Many of our users use this forum to do exactly that. But, all of that is unrelated to your question. The answer to your question '...straight answer about concurrency' is 'it depends'. As I mentioned in my previous response, depending on a number of factors that include data ingestion rate, the conditions that trigger the MATLAB Analysis job, the length of time your MATLAB code takes to execute, among other things, two executions of your code could run concurrently. That doesn't mean it always does so. If your MATLAB code was written assuming it could be executed concurrently and your algorithm is robust to this, you should be fine.By the way, I would not consider having a channel for raw data and another channel for processed data to be an odd trick. I recommend this to users so that they can always go back to the raw data and apply a different processing algorithm to get different insights into it.Hope this helps,-Vinod", "num_user_post": " 225", "author": "Vinod"}, {"date": "April 20, 2018 - 12:15 pm", "content": "Thank you for response, Vinod.Here is a fresh example of something requiring odd tricks(encounter these issues every day):- HTTP API does not allow to specify range of dates to read.- Matlab Analysis API call thingSpeakRead(), allows reading data in a DateRange, but does not return Status field value.I understand that I can run these 2 requests and merge responses,Or request 8000 point and throw away part (most) of the response I do not need.Wouldn't that be odd, though?How do you read status within a date range without jumping  through these hoops?Why don't you, for example, offer some way of reading a range of feed IDs?Regards", "num_user_post": " 27", "author": "heh"}, {"date": "April 20, 2018 - 12:30 pm", "content": ">>  HTTP API does not allow to specify range of dates to read.Actually, it does. See documentation here: https://www.mathworks.com/help/thingspeak/readdata.html If you wanted JSON data for the first 15 days of this month, the GET request would be like this:https://api.thingspeak.com/channels/9/feeds.json?start=2018-04-01&end=2018-04-15Note that if you specify a large date range, the result is limited to 8000 points, as documented on the page.>> Matlab Analysis API call thingSpeakRead(), allows reading data in a DateRange, but does not return Status field value.This is an item we have on our backlog of features to implement.>> How do you read status within a date range without jumping through these hoops?https://api.thingspeak.com/channels/9/status.json?start=2018-04-01&end=2018-04-15>> Why don't you, for example, offer some way of reading a range of feed IDs?We believe feed entry IDs are not something the end user should have to care about. Time series data, which is what the data stored on ThingSpeak is, should be queryable/addressable by date range as the above example demonstrates. The thingSpeakRead() function in MATLAB does what is needed to get data and stitch it together so a user doesn't have to worry about the 8000 point limitation. Hope this helps you on your project. If there is something that isn't working as you expect, please do post your code/what you have tried and someone on the community will look at it and offer suggestions sooner or later.", "num_user_post": " 225", "author": "Vinod"}, {"date": "April 20, 2018 - 5:41 pm", "content": "You may be able to read data and status at the same time.The read data API also has a status parameter:https://api.thingspeak.com/channels/472367/feeds.json?start=2018-04-01&end=2018-04-15&status=true", "num_user_post": " 401", "author": "cstapels"}, {"date": "April 23, 2018 - 6:13 pm", "content": ">> We believe feed entry IDs are not something the end user should have to care about.On the contrary, it could be useful if feed IDs that triggered React were passed to Analysis script that this React invoked.Of course, then users would need some way to retrieve feeds by these IDs.>> DateRange mapped to start / endThank you for pointing this out.I was looking for DateRange and overlooked start / end having similar purpose.Regards", "num_user_post": " 27", "author": "heh"}]}, {"url": "https://community.thingspeak.com/forum/general/can-no-longer-login-to-thingspeak/", "posts": [{"date": "April 17, 2018 - 10:51 am", "content": "After entering my email and password I am now greeted with a blank screen with only a circular arrow icon near the bottom. I can’t get to my channels anymore. I know my password is correct because if I type another one it tells me invalid password. I’ve tried it on both Safari and Chrome on my iPhone. No VPN. Thanks ", "num_user_post": " 2", "author": "bsartist"}, {"date": "April 17, 2018 - 4:18 pm", "content": "Update:I tried on my Mac desktop. I had the same problem with Safari that I had on the iPhone. I brought up Chrome. This time I got a pop up asking me to accept terms or something. Seemed to be one of those one time accept things. I accepted it. Now I can log in on my phone as well as on the desktop. I did have to restart safari on the desktop, however, to get it to work after I had accepted the pop up I Chrome.", "num_user_post": " 2", "author": "bsartist"}]}, {"url": "https://community.thingspeak.com/forum/general/sign-in-has-changed/", "posts": [{"date": "November 28, 2017 - 5:31 am", "content": "I find it quite annoying, that it is not possible to sign in automatically anymore. Recently one will need too type in email account and password every time. Is there a way around this? p.s. I am using Google Chrome.", "num_user_post": " 4", "author": "Bovbjerg"}, {"date": "November 28, 2017 - 8:34 am", "content": "It should be possible to use Chrome's autofill feature so you don't have to type email and password.When you are on the 'Sign In' page, double click your mouse in the email address field and it should give you a list of emails that you have used to pick from. On the next page, similarly double click in the 'password' field and you should get a dropdown that will enable you to autofill your saved password.Note that you will need to have enabled Chrome's autofill feature and saved the password (or choose to save the password when prompted) for this to work.", "num_user_post": " 225", "author": "Vinod"}, {"date": "December 6, 2017 - 3:45 am", "content": "I have enabled Chrome's autofill feature, but it does not work at the email adress field, only in the password field. You have to type in your email at every sign in, which is quite annoying, specially on my Iphone. In the earlier Sign in Pages you could sign in nealy automatically. This is in my view a backstep in userfriendlines.", "num_user_post": " 4", "author": "Bovbjerg"}, {"date": "December 6, 2017 - 11:35 am", "content": "On my Nexus 5x with Android 8.0.0, the moment I click in the email address field it gives me an option to select any of the different email addresses I have ever typed into the field.I will try this with Chrome on an iPhone. Can you provide me more details - version of Chrome and version of iOS - so I can try your scenario? ", "num_user_post": " 225", "author": "Vinod"}, {"date": "December 7, 2017 - 11:53 am", "content": "I was able to reproduce this on iOS and MacOS. It appears that Chrome behaves differently on these platforms. We will put in a fix for this issue. ", "num_user_post": " 225", "author": "Vinod"}, {"date": "December 8, 2017 - 5:01 am", "content": "OK. By the way, I am using Chrome Version 62.0.3202.94 on my PC and OIS 11.2 on my IPhone", "num_user_post": " 4", "author": "Bovbjerg"}, {"date": "December 18, 2017 - 8:37 am", "content": "'We will put in a fix for this issue'  When will the fix be introduced?", "num_user_post": " 4", "author": "Bovbjerg"}, {"date": "December 28, 2017 - 2:15 pm", "content": "Apologies for the delay in responding. I believe this is addressed.Could you please confirm that autofill on the forms works on your iPhone and PC?", "num_user_post": " 225", "author": "Vinod"}, {"date": "April 2, 2018 - 11:45 am", "content": "I have the same problem on multiple devices and my friend (other account) has the same problems.Internet Explorer/ Firefox/ Chrome/ iPad safari/ Samsung internet. All have to login again en again after ~4 hours of inactivity. When will this be fixed?", "num_user_post": " 3", "author": "misterP"}, {"date": "April 2, 2018 - 12:15 pm", "content": "I'm not sure there is something to be fixed.You should not be signed out unless you close the browser window, the browser is clearing your cookies, or there are some server side changes. There are no server side changes that have happened today, so anything you are seeing is likely to be on the device.Are you closing your browser window/clearing your browser cookies/cache, or logging out of windows between trying to log in to ThingSpeak?", "num_user_post": " 225", "author": "Vinod"}, {"date": "April 8, 2018 - 3:51 pm", "content": "Nope, on other websites I stay logged in after closing my browser.Only Thingspeak gives me problems, it started after ThinkSpeak changed the login screen a little bit, 0.5 years ago. On my mobile devices (iPad (Safari) and android smartphone (Google Chrome)) I have to sign in after not using ThingSpeak for a few hours. My laptop restarts every day so I can't tell. An second problem is that my credentials are not saved on the ThingSpeak website (???). Mozilla says the following on their website, is this the possible problem.Websites prohibit password savingSome websites do not allow for passwords to be saved for security reasons. If you have followed the steps above, but are still not prompted to save a password when logging in to a certain website, that site may have disabled password saving.", "num_user_post": " 3", "author": "misterP"}, {"date": "April 14, 2018 - 5:10 pm", "content": "On another clean computer I created an account for ThingSpeak but it also signs out every time the browser is closed.Using Internet Explorer 10 with default settings. Why does ThingSpeak requires to login, and other websites keeps me logged in without any problems? (My browser keeps track of my cookies, I think? because other websites keeps me logged in when closing my browser)", "num_user_post": " 3", "author": "misterP"}, {"date": "April 17, 2018 - 1:19 pm", "content": "Logging a user out when they close the browser is by design. The choice is driven keeping security in mind. We do not feel it prudent to leave a user logged in once the browser window is closed. Lots of websites, including banks, do this for similar reasons.", "num_user_post": " 225", "author": "Vinod"}]}, {"url": "https://community.thingspeak.com/forum/general/login-to-thingspeak/", "posts": [{"date": "March 10, 2018 - 4:40 pm", "content": "I have already setup a math works account but thingspeak will not let me login to the web page with the account I set up.", "num_user_post": " 1", "author": "johnecy"}, {"date": "March 11, 2018 - 9:03 am", "content": "Have you disabled Javascript? What browser and browser plugins/browser extensions are you using?", "num_user_post": " 225", "author": "Vinod"}, {"date": "March 23, 2018 - 10:36 pm", "content": "I also have the same issue.I have allowed Javascript.Browser: Google Chrome Version 65.0.3325.181 (Official Build) (32-bit)Broswer pulgins: Ask when a site wants to use a plug-in to access your computer (recommended), and I didn't receive any asking notice.Broswer extensions it is using:Google Docs Offline,Chrome Docs And I am in China.", "num_user_post": " 2", "author": "martinding2020"}, {"date": "March 23, 2018 - 10:55 pm", "content": "I tried it on a couple of browsers and computers, none can work.I can login on mathworks with the same email address.", "num_user_post": " 2", "author": "martinding2020"}, {"date": "March 24, 2018 - 7:28 am", "content": "What happens when you try to log in? Is there a screenshot you can share that shows the screen on which you have trouble?", "num_user_post": " 225", "author": "Vinod"}, {"date": "March 24, 2018 - 10:02 am", "content": "Are you using a VPN or tor/onion service? If so, please disable that and try again. ", "num_user_post": " 225", "author": "Vinod"}]}, {"url": "https://community.thingspeak.com/forum/general/what-channel-fields-are-private/", "posts": [{"date": "March 8, 2018 - 12:20 pm", "content": "There is some number of fields in each channel which purpose could be assumed public.Notable examples are: - Description- Metadata- Tags- Link to External Site...Could anyone clarify whether these (or any) fields could be used to store sensitive information like private links, passwords, API keys etc.I was unable to find any relevant information in ThingSpeak documentation. Thank you in advance", "num_user_post": " 27", "author": "heh"}, {"date": "March 8, 2018 - 9:49 pm", "content": "If you set your channel sharing to private, none of these fields that you list will be available to any user unless they supply your user API key.  You can store your bank account password and your mothers maiden name in there and nobody will see them.", "num_user_post": " 401", "author": "cstapels"}, {"date": "March 9, 2018 - 11:06 am", "content": "Thank you.Are there ANY fields in a private channel that others could see without API key or channel sharing?Thanks", "num_user_post": " 27", "author": "heh"}, {"date": "March 21, 2018 - 12:15 pm", "content": "The user name may be public, but no data in the private channel is available to users without the API keys, unless the channel has been privately shared with that user.", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/general/react-on-bulk-updates/", "posts": [{"date": "March 9, 2018 - 11:46 am", "content": "Reacts seem to run only once per bulk update.This looks like a design flaw to me, because React configuration says: 'Run action each time condition is met'What if a bulk update has several records that meet React condition?Shouldn't it run once per each such record? The issue gets more complicated with MATLAB Analysis scripts.How would the script know what triggered it?What if it were some record in the middle of a batch?If yes, than which one it has to analyze then? This definitely needs more attention from ThingSpeak developers. Regards", "num_user_post": " 27", "author": "heh"}, {"date": "March 9, 2018 - 3:10 pm", "content": "Have a look at the documentation for Bulk Write.  The note at the top describes this feature.  There is a similar description at the React documentation page.  This feature was a planned design over a consideration of multiple different possible workflows.If you need to , there are a few ways to work around the issue.  One is to use the write data API, not bulk write.  Another way would be to have your react call a MATLAB analysis that scans all the data entered with the Bulk update.  You could have your first or last bulk entries include a status of 'write complete' and the have the MATLAB analysis scan until it hits the latest 'write complete'.", "num_user_post": " 401", "author": "cstapels"}, {"date": "March 9, 2018 - 3:43 pm", "content": "Even if it works as designed, still a design flaw from MATLAB Analysis point of view,which needs some way to know what is going on (e.g. list of records it was called on). As for me, I am already using status field for other things and it won't be easy to makeit structured to add 'write complete' flag. By the way, are data updates and reacts calls queued together (i.e. called in sequence)?Is there any chance of them getting out of sync?What I mean is whether it is possible for 2 Reacts run after their respective updates be already committed?", "num_user_post": " 27", "author": "heh"}, {"date": "March 14, 2018 - 4:19 pm", "content": "If you use a TimeControl to trigger your MATLAB analysis, and perform your comparison in the MATLAB analysis after you read the channel data, than MATLAB analysis will be aware of the data that triggered a response.  If you want the MATLAB analysis to be re-usable, you can have it read another channel that provides a list of channels to read for the comparison.  You have a lot more control if you do the conditional analysis in MATLAB compared to the React.You can also use the location fields: latitude, longitude, and elevation to write the 'complete flag', if you are not already using those fields.If you trigger a react on data entry, there is no way for the react to fire before the channel update, since the process is called by the data update.  If you have a react based on a time check, it would be possible for the channel update to happen before the react check. ", "num_user_post": " 401", "author": "cstapels"}, {"date": "March 16, 2018 - 1:45 am", "content": "Hi - when I asked about queuing I meant the following scenario:- MATLAB analysis is triggered (e.g. by some data insert)- something delays its execution (e.g. processing paused waiting for resources)- next trigger (e.g. insert) occurs before first one had its opportunity to finishMy question was kind of general - whether these 2 processing units could run out of order (second before first).Are they queued to run strictly sequentially no matter what triggered them?Can next data insert occur before previous analysis is completed?In other words, will the script see only data that existed when it was triggered?Or it could also read next data insert if that insert happened to occur while the script was still running?Thanks", "num_user_post": " 27", "author": "heh"}, {"date": "March 16, 2018 - 9:09 am", "content": "We are well off topic now.I am opening a separate thread about this sequencing issue.", "num_user_post": " 27", "author": "heh"}]}, {"url": "https://community.thingspeak.com/forum/general/passing-parameters-from-react-to-thinghttp/", "posts": [{"date": "March 5, 2018 - 1:31 pm", "content": "Can anyone suggest a reasonable way to pass parameters from React to ThingHTTP? 1. ThingHTTP itself appears to be able to accept very few (!!!) prefixed variables and unlimited numberof custom ones through %% notation, but I was not able to find how React can set custom values.2. I received a suggestion to use MATLAB analysis to set custom values, but this is a limited tool too,because there is no obvious way to pass parameters from React to MATLAB analysis script either. Currently, in order to pass parameters to ThingHTTP, I have to:- create 2 custom scripts (React and ThingHTTP) or- create 2 custom scripts (React AND MATLAB), because each unique React calls only 1 MATLAB script and no parameters allowedThe second way is, obviously, not any better. Ideal solution:It should be only 'one' custom React that calls shared ThingHTTP and passes necessary parameters to it -like URLs, IDs/passwords etc.", "num_user_post": " 27", "author": "heh"}, {"date": "March 5, 2018 - 2:25 pm", "content": "Thanks for the feedback, we will definitely explore your suggestions.  In the meantime, can you explain your workflow and we can see if we can find a better way to reach your goal?  For example, are you passing values from a device or from the web or computed values, how and where are are they being modified and or stored...?Regarding your comparison, I do think the second way gives you a good deal more flexibility and has a broader number of actions you can take, including processing the data, and the first is definitely more simple. ", "num_user_post": " 401", "author": "cstapels"}, {"date": "March 5, 2018 - 4:38 pm", "content": "HelloMy workflow is as follows:- one React monitors one parameter- triggering this React generates an HTTP request (typically to external endpoint)- this HTTP request ultimately generates a message / alert / another HTTP request- constraint: the endpoint messaging service wants to know whether the request came from a credible source I am looking for a design that maximizes code reuse and minimizes any customizations. In my opinion, this is what is needed:- a number of custom Reacts, each is responsible for monitoring 1 data field (currently implemented)- one or more 'shared' ThingHTTPs, each is responsible for its own endpoint (i.e. TCP/IP address, port, URL etc)- React needs to pass parameters to ThingHTTP instance (e.g. custom user message)- parameter passing needed for at least 2 reasons:    1. to authenticate message 'source' with the endpoint (so that several Reacts can use same ThingHTTP for sending messages to the same endpoint)    2. to provide source-specific and target-specific messages, like 'channel <Source_Name> sent <Target_Name> a message'Please, let me know if this needs further clarification. Regards", "num_user_post": " 27", "author": "heh"}, {"date": "March 5, 2018 - 7:38 pm", "content": "One possibility would be to write a MATLAB analysis that reads another channel where you store the endpoint information. You code can work based on the number of entries available in the endpoint channel.  Then your functions are re-usable in a sense. endpoints=thingSpeakRead(endpointChannel...)...for 1:length(endpoints)%write to endpointendYou can also include operations to do the comparisons that you would do in your react.  The Analysis can even read the comparison parameters from another channel (such as thresholds.) Depending on if you data is stored across multiple channels or multiple fields, you can set once again perform conditional analysis based on the number of entries available to read.  Even better, you could have a list of channels or fields to read in yet another channel or field.  Then the analysis gets all its parameters from channel reads and is completely independent of customization.  Here is psuedo code to give you an idea of what I mean.parameters=thingSpeakRead(parameterChannel...)...for 1:length(parameters)data(n)=thingSpeakRead(datachannels)..if parameters(n)>data(n)...%write to endpointendendIf your authentication is static, you can store it in the endpoint channel.  If not, you could have the something write the authentication info to the endpoint channel.Last, you can trigger the analysis on a regular bases (TimeControl) or on data entry with React.", "num_user_post": " 401", "author": "cstapels"}, {"date": "March 5, 2018 - 10:09 pm", "content": "Thank you for your response and proposed solution.My understanding is that any read/write from/to a private channel requires corresponding API keys.Aren't these all custom?Or there is some way to access my own channels without keys? Regards", "num_user_post": " 27", "author": "heh"}, {"date": "March 7, 2018 - 12:58 pm", "content": "You can use the user API Key to return read and write API keys for a channel.  You will need the User API key for the account holder, but one user API key can get keys for all channels owned by that user.  Use the format shown in the example on the Read Settings page.https://api.thingspeak.com/channels/<channel_ID>.json?api_key=<XXXXXXXXXXXXXXXX>", "num_user_post": " 401", "author": "cstapels"}, {"date": "March 7, 2018 - 11:37 pm", "content": "Is there any way to pass this User API key to a MATLAB Analysis script so it could use it within?Or it should be hardcoded in the script body?", "num_user_post": " 27", "author": "heh"}, {"date": "March 8, 2018 - 10:34 am", "content": "Once again you could consider reading the API key from some other private channel. This might be leading to infinite regression though.  At some point in the chain, there probably needs to be a unique identifier that is human entered, such as channel number, or API key. You could put the API key in the metadata of a channel, which is static compared to a field write in the sense that it stays current and does not move up the feed table with more entries.Programatically retrieving API keys with a user API key may be overkill for your application. I'd suggest: A node posts data and credentials to a channel.  Nodes must be programmed with API key for that channel. (they have to be programmed at least once)The MATLAB analysis is triggered by a single react and then the analysis reads the channel and does the endpoint determination based on the credentials and then does the endpoint authentication if needed.Then the MATLAB analysis has the node data and the authentication information and can make the HTTP calls you wished for.  It can even parse the sensor data to make a decision on validity before acting.", "num_user_post": " 401", "author": "cstapels"}, {"date": "March 8, 2018 - 12:03 pm", "content": "Thank you for your response.Sorry, I keep asking questions because of lack of information in documentation.You suggested:'The MATLAB analysis is triggered by a single react and then the analysis reads the channel ...'To implement your idea the script has too know what triggered it - channel and, possibly, the condition.While the idea to use MATLAB Analysis scripts is very attractive, it is absolutely not clear how to pass any (!!!) parameters to it.It seems that everything has to be hardcoded, which for me is going back to 'square one'. Thank you for you patience with me", "num_user_post": " 27", "author": "heh"}]}, {"url": "https://community.thingspeak.com/forum/general/service-interruptions/", "posts": [{"date": "February 26, 2018 - 3:10 am", "content": "Since Saturday 12h30 CET, I am seeing many interruptions in the data I am sending every 3 minutes to two channels.Less than half of all MQTT messages reach ThingSpeak.There is nothing wrong with my account; there is still plenty of message credit available.Nor have I changed anything to my application that has been running for a couple of months without any previous issue.Are there any known issues at ThingSpeak that would account for what I am experiencing?Anybody else experiencing the same?", "num_user_post": " 4", "author": "Serge"}, {"date": "February 26, 2018 - 8:08 am", "content": "We don't have any reason to believe there have been any interruptions. Please share some more information:Are you only using MQTT to send data to ThingSpeak?What channels are you publishing data to? please let us know your channel IDIs this from a device that is powered by battery or by mains power? If battery powered, is it likely the battery is failing (brownouts)?Are you able to reproduce the issue from another device, or posting directly using a web browser?", "num_user_post": " 225", "author": "Vinod"}, {"date": "February 26, 2018 - 9:34 am", "content": "Both devices are mains powered. One is an ethernet-connected server, the other a WLAN-connected ESP32, both use the same VDSL2-router to connect to the internet. That router has already been restarted to no avail.Both run similar programs sending MQTT mesages, however the former runs Python code, the latter MicroPython code.This makes it surprising to suddenly witness simultaneously started dropouts lasting up to 45 minutes, instead of the normal 3 minute data interval. I will send you the affected channel numbers in a personal message, since these are private channels.", "num_user_post": " 4", "author": "Serge"}, {"date": "February 26, 2018 - 12:45 pm", "content": "Ah, it looks like things are working again after having written to this forum and without changing anything from my behalf. Thanks.Since I am evaluating this service for a potential future commercial roll-out, could you share your postmortem?I would like to understand what happened.", "num_user_post": " 4", "author": "Serge"}]}, {"url": "https://community.thingspeak.com/forum/general/confused-about-which-version-of-thingspeak-to-buy/", "posts": [{"date": "February 14, 2018 - 2:28 am", "content": "Greetings!I was wondering if somebody could tell me the difference between the Academic and Student version of ThingSpeak as I am planning to use it for my senior year project. I am aware that the student version has a MATLAB Compute Timeout of 20 seconds, whereas the Academic has 60 seconds. What does this mean?Also, if I purchase the student version and plan to upgrade to the academic version later, will I still have to pay the entire price of the academic version? Thank you.", "num_user_post": " 1", "author": "Sarah Khan"}, {"date": "February 14, 2018 - 8:58 am", "content": "Hi Sarah,When you request a MATLAB calculation in ThingSpeak using either the MATLAB Analysis App or MATLAB Visualizations App, the execution time must be less than the compute timeout. The execution time includes the request communication time, response communication time and the calculation time.  With the academic license you get a 60 second Compute Timeout which will let you do longer calculations.  This may or may not be critical for your project.  Unless you know you will be doing long computations, I would recommend you buy the student license.  If you have any issues with the compute timeout, you can contact us and we can help you upgrade to the academic license.Thanks,Eric", "num_user_post": " 2", "author": "ewetjen"}]}, {"url": "https://community.thingspeak.com/forum/general/dht22-and-mq135-sensors/", "posts": [{"date": "February 13, 2018 - 1:13 pm", "content": "Hello. I want to ask for help. I can not combine two sketches to send data to Thingspeak from two sensors: DHT22 and MQ135. Can you help me?", "num_user_post": " 1", "author": "giulio"}]}, {"url": "https://community.thingspeak.com/forum/general/cant-log-into-thingspeak/", "posts": [{"date": "January 24, 2018 - 5:47 am", "content": "For the past few days I have not been able to log into my Thingspeak account. Not from my desktop, not my phone. I get to the first page which shows the user name login. I enter my email address and then instead of taking me to the pwd screen, it shows an almost blank screen and hangs. Anybody know what is going on? My public channels are still alive and well and my IoT devices are still posting data ok.", "num_user_post": " 13", "author": "rberkelm"}, {"date": "January 24, 2018 - 7:54 am", "content": "Are you using a VPN service? If so, could you turn off the VPN and see if you are able to log in?We've also seen some browser plugins cause problems. If you would rather not uninstall or disable the browser plugins, can you try a different browser?If you're still unable to log in, could you send details about the browser you are using, the OS platform you're on, and a screenshot of the page?", "num_user_post": " 225", "author": "Vinod"}, {"date": "January 25, 2018 - 5:03 am", "content": "No VPN service here. However, it does seem to be related somehow to Chrome. I can log into ThingSpeak fine using IE, but not Chrome using either my laptop or desktop. Forget what I said about the phone. That was a different issue. I've disabled all the Extensions in Chrome but still no luck, even after a reboot. To my knowledge I haven't changed any configuration on either the laptop and desktop. This issue has only just cropped up in the last few days.I'm running Windows 7 32-bit on the desktop and Windows 7 64-bit on the laptop, both use Chrome as the default browser.", "num_user_post": " 13", "author": "rberkelm"}, {"date": "January 25, 2018 - 5:35 am", "content": "BTW, I've been trying to post a screenshot, but I can't figure out how! Under Insert/Image I see a dialog box that wants text. I entered the url of the saved image but it doesn't seem to find the image.", "num_user_post": " 13", "author": "rberkelm"}, {"date": "January 29, 2018 - 7:56 am", "content": "Have upgraded my desktop to Windows 10 (32-bit), but still no success in logging in via Chrome. Any suggestions (other than using the dreaded IE)?", "num_user_post": " 13", "author": "rberkelm"}, {"date": "January 29, 2018 - 8:19 am", "content": "I'm able to login using Chrome Version 64.0.3282.119 (Official Build) (64-bit). Could you tell me what version of Chrome you are using?If you could reach out to vcherian (at) mathworks (dot) com we can schedule a screen share session to debug the issue.", "num_user_post": " 225", "author": "Vinod"}, {"date": "January 31, 2018 - 7:11 pm", "content": "My issue is now resolved - thank you so much Vinod - your blood is worth bottling!For anyone else having similar issues, try opening an 'incognito tab' on your Chrome browser, then connect to ThingSpeak and log in. If you are successful, as I was, this might indicate a problem with bad cookies. The fix for me was clearing all cookies and browsing history.Thanks for the great help and patience!Ray", "num_user_post": " 13", "author": "rberkelm"}]}]}