{"url": "https://community.thingspeak.com/forum/general/page-12/", "threads": [{"url": "https://community.thingspeak.com/forum/general/xively/", "posts": [{"date": "May 27, 2013 - 1:47 pm", "content": "Anyone have an opinion on the Cosm to Xively move?", "num_user_post": " 6", "author": "chrisjx"}, {"date": "May 29, 2013 - 10:17 pm", "content": "Hi Chris,I think it is a natural progression when big companies get involved. Many platform players will jump into this space and make it unclear for consumers. It's also natural to try and find a business model.The best place to be is where you have an active development community and a low-cost infrastructure to support them. ThingSpeak has both, thankfully.A big step is coming for ThingSpeak and we need to tap into not only connected device developers but application developers that will make the platform their own.I would ask you to provide feedback on what we can do to help you with your projects. The more input / commits that come from the community, the more this platform will exist and compete. IoT is about to get real interesting IMHO.Thanks for the convo starter,HansPS. I think that you are in the area - come to the hackathon June 7-9 in Santa Clara - http://blog.iobridge.com/2013/05/the-connected-world-m2m-app-challenge-june-7-9-in-santa-clara-ca - $3000 for first place!", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/general/use-of-min-in-http-request-api/", "posts": [{"date": "April 7, 2013 - 8:06 am", "content": "I would like to use the min= parameter in my URL to fetch only data since the last entry id read previously.   The idea is to only fetch new entries... but not just the one last one, rather the last N that showed up since the prior request. Is this possible to do?  I've looked through the documentation, but found no examples on the use of min... anyone have an example of this?  Or what the value syntax should be?  Thanks!", "num_user_post": " 1", "author": "fhw"}, {"date": "May 20, 2013 - 1:12 am", "content": "You could use the start parameter:start=[start date] – YYYY-MM-DD%20HH:NN:SSIf you keep track of the moment you last checked the data and fill that in at start I think this should give you only the data registered after that time.cheersCor", "num_user_post": " 37", "author": "CorBee"}]}, {"url": "https://community.thingspeak.com/forum/general/4-amazing-free-android-applicationsyou-wouldnt-miss-it/", "posts": [{"date": "March 29, 2013 - 2:59 am", "content": "1.App name: Fail!App description:Fail, WTF, Facebook, funny, sexy, girlFail, WTF, facebook Fail,best photo bomb, the strange, the sexy, the wired, the unbelievable, you bet! We have them all. Every day, the best of the Internet gather here for your viewing pleasure. This is not for the faint hearted; you need to have a high level of tolerance for the gross, the stupid and the unbelievable stuff. Otherwise stay away from the daily fresh updates!Software download:https://play.google.com/store/apps/details?id=com.mangolee.fail.wtf.sexy.girl.wired.funny2.App name: TattoTatto App description:'D10 Tatto' delivers to you beautiful tatto designs in high quality pictures. Tatto lovers, wait no more, get the latest, sexiest and coolest in Tatto. 10 or more updates every day.Softward download:https://play.google.com/store/apps/details?id=com.mangolee.d10.sexy.tatto3.East BeautyApp description:'D10 East Beauty' delivers beauty from the east to you everyday in sexy and fancy packages. Enjoy these sexy, naughty and cute pictures from China, Japan, Korea and other east Asian lands. 10 or more beauties are presented every day.App screenshots:Software download:https://play.google.com/store/apps/details?id=com.mangolee.d10.sexy.bikini.beauty.asian4.App name: LOLApp description:LOL offers the best pictures from the Internet in funny, fail, wtf, lol, sexy and crazy. Everyday new updates are added fresh from the Internet social networks such as facebook and twitter and also from user discussion groups. Enjoy!App screenshots:Software download:https://play.google.com/store/apps/details?id=com.mangolee.lol.funny.wtf.sexy.humor.englishFollow mangolee on facebook or twitter:Tweets by mangolee_comhttps://www.facebook.com/pages/Mangolee_en/360553414053590", "num_user_post": " 13", "author": "harrisandrew73"}]}, {"url": "https://community.thingspeak.com/forum/general/a-few-question-about-thingspeak/", "posts": [{"date": "March 11, 2013 - 3:49 am", "content": "1. Is there a way to programmatically (api) add channels and device?Instead of using the dashboard so I can have my own dashboard and the channels will be automatically  created according to the desired logic.2. Does the open source API contains the ThingSpeak apps as well? And more specifically does it includes the ThingHTTP and React?3. If I start using thing speak normally and then would like to migrate to open source API and have my own server. Is there a way to get all my data?Thanks a lot!Gil", "num_user_post": " 1", "author": "gil"}]}, {"url": "https://community.thingspeak.com/forum/general/testing-upgraded-forum-software/", "posts": [{"date": "February 10, 2013 - 8:56 am", "content": "Things may look different on the forum. We are testing an upgrade to Simple Press - let us know if you find anything 'odd'. Thanks...", "num_user_post": " 402", "author": "Hans"}, {"date": "February 10, 2013 - 9:10 am", "content": "This is a test.Test.", "num_user_post": " 402", "author": "Hans"}]}]}