{"url": "https://community.thingspeak.com/forum/general/page-8/", "threads": [{"url": "https://community.thingspeak.com/forum/general/upload-a-couple-of-timestampvalue/", "posts": [{"date": "August 31, 2015 - 5:20 am", "content": "HiHow can I upload a couple (timestamp, value) instead of just a value as field1 for example ?Thanks for your help", "num_user_post": " 1", "author": "pwp1cx"}, {"date": "August 31, 2015 - 9:27 am", "content": "Hi, If you using the THINGSPEAKWRITE function in MATLAB Analysis app, you can specify the timestamp by using the 'TimeStamp' parameter. Here is an example - Note that you will have to replace the values with those corresponding to your channel: channelID = 12342;value = 10;timestamp = datetime('8/31/2015 9:22:01');write_API_Key = '12ADGDFGWER23423';thingSpeakWrite(channelID, value, 'TimeStamp', timestamp, 'WriteKey', write_API_Key)Find further information about the THINGSPEAKWRITE function here:https://thingspeak.com/docs/matlab_analysis#thingSpeakWriteIf instead you are using the Update Channel Feed API, then you can specify the 'created_at' parameter to specify the timestamp. Find further information about the update channel feed API here:https://thingspeak.com/docs/channels#update_feedThanks,Adarsh", "num_user_post": " 62", "author": "Adarsh_Murthy"}, {"date": "February 21, 2016 - 2:08 pm", "content": "HiHow to replace datetime('8/31/2015 9:22:01') with variable datetime?Thanks", "num_user_post": " 8", "author": "homerruma"}]}, {"url": "https://community.thingspeak.com/forum/general/how-to-use-channels/", "posts": [{"date": "February 9, 2016 - 5:27 am", "content": "I'm trying to use ThingSpeak, and I would to understand how to use channels and fields.First of all, why a channel has 8 fields ? Why 8 and not 16 or 5 ?Then how are we supposed to use a channel ?Is a channel supposed to represent an object with several sensors ? Let's take an example :In my house, I have 5 rooms, in each of them I want to measure temperature, humidity and the light intensity.Do I need to create a channel for each room ? Or is it a good idea to create one channel for the temperature, one for humidity and one for lights ?Thank", "num_user_post": " 2", "author": "DAS"}, {"date": "February 9, 2016 - 6:49 pm", "content": "A channel is accessed by a single API key so most likely you want to group some sensors connected to the same device into a channel.  Each channel can only be updated every 15 seconds minimum.The maximum fields per channel of 8 appears to be an arbitrary decision of the original developers for reasons unknown. The basic graph pages display all fields for a single channel on a page so that may influence your decision to group by room or parameter although you can now easily combine data from various channels using the matlab visualistion app.", "num_user_post": " 271", "author": "rw950431"}, {"date": "February 10, 2016 - 6:09 am", "content": "Thank you very much for you answer", "num_user_post": " 2", "author": "DAS"}]}, {"url": "https://community.thingspeak.com/forum/general/getting-started/", "posts": [{"date": "January 28, 2016 - 11:10 am", "content": "Hi group,Quite new to ThingSpeak / IoT world.  I have some experience in Micro-controllers, electronics and API's, so not starting from scratch.I am looking to do something that was done many times here but just need some high level guidance.I want to hook up some sensors (analog/digital) to a microcontroller, monitor them, push the info over wifi to ThinkSpeak and from there put some alarms and other monitoring.For my first project, I would have 2-3 analog in + 6-8 digital in to monitor water levels, temperature, humidity.So questions are:1) What is the best micro-controller for this first project, for the number of inputs and wifi need.   a) Arduino (which model)   b) Raspberry PI (which model)2) Any howto to get started? for each type of #13) Any good Canadian distributor?update 1: For now I don't really need any GUI on the device, working on it from SSH is fine.Thanks", "num_user_post": " 4", "author": "Simon Filiatrault"}, {"date": "January 28, 2016 - 4:09 pm", "content": "Hi Simon,There are many ways you can achieve the same as you can pick any board with standard features with enough pins to accommodate the sensors and ability to connect to the internet. Depending on your requirements ( wifi, integrated sensors) you can choose from many models. You could trying using the following list of hardware and software to set up your sensors:SparkFun Photon Weather Shield: https://www.sparkfun.com/products/13630which works with photon, a wifi development kit. https://store.particle.io/(Note that, you can also connect any other specific sensors to the photon directly based on your application requirements.)You can then use ThingSpeak Libraries: http://community.thingspeak.com/2015/10/official-thingspeak-library-for-arduino-and-particle/to read/ write weather data from/ to a ThingSpeak channel.Refer to the following docs to create a channel, https://www.mathworks.com/help/thingspeak/create-a-channel.htmlUpdate Channel: https://www.mathworks.com/help/thingspeak/update-channel-feed.html etc..After your hardware is set up, here is a great getting started article to refer to:https://www.mathworks.com/help/thingspeak/getting-started-with-thingspeak.htmlOnce your data is available on ThingSpeak, to gain insights from your data, use the MATLAB Analysis and MATLAB Visualization apps within ThingSpeak:https://www.mathworks.com/help/thingspeak/matlab-analysis-and-visualization.htmlHere are some additional examples that might be helpful with your project:http://www.instructables.com/id/Instrumented-Soda-Machine/http://www.instructables.com/id/ESP8266-Wifi-Temperature-Logger/http://fritzing.org/projects/arduino-yun-temperature-and-humidity-sensorRaspberry Pi:http://community.thingspeak.com/tag/raspberry-pi/Analysis:http://makerzone.mathworks.com/stories/arduino-stories/weather-station-analysis-revisited/", "num_user_post": " 8", "author": "Meenakshi"}, {"date": "January 28, 2016 - 7:03 pm", "content": "Thanks for all the great info and links... will take a while to read all that!If we compare Raspberry PI vs Arduino on those points, can you or someone else help                                                             RP           Arduino====================================PriceEase of adding WifiEase of programmingFlexibilitySizeSupportWhich one is the winner?", "num_user_post": " 4", "author": "Simon Filiatrault"}, {"date": "January 30, 2016 - 5:56 am", "content": "RaspPi and Ardiino are quite different beasts used for very different purposes so comparision is quite hard.  RaspPi is a tiny computer that can do most things your laptop can do, although not as fast- just plug in a monitor and keyboard.  Arduino has no display, no keyboard and requires another computer to program it (you can, in fact, use your RaspPi to program your Arduino)PriceArduino $3-$20, RaspPi $20-$60Ease of adding WifiArduino:  can use ESP8266 board via serial $3.  RaspPi can use off-the-shelf USB Wifi stick  $5-$20Ease of programmingArduino: can only use one language, a variant of C, need more powerful system to write programs and upload to board.  RaspPi has a wide variety of programming languages available eg perl, python, php, C, shell etc and can be programming with a keyboard and a HDMI-compatible monitor.FlexibilityRaspPi is more flexibleSizearduino comes in a range of form factors some of which are very small (almost as small as a bottle-top in some cases).  The new RaspPi zero is also quite compact but the standard RaspPi will occupy the palm of your hand once all the peripherals are connected.SupportBoth have really great communities http://forum.arduino.cc  and https://www.raspberrypi.org/forums/Which one is the winner?The answer is- it depends.An arduino, with careful programming, can run a single task for a year on a set of AA batteries but the RaspPi will flatten the same batteries in a few hours.The arduino inputs tend to be more tolerant of mistakes in the wiring than RaspPi.Arduino is cheap enough to blow upRaspPi has no analog inputs.I'd recommend getting both if time and budget permit.", "num_user_post": " 271", "author": "rw950431"}, {"date": "January 30, 2016 - 8:42 am", "content": "Very nice info!  So no analog input on RaspPi.. so you need a ADC and program for it... I think I will start my little project with a Arduino + ESP8266  and buy the RaspPi to play with.I am reading some people using ESP8266 only with an SDK ?More research and reading... lots of possibility!Thanks for participating", "num_user_post": " 4", "author": "Simon Filiatrault"}, {"date": "January 31, 2016 - 9:36 pm", "content": "Yes  ESP8266 can be used standalone via the NodeMCU firmware http://nodemcu.com/index_en.html or via the Arduino IDE with an extension (https://github.com/esp8266/Arduino).   I have heard complaints that the NodeMCU firmware isnt very stable.ESP8266 is cool and crazy-cheap but is more limited in terms of I/O pins than Arduino, again no analog inputs.", "num_user_post": " 271", "author": "rw950431"}, {"date": "January 31, 2016 - 9:49 pm", "content": "Thanks again to all... Started to document my findings on my blog: http://simonfiliatrault.blogspot.ca/2016/01/getting-started-with-internet-of-things.htmlSince I need I/O, Analog IN, Wifi, I will probably try those modules... not decided yet which one:1) Particle Photon board (Wifi + I/O)2) Fishino UNO Thanks,", "num_user_post": " 4", "author": "Simon Filiatrault"}]}, {"url": "https://community.thingspeak.com/forum/general/how-to-display-consumption/", "posts": [{"date": "January 8, 2016 - 11:08 am", "content": "Hi,Me and my raspberry loves ThingSpeak ! 🙂I'm searchong how can i show hourly, daily, weekly and monthly consumption for my electricity.Field contain cumulative value in kWh.Thanks for your help.Best reagrds", "num_user_post": " 2", "author": "orcad"}, {"date": "January 9, 2016 - 2:05 am", "content": "I've seen some nice visualizations of power consumption using circular heat maps (eg http://prcweb.co.uk/circularheatchart/)  not sure if the Matlab visualizations support this yet..If you have cumulative figures you will obviously need to difference them to get periodic values.", "num_user_post": " 271", "author": "rw950431"}, {"date": "January 9, 2016 - 1:43 pm", "content": "If you have cumulative figures you will obviously need to difference them to get periodic values.This is the problem...", "num_user_post": " 2", "author": "orcad"}, {"date": "January 10, 2016 - 4:37 am", "content": "See my post at http://community.thingspeak.com/forum/thingspeak-plugins/converting-counter-values-to-rate-of-change/ for how to do this in javascript.Can probably use a Matlab analysis also", "num_user_post": " 271", "author": "rw950431"}, {"date": "January 10, 2016 - 7:17 am", "content": "In desktop MATLAB, you can generate bullseye plots like this using a community contributed function on file exchange, such ashttp://www.mathworks.com/matlabcentral/fileexchange/16458-bullseye-polar-data-plotThe MATLAB integrated into ThingSpeak can't execute custom functions, so it can't take advantage of this at the moment.-Rob", "num_user_post": " 47", "author": "Rob Purser"}]}, {"url": "https://community.thingspeak.com/forum/general/thingspeak-daylight-saving-time-changes-handling/", "posts": [{"date": "December 24, 2015 - 6:59 am", "content": "Hello,how is clock change ( Daylight Saving time changes) handled for the incoming data ? What happens with the data  when the clock is set back ?Thanks!Pilif", "num_user_post": " 2", "author": "pilif"}, {"date": "December 24, 2015 - 8:49 am", "content": "We store all data as UTC time.", "num_user_post": " 402", "author": "Hans"}, {"date": "December 26, 2015 - 7:43 am", "content": "Thanks 🙂", "num_user_post": " 2", "author": "pilif"}]}, {"url": "https://community.thingspeak.com/forum/general/export-data-in-time-range/", "posts": [{"date": "December 23, 2015 - 6:06 am", "content": "Hi,  If I am logging data for several days,  how to I export data for a previous day (in CSV)?Ive tried by specifying a date range like this: [data,time,channelInfo] = thingSpeakRead(readChannelID,'Fields',[1],'DateRange',[datetime('Dec 22, 2015'),datetime('Dec 23, 2015')]);then writing to a new channel like thisanalyzedData = data;thingSpeakWrite(writeChannelID, analyzedData, 'WriteKey', writeAPIKey);but get the following error:Error using thingSpeakWriteTimestamps for the Values being uploaded needs to be specified using the Timestamp parameter.I'm unsure of how to add the timestamp data as it is not a Field parameter?Am I goingg about it in the right way?", "num_user_post": " 4", "author": "wizbrewery"}, {"date": "December 23, 2015 - 6:26 am", "content": "The documentation for thingSpringWrite contains an example of writing a table to a channel- have you looked at that?   Looks like you need to construct a table with timestamps and matching data pointsNot sure why you are writing to a channel if your aim to to export CSV though?  Matlab has a csvwrite function that might be handy.", "num_user_post": " 271", "author": "rw950431"}, {"date": "December 23, 2015 - 6:46 am", "content": "thanks,  well,  the data export only seems to give me todays data on channel 66385  (should it give more?).  so looking for a way to get data for a previous day.   I saw the table example,  however,  the example populates with timestame now,  rather than original timestamp values contained in the channel.  So my data has only field1 specified and thats easy but how do I specify the time field of the channel?", "num_user_post": " 4", "author": "wizbrewery"}, {"date": "December 23, 2015 - 8:47 am", "content": "Here's an example using the API:http://api.thingspeak.com/channels/9/feeds.csv?start=2011-11-11%2010:10:10&end=2011-11-11%2011:11:11", "num_user_post": " 402", "author": "Hans"}, {"date": "December 23, 2015 - 4:37 pm", "content": "Cool,  many thanks for that.  Just what I'm looking for 🙂", "num_user_post": " 4", "author": "wizbrewery"}]}, {"url": "https://community.thingspeak.com/forum/general/cant-add-plugins-to-my-channel-page/", "posts": [{"date": "January 22, 2014 - 6:22 pm", "content": "Hi All,First - am loving Thingspeak. Very awesome.One thing that's bugging me is that I can't add my add ins to my channel page. I get an odd screen that looks like this:'Click a rectangle to view that Plugin in a dashboard window.HumGaugeTempGauge'The problem is there is no rectangle - so it won't go any further.Any help would be sensational,Andrew", "num_user_post": " 6", "author": "acarre"}, {"date": "January 23, 2014 - 10:40 am", "content": "Thanks for notifying us. A recent update caused an issue with adding Plugins to the private/public views. It will be fixed shortly.", "num_user_post": " 402", "author": "Hans"}, {"date": "January 23, 2014 - 1:58 pm", "content": "Hi Andrew,We made some fixes on our side, can you check if this is working for you now?lee", "num_user_post": " 457", "author": "lee"}, {"date": "January 27, 2014 - 5:52 pm", "content": "Thanks Lee!!!All working fine now. Cheers,Andrew", "num_user_post": " 6", "author": "acarre"}, {"date": "December 15, 2015 - 4:52 am", "content": "Hello everyone!Now I can't add plugin to channel/tell me, please, how can add plugin to channel???thank you very much!", "num_user_post": " 1", "author": "vandai"}]}, {"url": "https://community.thingspeak.com/forum/general/use-of-thingspeak/", "posts": [{"date": "November 26, 2015 - 3:57 pm", "content": "Hi ThereI have been trying to get an answer whether It is aloud for private companies to use ThingSpeak to monitor sensors collecting environmental data in the field. I wrote to the support mail and another post in the general forum, but i did not get any answer, could you Please help me on this one, as i Really like the ease of using ThingSpeak, but I do not want to violate any rules of application, if it is only for private projects.", "num_user_post": " 4", "author": "nitrospira"}, {"date": "November 29, 2015 - 1:39 am", "content": "From: https://thingspeak.com/pages/termsA.1 As long as you comply with the Terms, MathWorks grants you a personal, non-commercial, non-exclusive, non-transferable, limited authorization to access and use the Site.I'm not a lawyer but it seems to be 'personal use only'.   Thingspeak is open-source so you can run a copy on your own server if you wish. Source code at https://github.com/iobridge/thingspeakPersonally I'd like to know when Mathworks took over from IOBridge:  it was all very low-ley, no blog post, no announcement or anything.", "num_user_post": " 271", "author": "rw950431"}, {"date": "November 29, 2015 - 9:54 am", "content": "Thanks for jumping in.Most of us were out of town for the holidays, so we didn't get to give you a response. We will follow-up with you directly about commercial use. Thanks,Hans", "num_user_post": " 402", "author": "Hans"}, {"date": "November 29, 2015 - 3:03 pm", "content": "Hi Hans sounds good -  i will be looking for your reply.", "num_user_post": " 4", "author": "nitrospira"}]}, {"url": "https://community.thingspeak.com/forum/general/chart-data-disappears-whenever-web-page-is-refreshed-yet-all-data-in-csv-file/", "posts": [{"date": "November 20, 2015 - 12:33 am", "content": "I am having a strange problem with the data I am posting to my GPRSTest channel and was wondering if anybody had a solution?I have an arduino updating data fields within the channel, including 'created at' timestamps. All seems to work well and data can be seen being added to the charts in Thingspeak in real-time. However, if I browse away from Thingspeak and come back all the data is missing from the chart and it starts to populate again.Interestingly (thankfully!) if I download a csv file for the channel, all data is there in the csv file and correctly timestamped.It would be great to get the charts working. In the past they have worked well form me with non-timestamped data, so I am wondering if this is the problem somehow?Any ideas appreciated.", "num_user_post": " 6", "author": "acarre"}, {"date": "November 20, 2015 - 2:11 am", "content": "False alarm! I am great at posting my own fixes! I was using a bodgy time format. It was formal UTC like '2015-11-20T18:02:35+10:00' and for some reason Thingspeak accepted it ok in the datafile, but the chart couldn't read it.I changed the 'created at' format to '2015-11-20 18:02:35' and it's all happy times.", "num_user_post": " 6", "author": "acarre"}]}, {"url": "https://community.thingspeak.com/forum/general/how-to-chart-multiple-series/", "posts": [{"date": "November 9, 2015 - 1:01 pm", "content": "Hello,I have multiple devices posting updates to the same thingspeak channel.  Each device logs the device name,  the temperature, and a mode setting.  I can't seem to figure out how to make the matlab visualization chart produce a chart with multiple series on it.  I.e.  x axis is time, y axis is temperature with  mutiple lines on the chart using different colors representing the different device's temperatures.   My data looks like this:created_at,entry_id,field1,field2,field32015-11-09 12:13:28 UTC,69,Master_Bedroom,18.444147,02015-11-09 12:25:45 UTC,70,Living Room,18.014652,02015-11-09 12:35:11 UTC,71,Kitchen,18.323755,02015-11-09 12:43:28 UTC,72,Master_Bedroom,18.435541,02015-11-09 12:55:45 UTC,73,Living Room,18.014652,02015-11-09 13:05:11 UTC,74,Kitchen,18.293665,02015-11-09 13:13:28 UTC,75,Master_Bedroom,18.418329,02015-11-09 13:25:45 UTC,76,Living Room,18.014652,02015-11-09 13:35:11 UTC,77,Kitchen,18.233484,02015-11-09 13:43:27 UTC,78,Master_Bedroom,18.358149,02015-11-09 13:55:45 UTC,79,Living Room,17.934067,02015-11-09 14:05:11 UTC,80,Kitchen,18.173304,02015-11-09 14:13:28 UTC,81,Master_Bedroom,18.246393,02015-11-09 14:25:44 UTC,82,Living Room,17.772896,02015-11-09 14:35:11 UTC,83,Kitchen,18.177576,02015-11-09 14:43:27 UTC,84,Master_Bedroom,18.306574,02015-11-09 14:55:44 UTC,85,Living Room,17.934067,02015-11-09 15:05:11 UTC,86,Kitchen,18.637629,02015-11-09 15:13:27 UTC,87,Master_Bedroom,18.676294,02015-11-09 15:25:44 UTC,88,Living Room,18.256414,02015-11-09 15:35:11 UTC,89,Kitchen,19.080469,02015-11-09 15:43:27 UTC,90,Master_Bedroom,18.878382,02015-11-09 15:55:44 UTC,91,Living Room,18.175823,02015-11-09 16:05:11 UTC,92,Kitchen,18.869806,02015-11-09 16:13:27 UTC,93,Master_Bedroom,18.921381,02015-11-09 16:25:44 UTC,94,Living Room,18.175823,02015-11-09 16:35:11 UTC,95,Kitchen,19.192286,02015-11-09 16:43:27 UTC,96,Master_Bedroom,19.196589,0My MATLAB code is as follows:[data, time] = thingSpeakRead(readChannelID, 'Fields', [2,3], 'NumDays',14);thingSpeakPlot(time, data);This however, produces a chart with only one line using all the temperature settings from all devices on one line.  I want 3 lines on this chart, one each for Master_bedroom, Living Room, and Kitchen.  Each line showing its respective temperatures over time.Could anyone suggest some MATLAB code to do this?Thanks!Marco", "num_user_post": " 4", "author": "moballa"}, {"date": "November 10, 2015 - 9:15 am", "content": "moballa,The MATLAB function 'thingSpeakPlot' documentation (https://thingspeak.com/docs/matlab_visualizations#thingSpeakPlot) shows that the function accepts three 'types' of inputs: vector, scalar, and matrix. The default input is a vector. However, if a matrix is specified, each column of the matrix is treated a separate series. For example, see the 'Create Matrix Line Plot' example. The MATLAB code 'magic(4)' uses the MATLAB function 'magic' (http://www.mathworks.com/help/matlab/ref/magic.html) returns a 4x4 matrix. The example figure clearly shows 4 lines with 4 points per line. The MATLAB function 'thingSpeakPlot' requires a square matrix if a single X,Y matrix pair is provided. However, the MATLAB function 'thingSpeakPlot' can plot multiple vectors of varying sizes if the inputs are provided as separate arguments, for example:thingSpeakPlot(x1, y1, x2, y2, ect...)MATLAB visualization functions accept 'lineSpecs' name-value parameters. The 'Create Plot with Specific Line Properties' example in the 'thingSpeakPlot' documentation shows different 'lineSpec' examples. The full set of name-value pairs are listed further down in the documentation.In the scenario above, additional logic is require to partition the data into different columns of a matrix.", "num_user_post": " 4", "author": "hans"}, {"date": "November 12, 2015 - 5:24 pm", "content": "Hello jklok,Thanks for the feedback!I tried your suggestion of 'thingSpeakPlot(x1,y1,x2,y2)' for 2 series but it gives 'Error using thingSpeakPlot Too many input arguments.'The MATHLAB 'plot' command allows for plotting of multiple vectors in this way, but thingSpeakPlot I think can only handle one x,y pair.  I can use the 'plot' command but the resulting plot is just a static image and isn't as nice as the thingSpeakPlot command because it allows for some interaction (i.e. scale zooming and scrolling of the axis).Any other suggestions?", "num_user_post": " 4", "author": "moballa"}, {"date": "November 13, 2015 - 9:47 am", "content": "thingSpeakPlot accepts matrix according to the docs here - https://thingspeak.com/docs/matlab_visualizations#thingSpeakPlotMight want to try -thingSpeakPlot([x1; x2]', [y1; y2]')Or can be simplified if x1 is the same as x2 -thingSpeakPlot(x1, [y1; y2]')", "num_user_post": " 4", "author": "gamerji"}, {"date": "November 16, 2015 - 8:34 am", "content": "gamerji's comment about the MATLAB visualization function 'thingSpeakPlot' accepting a matrix argument is correct, however, as a warning, when constructed in the above way, the size of the arguments (x1, x2 or y1, y2) must be same.For example, the following MATLAB code does not produce a valid matrix as the dimensions are not uniform:x  = [1; 2];      % column vector with 2 elementsy = 1;                % single scalar elementz = [x y];         % concatenate variables into single matrix>> Error using horzcatDimensions of matrices being concatenated are not consistent.", "num_user_post": " 4", "author": "hans"}]}, {"url": "https://community.thingspeak.com/forum/general/administration/", "posts": [{}, {"date": "November 14, 2015 - 7:41 am", "content": "I have deleted the accounts.", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/general/noob-problem-data-have-the-zero/", "posts": [{"date": "November 9, 2015 - 12:17 pm", "content": "HyI have a Channel but I Write of data using Post (or http://184.106.153.149/update?key=1111111&field1=2) the data have the zero !!!!What happens ifhttps://thingspeak.com/channels/64246What is wrong.Thank you", "num_user_post": " 1", "author": "czio"}, {"date": "November 9, 2015 - 4:17 pm", "content": "czio,czio said http://184.106.153.149/update?key=1111111&field1=2Can you test the above HTTP request in a browser to see if data is being written to your channel? Make sure that you are using a proper Write API Key for the channel that you are trying to write to.Please see the Documentation page 'Update Channel Feed' for more information: https://thingspeak.com/docs/channels#update_feed", "num_user_post": " 4", "author": "hans"}]}]}