{"url": "https://community.thingspeak.com/forum/general/page-3/", "threads": [{"url": "https://community.thingspeak.com/forum/general/chart-view-limited-to-2-hours/", "posts": [{"date": "January 18, 2018 - 1:14 pm", "content": "Hi,     I wonder if someone could solve a problem that the internet has been unable to after two days hunting. I have set up two channels, both have several charts. Data is from temperature sensors with posting times between one hour and fifteen minutes. On one channel the public/private charts are showing data from the last 24 hours, which is OK, but the other channel will only show data from the previous two hours. I have tried to find what the various settings do in the Field Chart Options drop down, but can find no info on that at all. I am sure it is a simple setting, but cannot find it. I also know individual charts can be loaded via the API, but I just want to go the the Public View of my charts.ThanksDoug", "num_user_post": " 2", "author": "pudderz"}, {"date": "January 19, 2018 - 1:17 pm", "content": "In the chart options, try increasing the number for 'Results' or 'Days'. Results has higher priority than days, so erase results if you try to use days.  Please post if that helps.", "num_user_post": " 401", "author": "cstapels"}, {"date": "January 22, 2018 - 6:14 am", "content": "SOLVED. I increased the number of 'results' to 1000, an it increased the display to two daysThanks", "num_user_post": " 2", "author": "pudderz"}]}, {"url": "https://community.thingspeak.com/forum/general/chart-does-not-display-values-between-1-and-1/", "posts": [{"date": "January 12, 2018 - 10:58 pm", "content": "The chart does not seem to display values between 1 and -1, except for 0.I upload data using curl once per minute, and when the value is, e.g. .5 or -.3 nothing is displayed in the chart. I know the data points are being stored on the server because I can see the data by using the data export function:2018-01-13 01:33:02 UTC,570587,.12018-01-13 01:34:02 UTC,570588,.22018-01-13 01:35:02 UTC,570589,.32018-01-13 01:36:02 UTC,570590,02018-01-13 01:37:02 UTC,570591,02018-01-13 01:38:02 UTC,570592,02018-01-13 01:39:02 UTC,570593,-.12018-01-13 01:40:02 UTC,570594,-.12018-01-13 01:54:02 UTC,570608,-.22018-01-13 01:55:01 UTC,570609,-.3None of these values are displayed on the chart, except the 0s. As soon as the value is 1.0 or greater, or -1.0 or less, it is displayed again.Chris", "num_user_post": " 3", "author": "chriscokid"}, {"date": "January 15, 2018 - 1:44 pm", "content": "I think it may have to do with how the data is being interpreted. What if instead of '.1', '.2', etc. it is sent to the server as '0.1', '0.2', etc? ", "num_user_post": " 225", "author": "Vinod"}, {"date": "January 15, 2018 - 10:47 pm", "content": "Yes, that will probably work, but I have to add some extra code to format the numbers since 'bc' doesn't have any way to force leading zeros.In any case, this should be handled as a bug in your parser, since that is a perfectly valid way of specifying a number.Chris", "num_user_post": " 3", "author": "chriscokid"}, {"date": "January 19, 2018 - 10:29 pm", "content": "I can confirm that adding the leading 0, i.e. 0.3 or -0.4, does work and displays properly.Chris", "num_user_post": " 3", "author": "chriscokid"}]}, {"url": "https://community.thingspeak.com/forum/general/iot-data-logger-for-monitoring-power-consumption/", "posts": [{"date": "January 3, 2018 - 11:41 pm", "content": "IntroductionOptimizing power consumption has been a problem for us in the past.For this purpose, one of our developers took the initiative to construct a Data Logger using a WEMOS D1 mini.The purpose of this IoT project was to:Monitor power consumption at the premises.Identify data patterns and use it to reduce utility costs.To eliminate any redundant power consumption.List of Components UsedWEMOS D1 Mini Development Board (Includes ESP8266 WiFi Module)Burden Resistor 33 ohm4051 Multiplexer for the purpose of extending the analog inputs for reading 3 phases1 LED10K ResistorPICAXE-SOCKETWEMOS D1 mini as the Wi-fi capable development board with 4MB flash based on ESP-8266EX.We used Thingspeak for the purpose of data logging, tracking & updating data.It’s an open source IoT analytics service which allows you to have a dashboard for analyzing live data streams in the cloud, coming through your IoT device.Circuit DiagramYou can read the full article here with an in-depth explanation of how this Data Logger was installed on our premises.Feel free to tell us what you think about it. ", "num_user_post": " 1", "author": "AlliedC"}]}, {"url": "https://community.thingspeak.com/forum/general/login-email-gets-scrambled/", "posts": [{"date": "December 12, 2017 - 1:03 pm", "content": "Hi,Does anyone else have a problem with their email getting scrambled in the login page of thingspeak.com?I enter my email and click the green NEXT button. And on the next screen my email address may appear backwards, or it might be just the email name without the @domain.com, or it might be a mangled version of my email name, such as 'vine' instead of 'vince', and sometimes it's 'ecniv' which is 'vince' backwards.It happens about 20% of the time so I have to redo the login or else the login will fail.I have a screenshot of my phone (Android Chrome) if there's a way (cannot find upload). But it also happens on Chrome on the Mac, or Chrome in Linux. I haven't tried Firefox yet.I figure it's some anti-hack thing you guys are doing but it seems to break fairly often at least on Google Chrome.It's been doing this since I started on Thingspeak back in November. Thanks for your help,-Vince", "num_user_post": " 2", "author": "vpatron"}, {"date": "December 12, 2017 - 1:31 pm", "content": "Hi Vince,Can you please send an email to support (at) thingspeak (dot) com with the screenshot so we can investigate?-Vinod", "num_user_post": " 225", "author": "Vinod"}, {"date": "December 12, 2017 - 2:49 pm", "content": "Sent email + screenshot. Thanks Vinod, -Vince", "num_user_post": " 2", "author": "vpatron"}, {"date": "December 28, 2017 - 2:20 pm", "content": "I believe this is resolved.Can you please let us know if you see this issue anymore?", "num_user_post": " 225", "author": "Vinod"}]}, {"url": "https://community.thingspeak.com/forum/general/connection-in-vb-net/", "posts": [{"date": "December 26, 2017 - 5:03 pm", "content": "Hello, I just start exploring possibilitees of thingspeak.I develop system that will have to upload data from sensors by arduino via ethernet and GSM and Lora, and by tablet and by computers from VB.Net software.To start my exploration of thingspeak possibilites I found example to connect in VB.Net to upload data to thingspeak channel, and it works always 2 times and than blocks at the response request, even if I wait 5min between each write. I restart software , and once again it works 2 times.someone has any idea ? here is my sourcecode : Dim WRITEKEY As String = '4UPT95KUFHBGZMZ4' Dim strUpdateBase As String = 'http://api.thingspeak.com/update' Dim strUpdateURI As String = strUpdateBase + '?key=' + WRITEKEY Dim strField1 As String = CStr(No) Dim strField2 As String = CStr(No * 2) Dim strField3 As String = CStr(No * No) Dim strField4 As String = CStr(Math.Sqrt(No))Dim myReq As HttpWebRequest = WebRequest.Create('http://www.contoso.com/') Dim ThingsSpeakReq As HttpWebRequest Dim ThingsSpeakResp As HttpWebResponseTrystrUpdateURI += '&field1=' + strField1 strUpdateURI += '&field2=' + strField2 strUpdateURI += '&field3=' + strField3 strUpdateURI += '&field4=' + strField4ThingsSpeakReq = WebRequest.Create(strUpdateURI) ThingsSpeakResp = ThingsSpeakReq.GetResponse()ThingsSpeakReq = Nothing ThingsSpeakResp = Nothing ThreadReceive = NothingCatch ex As Exception End Try", "num_user_post": " 1", "author": "Armin_38"}]}, {"url": "https://community.thingspeak.com/forum/general/please-correct-my/", "posts": [{"date": "December 19, 2017 - 8:35 am", "content": "Hi everybody!I try to get a dew point' plot (diagram) out of the data from my test channel that successfully represents two fields (humidity and temperature in my garage). It's a pity but I'm not familiar with programming, I just try to write something mine over the pattern is offered in 'Apps' tab at thingspeak.com - below is the text that contains the error(s) in the line that goes 'tempC = thingSpeakRead(readChannelID ... and so on. I just can't understand what that evil compiler wants from poor ignorant user... Please help! % Channel ID to read data fromreadChannelID = 177255;% Humidity Field IDHumidityFieldID = 2;% Temperature Field IDTemperatureFieldID = 1;% Channel Read API Key% If your channel is private, then enter the read API% Key between the '' below:readAPIKey = 'UV3YQVTASG28SIXF';tempC = thingSpeakRead(readChannelID, '1', 'readAPIKey');humidity = thingSpeakRead(readChannelID, '2', 'readAPIKey');b = 17.62;c = 243.5;gamma = log(humidity/100) + b*tempC ./ (c + tempC);dewpoint = c*gamma ./ (b-gamma);display (dewPoint, 'Dew point');% To store the calculated dew point, write it to a channel other% than the one used for reading data. To write to a channel, assign the% write channel ID to the 'writeChannelID' variable, and the write API Key% to the 'writeAPIKey' variable below. Find the write API Key in the right% side pane of this page.% TODO - Replace the [] with channel ID to write data to:writeChannelID = 387198;% TODO - Enter the Write API Key between the '' below:writeAPIKey = 'S1CU0CAF9KCQZYG5';", "num_user_post": " 6", "author": "schabanow"}, {"date": "December 19, 2017 - 9:08 am", "content": "Welcome to ThingSpeak!  Modifying the template code is definitely a good way to get started.  You took out the part that lets the thingSpeakRead function know what you mean by '1'.  I've linked the documentation so you can have a look.  MATLAB functions usually take some standard inputs, and then you need to tell the function if you are adding extra inputs.  Your extras are 'fields' and 'readKey', and the values are 1 and readAPIKey.  The readAPIKey is a variable that holds the data you entered at the top of the script, so it does not get quotes.Try this syntax, and apply the same thing to the next line:tempC = thingSpeakRead(readChannelID, 'fields',1,'readKey', readAPIKey);humidity = thingSpeakRead(readChannelID, 'fields',2,'readKey', 'readAPIKey');Let us know if that works for you.  ", "num_user_post": " 401", "author": "cstapels"}, {"date": "December 20, 2017 - 9:59 am", "content": "Sorry, I haven't any results. It writes errors those I cannot clear out of template offered. Would you please give me a kind of compilable text for this:readChannelID = 177255;HumidityFieldID = 2;TemperatureFieldID = 1;readAPIKey = 'UV3YQVTASG28SIXF';tempC = thingSpeakRead(177255, TemperatureFieldID, 'ReadKey', readAPIKey);humidity = thingSpeakRead(177255, HumidityFieldID, 'ReadKey', readAPIKey);b = 17.62;c = 243.5;gamma = log(humidity/100) + b*tempC ./ (c + tempC);dewpoint = c*gamma ./ (b-gamma);display (dewpoint, 'Dew point');writeChannelID = 387198;writeAPIKey = 'S1CU0CAF9KCQZYG5'- - - - - - - - - -I hope you can understand what I want to do by the text above. Sorry again. I just need a compilable variant, in order to see the differences and understand my mistakes in syntax.", "num_user_post": " 6", "author": "schabanow"}, {"date": "December 20, 2017 - 11:25 am", "content": "Your code is almost complete.thingSpeakRead expects to read from a channel, so the first thing is the channel number.  If its a private channel, you tell the function you are giving it the API key with 'ReadKey' and then you give the read key.  This part you have done fine.  But you also gave it a 1 (or TemperatureFieldID) which it doesn't know what to do with until you tell it.  What you want is to read from field 1 of that channel.  So tell the function what the value 1 is for first.  Add 'fields' before the 1:tempC = thingSpeakRead(177255,'fields', TemperatureFieldID, 'ReadKey', readAPIKey)And the same thing for the next line.  If you fix both, it will compile.  Let us know if it doesn't. I see you also included channel information for writing to a channel at the end, but you aren't calling thingSpeakWrite.  If you are trying to write to a channel, have a look at the doc and the Getting started tutorial for more help with that task.  ", "num_user_post": " 401", "author": "cstapels"}, {"date": "December 20, 2017 - 1:27 pm", "content": "Thank you very much for exhaustive explanation! So firstly I have to give the function a KIND of data, and then - data itself... Sounds logic and clear... After your explanation. ))Below is the text I found among the others on your site and ALMOST managed to adapt to my case. It has been compiled successfully, but in the end I've got pretty strange results that looked improper (20 degs below zero of dew point, huh). Furthermore, my 'dew point' plot represents sth about of 'saw teeth' curve where positive points alternate with its negative 'reflections' across the zero line. Here is the link: https://thingspeak.com/channels/387198/private_showAnd the code itself:****************************readChId = 177255;writeChId = 387198; writeKey = 'S1CU0CAF9KCQZYG5'; [temp,time] = thingSpeakRead(readChId,'Fields',1,'NumPoints',20);humidity = thingSpeakRead(readChId,'Fields',2,'NumPoints',20);tempC = (5/9)*(temp-32);b = 17.62;c = 243.5;gamma = log(humidity/100) + b*tempC./(c+tempC);dewPoint = c*gamma./(b-gamma)thingSpeakWrite(writeChId,[dewPoint],'Fields',[1],...'TimeStamps',time,'Writekey',writeKey);********************************* The last string (especially 'timeStamps.....' and go on) is a kind of mistery for me. What does '...' mean in the end of the last string but one? What is 'TimeStamps'? Is it a function? What it does?", "num_user_post": " 6", "author": "schabanow"}, {"date": "December 21, 2017 - 5:19 am", "content": "WOW it works!Please don't pay attention to previous post.Well I put 'fields' before its argument in both strings with called 'thingSpeakRead', and voila - I've got pretty nice result of 4.9 C of dew point in my garage! Great! But in the last string I didn't specify 'fields' and its argument - nevertheless plot gets its points and everything works well. Why?***********readChannelID = 177255;readAPIKey = 'UV3YQVTASG28SIXF';HumidityFieldID = 2;TemperatureFieldID = 1;writeChannelID = 387198;writeAPIKey = 'S1CU0CAF9KCQZYG5';DewPointFieldID = 1;tempC = thingSpeakRead(readChannelID, 'fields', TemperatureFieldID, 'ReadKey', readAPIKey);humidity = thingSpeakRead(readChannelID, 'fields', HumidityFieldID, 'ReadKey', readAPIKey);b = 17.62;c = 243.5;gamma = log(humidity/100) + b*tempC ./ (c + tempC);dewpoint = c*gamma ./ (b-gamma);display (dewpoint);thingSpeakWrite(writeChannelID, dewpoint, 'Writekey', writeAPIKey);***********", "num_user_post": " 6", "author": "schabanow"}, {"date": "December 21, 2017 - 5:26 am", "content": "And the code above doesn't work without the stringdisplay (dewpoint);The plot doesn't upgrade in this case. ", "num_user_post": " 6", "author": "schabanow"}, {"date": "December 21, 2017 - 5:50 am", "content": "Hahaha... The plot doesn't update itself even with the string 'display (dewpoint)'. It does it only once, when I hit the green button 'Save and Run'. I suspect there's a lack of text in my code... Does the stringdisplay (dewpoint);work in this code? Update: I've understood the situation with plot's updating. I just set 'recurrence' every 5 min, and the problem was solved.Update2: 'display' displays the result in the field below the code field. The question's closed.", "num_user_post": " 6", "author": "schabanow"}]}, {"url": "https://community.thingspeak.com/forum/general/wireless-sensor-tag-product-with-ifttt/", "posts": [{"date": "December 8, 2017 - 6:22 am", "content": "HiI am considering integrating a Raspberry Pi with  Wireless Sensor Tag products (see mytaglist.com) to collect temperature data from around my home and the external local environment with a weather station. This data is stored in a proprietary Cloud but is available via IFTTT.  Does anyone know if I could use IFTTT to reliably connect with ThingSpeak and then use Mathworks for analyses.  Appreciate any insight offeredTx John", "num_user_post": " 1", "author": "jcpreston22"}]}, {"url": "https://community.thingspeak.com/forum/general/thingspeak-licensing-faq/", "posts": [{"date": "December 7, 2017 - 7:55 am", "content": "I am confused about this sentence: 'Free users are limited to 10 million messages (3+ years at minimum update interval'. Is it: I don't need to register again after a year? My free account can last longer than 3 years, right? Does anybody can help me? Many thanks.", "num_user_post": " 2", "author": "peter9x"}, {"date": "December 7, 2017 - 8:17 am", "content": "Your free account can last longer than 3 years, and you do not need to re-register every year.  The '10 million messages limit' refers to storage of the data. You cannot store more than 10 million messages on ThingSpeak with a free account.  If you have one device and you send data to ThingSpeak at the maximum free update interval of 15 seconds, you will hit the 10 million messages after approximately 3 years.  In this case, you will need to remove some of your stored data (download to your local drive for example).  If you are sending data at a slower rate (once a minute or once an hour), it will take longer to reach the 10 million messages limit.", "num_user_post": " 2", "author": "ewetjen"}]}, {"url": "https://community.thingspeak.com/forum/general/licensing-model-to-start-offering-services-to-clients/", "posts": [{"date": "September 28, 2017 - 4:41 am", "content": "Hi There.All my current tests and prototypes for IoT stuff (usually Arduino and Wemos boards) have been doing using ThingSpeak. So far I feel fairly familiar with this platform.I have an specific product that may be suitable for clients. So now I'm starting to consider what would be a proper licensing model for this.If I use the free service, I would have to stay under 4 updates / minute (which is not bad still) but I would have to manage everything under my own account and I wouldn't be able to provide private access to my clients to their own readings (they would have access to all the clients' readings) If I purchase a license ($usd/year), I see that I would be able to update up to once a second, but I don't see how I would manage users. Summarizing, is there any licensing model that allows me to manage different clients, so I have access to design their views, and I can offer them an access to ONLY their own views? Thanks in advance", "num_user_post": " 2", "author": "Eduardo"}, {"date": "November 28, 2017 - 8:50 am", "content": "If you are using ThingSpeak for commercial use, a standard commercial license is required.  There are two options to consider with regard to managing data views for clients. Option 1:  Use ThingSpeak as a back end for data collection and analysis.  In this case, you would collect all your client data under your commercial ThingSpeak account. You would designate all channels as private and only you would be able to see the data.  To share the data and channel views with your clients, you can use the private sharing feature which allows you to share certain channels with email addresses that you specify.  The users will need a ThingSpeak account (free) and will have a read only view of the their data.  Option 2:  Use ThingSpeak as a back end for data collection and analysis.  Again, in this case, you would collect all your client data under your commercial account.  You would then build and host your own front end, and you would manage the user logins to this front end.  You can embed the appropriate ThingSpeak charts behind the login.  This option is more involved, but gives you the flexibility to brand the page as the clients  would be logging into your service. For more details, email thingspeak-sales@mathworks.com.", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/general/free-account-expiration-date/", "posts": [{"date": "September 28, 2017 - 8:41 am", "content": " Hi,I am using free account on thingspeak. Recently I have noticed that on  Account tab there is 'expiration date'.Does it mean that my account will be deleted after this date?Or maybe after this date counter of free messages (for free account there is 3 000 000 limit of messages) will reset?Regardsgc", "num_user_post": " 10", "author": "trach555"}, {"date": "September 29, 2017 - 8:29 am", "content": "For a user with a free account the expiration date is the date when your free allocation of messages per year expires. An allocation of messages will be added to your account on or a few days before your anniversary date. The anniversary date is the date you signed up for Thingspeak or December 5th, 2016, whichever is later. So, as long as you are using less than the allocated number of messages for a free user you should see no interruptions in service. If you exceed the number of messages for a free user's quota per year, your channels will no longer accept messages until more capacity is purchased, or until your anniversary date when a new quota of messages is allocated to you.More details are in the 'license FAQ' linked off this page: https://thingspeak.com/prices", "num_user_post": " 225", "author": "Vinod"}, {"date": "September 29, 2017 - 3:55 pm", "content": "Thanks. ", "num_user_post": " 10", "author": "trach555"}, {"date": "October 23, 2017 - 2:28 pm", "content": "So the fact that now there is a message above all my channels saying:'Your term will expire on December 4, 2017.'Is only a warning, and will disappear after the 5th of December without any data loss?", "num_user_post": " 5", "author": "rico72"}, {"date": "October 23, 2017 - 3:22 pm", "content": "rico72 said So the fact that now there is a message above all my channels saying: 'Your term will expire on December 4, 2017.' Is only a warning, and will disappear after the 5th of December without any data loss?  Correct.Before the expiration date/anniversary date of a free user account, a new unit of messages available to free users (3 million messages/year as of Oct 2017) will be added to your account with a new expiration date for the new unit of messages.  As long as you are using less than the allocated unit of messages/year for a free user there should be no interruption.Note that using more than the allocated quota of free messages per year can result in new data not being accepted. ThingSpeak will warn you about this as well on your channels' page. Ignoring that warning will likely result in any new data not being accepted. The best way to see if your usage rate will result in exhaustion of messages before the expiry date is to look at the 'Monthly Usage Rate' chart on the 'My Account' page. If your estimated monthly usage is high, the bars showing projected messages remaining will end before the expiration date of your unit. Please read the license FAQ for more information about quotas and storage policy for data sent to ThingSpeak.", "num_user_post": " 225", "author": "Vinod"}, {"date": "November 10, 2017 - 4:45 am", "content": "Then it seems to be something is wrong with my account. I have >2.000.000 remaining messages and no new Data is accepted since 31.10.2017. Channel ID: 296793", "num_user_post": " 1", "author": "Meik"}, {"date": "November 10, 2017 - 10:29 am", "content": "Your channel seems to have good deal of data in there today, Nov 10.  Were you able to make new posts recently?  Are you still having trouble with your account?https://thingspeak.com/channels/296793", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/general/you-will-run-out-of-messages-warning/", "posts": [{"date": "November 6, 2017 - 9:41 am", "content": "I have a free account, and today, November 6, 2017, I found this warning on my account page:Based on your current daily usage rate, you will run out of messages on: November 6, 2017.However, I used only 2.4M messages of the available 3M, at a rather steady rate of 2000 messages/day, which did not change recently. In the histogram I see that on my anniversary (Dec 5) I should have more than 2 millions messages still available. I checked the amount of stored data, and it's less than 1M messages (of the 10M available).Could you please help me? Anybody has experience of this message? I need ThingSpeak for my lectures, and I'd be disappointed to have to renounce to it.", "num_user_post": " 2", "author": "augusto"}, {"date": "November 6, 2017 - 11:10 am", "content": "Augusto,If you have only used 2.4 million of the 3 million messages/year for your free account, and your usage rate is such that you think you have sufficient capacity to last you until the anniversary, you may ignore this message for now. We're working on changing the algorithm that calculates the estimated exhaustion date and you will see changes in the next day or two.-Vinod", "num_user_post": " 225", "author": "Vinod"}, {"date": "November 6, 2017 - 11:14 am", "content": "Thank you Vinod", "num_user_post": " 2", "author": "augusto"}]}, {"url": "https://community.thingspeak.com/forum/general/weird-red-edge-on-my-photos/", "posts": [{"date": "November 4, 2017 - 5:39 am", "content": "Hi,When I tried to put images on my site, I was successful but the problem is, every single image have a red block on the top left corner and I am not sure what is the problem? Is it CSS or HTML problem??", "num_user_post": " 4", "author": "alireza-res"}]}]}