{"url": "https://community.thingspeak.com/forum/general/page-9/", "threads": [{"url": "https://community.thingspeak.com/forum/general/is-there-a-maximum-number-of-records-that-can-be-written-to-a-channel/", "posts": [{"date": "November 4, 2015 - 12:36 pm", "content": "Is there a maximum number of records that can be written to a channel?   For example, if I want to record the light level every 5 minutes and write that to a channel, how far back in time can I hope my data to be available?", "num_user_post": " 1", "author": "kolban"}]}, {"url": "https://community.thingspeak.com/forum/general/customization-of-github-code/", "posts": [{"date": "October 24, 2015 - 3:07 am", "content": "I am working on a startup project and I want to use the thingspeak github code and customize it according to my business requirements.After customization, is it licensed to use it in my production and run in my own cloud setup?", "num_user_post": " 5", "author": "cherry"}]}, {"url": "https://community.thingspeak.com/forum/general/questions-about-thingspeak-licence/", "posts": [{"date": "April 18, 2014 - 3:37 am", "content": "Hi,I have tried to contact ioBridge, but haven't received any answer. I would like to know about licencing in case of using Thingspeak on my own server ( using features: thinghttp, react, and the main functions...). Do you have licence fee? Can you give support for the install? What are the requirements on the HW side?Thanks!", "num_user_post": " 63", "author": "vespapierre"}, {"date": "April 18, 2014 - 4:47 pm", "content": "Hi,Thanks for your request, we also received your email, Hans from ioBridge will follow up with you.lee", "num_user_post": " 457", "author": "lee"}, {"date": "April 19, 2014 - 7:19 am", "content": "Great to hear this, Thanks!", "num_user_post": " 63", "author": "vespapierre"}, {"date": "April 24, 2014 - 4:30 pm", "content": "Hi,I haven't received any answer.Can you contact me please?Thanks a lot!", "num_user_post": " 63", "author": "vespapierre"}, {"date": "April 24, 2014 - 4:42 pm", "content": "Sorry we had a lot of licenses inquires and I thought I got to yours. Following up now.", "num_user_post": " 402", "author": "Hans"}, {"date": "October 9, 2015 - 6:41 pm", "content": "Hi Hans, I am interested finding out the licensing detail. Can you please provide information to me as well?", "num_user_post": " 1", "author": "wyung"}]}, {"url": "https://community.thingspeak.com/forum/general/forum-syntax/", "posts": [{"date": "September 14, 2015 - 8:00 pm", "content": "Does anyone know how to post [code] block on this forum? Is there any special syntax? I tried to post a piece of code containing some backslash like the ones for carriage return + line feed and the were converted to real carriage return + line feed.", "num_user_post": " 13", "author": "Michel_J"}]}, {"url": "https://community.thingspeak.com/forum/general/mathworks-login/", "posts": [{"date": "August 28, 2015 - 1:24 pm", "content": "Why am I being asked for my Mathworks login and password?  My account is sensitive, I don't trust entering my credentials on Thingspeak?Great, now Tingspeak can see my Mathworks password? Havent you guys ever heardof OAUTH?If Thingspeak is part of Mathworks, does Mathworks even take security seriously?I'm trusting to enter Mathworks password on Mathworks domain, NOT Thingspeak.", "num_user_post": " 1", "author": "georg9959"}, {"date": "August 28, 2015 - 5:05 pm", "content": "Hi – thanks for raising this question.  MathWorks and ThingSpeak have a collaboration to provide hosting of ThingSpeak on MathWorks network.  We and MathWorks have worked to secure your ThingSpeak and MathWorks account and data. The use of a MathWorks account is optional. You can choose to use a ThingSpeak.com account as an alternative.", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/general/missing-channel-locations/", "posts": [{"date": "August 4, 2015 - 9:38 pm", "content": "Hello , recently I can't view the channel location, on my personal channel and to the channels of other users. In my channel, the longitude and latitude parameters are filled and fixed.When I copy and paste the link contained in the tags 'iframe' it appears correctly.Only in thingspeak.com it is not loaded into the default iframes.Someone has the same problem or can help ? Thank you.", "num_user_post": " 2", "author": "Fat"}, {"date": "August 5, 2015 - 8:30 am", "content": "Hi,The channels appear fine on our side, is it possibly you installed a new browser extension that is blocking some HTTP requests?  Can you try viewing your channel with another browser?lee", "num_user_post": " 457", "author": "lee"}, {"date": "August 5, 2015 - 9:29 am", "content": "Hi lee,The problem occurs when I use firefox (win7/mac/linux),  safari (mac/ipad) or Chrome (win7)  without 'blocking extensions'.Maybe is the browser version, because some friends told me that sometimes the map appears, sometimes not.  I will check this issue using others systems too. Thanks for your help. If you want, please, close this topic.", "num_user_post": " 2", "author": "Fat"}]}, {"url": "https://community.thingspeak.com/forum/general/missing-data-ipd10/", "posts": [{"date": "August 4, 2015 - 5:57 pm", "content": "Hi,I m Building and application that has 1 channel and uses all 8 fields.However fields get updated by 4 different devices, each updates 2 fields specifically.No 2 devices update the same fields.The Update rate is almost 1 minute for all devices sometimes 1:30.I'm loosing some data points. I thought it was because of the update rate but im well over the 15 second limit.Im thinking at some point, the devices sync and all 4 try to post at the same time.Ive only tested my application with 2 devices and its already loosing data... i think when i put the other 4 things will get worse.Thanks,G", "num_user_post": " 8", "author": "gabrielb"}, {"date": "August 5, 2015 - 8:34 am", "content": "Hi,Yes it would make sense that the data wouldn't be saved if the devices attempted to post within 15 seconds of each other.  I would suggest that you separate your application into four channels, one for each device.lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/general/ts-with-multiple-users/", "posts": [{"date": "July 28, 2015 - 9:12 pm", "content": "Hello everyone,We are working on the development of a home device using ESP8266. We are looking for an IoT Cloud Service / System that could handle all the future users our devices may have.Is it possible to install a ThingSpeak server in a cloud computing like AWS and handle all the accesses from our customers devices? Is this system able of that if, lets say, we sell hundreds or thousands (I hope) units? Each of our customers must be able to configure each device and operate them through our system, having their login, dashboard, etc. Some of them having more than one device.If a ThingSpeak server is not why we should be looking for, could you please point a professional IoT service we could use instead?Thank you very much!", "num_user_post": " 4", "author": "alatza"}, {"date": "July 29, 2015 - 9:19 am", "content": "Hi,Yes it is possible to install a private installation of ThingSpeak, and have customers that can be administered via an admin interface.  This system would support hundreds or thousands of devices if it was installed on the correct hardware.  Each customer would be able to perform any action that a ThingSpeak user can, except for the ThingSpeak Apps (they aren't available in the open source version).lee", "num_user_post": " 457", "author": "lee"}, {"date": "July 31, 2015 - 8:09 pm", "content": "Thank you Lee.I will start playing with TS then.", "num_user_post": " 4", "author": "alatza"}]}, {"url": "https://community.thingspeak.com/forum/general/read-limit/", "posts": [{"date": "July 23, 2015 - 7:18 pm", "content": "Hi,How fast can we read back info from a channel?For example: 'https://thingspeak.com/channels/47445/feeds?results=1'Its not quite clear on the documentation. I want to write code to act as real time as possible on data from multiple channels...So if i wanted to get data from all 8 fields on 10 channels (as with the GET above) how fast/often can I poll the channel? Think of a micro controller stuck in a loop doing GET commands getting the info from Channels 1 to 10 sequentially.Thanks G.", "num_user_post": " 8", "author": "gabrielb"}, {"date": "July 24, 2015 - 8:44 am", "content": "Hi,We've never explicitly defined any limits on this, but I'd recommend polling once per second or at any slower frequency.lee", "num_user_post": " 457", "author": "lee"}, {"date": "July 24, 2015 - 9:54 am", "content": "Hi Lee,I think 1 second is WAY more than i need...I love this place.... 'so much room for activities!'Thanks.", "num_user_post": " 8", "author": "gabrielb"}]}, {"url": "https://community.thingspeak.com/forum/general/cyclic-upload-error/", "posts": [{"date": "July 20, 2015 - 4:49 pm", "content": "Hi All,first post here.I have developed a Thing to monitor my room temp and humidity - updates every 30 seconds...(just to see if that resolution was possible)Ive noticed that every 1 or 2 hours,  data is not uploaded for about 20 minutes each time.Sometimes its once an hour it looses data, others its once every 2 hours.... and the period it looses data is from 1 minute up to 20...20 minute blackouts reoccurring every hour is the most frequent scenario.in the grand scheme of things, this is not relevant, but if further down the line i lower my data rate, i fear i might lose and important event/datapoint.Is this normal for other users? Im trying to see if this is on my side or Thingspeak..Setup is with a  PIC and an ESP8266 (maybe thats why).Thanks,G.", "num_user_post": " 8", "author": "gabrielb"}, {"date": "July 21, 2015 - 11:34 am", "content": "Hi,I would suggest investigating the issue on your side further.  The ThingSpeak servers all seem fine, and we haven't seen any recent problems with uptime or data loss.lee", "num_user_post": " 457", "author": "lee"}, {"date": "July 22, 2015 - 5:41 pm", "content": "Hi Lee, thanks for your reply, is there a 'busy ...' response from your servers at any point?", "num_user_post": " 8", "author": "gabrielb"}, {"date": "July 23, 2015 - 9:43 am", "content": "Hi,No, you shouldn't be receiving a busy response from the ThingSpeak servers, so I'm guessing that the problem is somewhere on your local network.lee", "num_user_post": " 457", "author": "lee"}, {"date": "July 23, 2015 - 7:06 pm", "content": "Well this issue is resolved... its a ESP8266 problem... every so often it locks up and you have to make it hard reset or you stay locked up for however long it decides.... minutes.. hours... its on the web... google 'ESP8266 busy p...' or 'ESP8266 busy s...'Thanks for your help!G", "num_user_post": " 8", "author": "gabrielb"}]}, {"url": "https://community.thingspeak.com/forum/general/asking-vs-telling/", "posts": [{"date": "July 4, 2015 - 7:06 am", "content": "Am I thinking about this wrong?  My Android phone updates ThingSpeak with various commands based on it's location.  The Netduino is ASKING ThingSpeak every minute to see if it needs to do anything.  This seems very inefficient to me and I think ThingSpeak should be TELLING the Netduino to do something.Is there a command/protocol I'm missing?  Can someone point me in the right direction, I can't believe the NEST is constantly asking if the temperature should be changed?Thanks", "num_user_post": " 7", "author": "Cyn"}, {"date": "July 6, 2015 - 8:49 am", "content": "Hi,You are correct in that the current model is for clients to pull data from ThingSpeak.  We don't have any push mechanisms implemented for device control, but may add push capabilities in the future.lee", "num_user_post": " 457", "author": "lee"}, {"date": "July 6, 2015 - 4:17 pm", "content": "Thanks for the PUSH hint", "num_user_post": " 7", "author": "Cyn"}]}, {"url": "https://community.thingspeak.com/forum/general/two-questions-about-accumulating-data/", "posts": [{"date": "May 30, 2015 - 2:49 pm", "content": "I want to use ThingSpeak to record my mileage from exercise bike used for PC racing. I have two questions:1. For various reasons I would rather not accumulate the data in the microcontroler or my PC. That is why I am not sending a daily sum of kilometers, but rather impulse for each kilometer. Am I correct in thinking that there is no way to tell ThingSpeak such data should be added together (for a daily result)?2. If I am right about 1., then I would like at least to use a chart that would show me the daily sum. However, I cannot seem to be able to configure the charts in this way - the parameter 'daily', as described in the documentation, is missing from the chart setup dialog window... Can I configure it differently?", "num_user_post": " 1", "author": "Jabberwock"}, {"date": "June 2, 2015 - 11:18 am", "content": "Hi,1.  You can use the 'sum' parameter with a value of 1440 (minutes in a day) to get this result, for example: https://thingspeak.com/channels/12370/fields/1.json?sum=1440&days=3&round=2 .2. Similarly, in your chart you can set the 'sum' to 1440 to view this data: https://thingspeak.com/channels/12370/charts/1?sum=1440&days=3&round=2&width=800&height=400 .lee", "num_user_post": " 457", "author": "lee"}]}]}