{"url": "https://community.thingspeak.com/forum/matlab/page-7/", "threads": [{"url": "https://community.thingspeak.com/forum/matlab/how-to-call-matlab-function-in-thingspeak-matlab-analysis/", "posts": [{"date": "October 15, 2015 - 2:40 am", "content": "Hi Helper,I am a total green hand on Matlab stuff and I have a question about how I can call a MATLAB function in Thingspeak Matlab Analysis? For example, I have a Matlab function as below:  Function  [ data1, data2, parameter1, parameter2] = calculate_something(parameter1, parameter2, parameter3).......Is there a way that I can call this function in Thingspeak Matlab Analysis's Matlab code?This is very similar to call 'ThingspeakRead' function in the current Matlab Analysis panel window. I am wondering if I can call a customized function in the panel window.Thanks a lot for any comments in community.Regards", "num_user_post": " 5", "author": "jimmyjiangyq"}, {"date": "October 21, 2015 - 2:34 pm", "content": "Hi jimmyjiangyq,At present, you will not be able to call custom functions from either the MATLAB Analysis App or the MATLAB Visualization App. Both the Apps only allow a MATLAB script to be written and this script can only call functions already defined in MATLAB. We will consider this capability for a future release.As a workaround, you can move the logic in the 'calculate_something' function into each MATLAB Analysis/Visualization App that requires it, as a script.Thanks,Adarsh", "num_user_post": " 62", "author": "Adarsh_Murthy"}, {"date": "October 22, 2015 - 1:34 pm", "content": "If you have your function publicly hosted somewhere, then you can try urlwrite as follows -urlwrite('http://pastebin.com/raw.php?i=FYQbPHWH','total.m');total(23,10)Hope that helps.", "num_user_post": " 4", "author": "gamerji"}, {"date": "October 22, 2015 - 7:45 pm", "content": "Hi Adarsh and gamerji,Thanks a lot for your comments. It seems like I may need to use standalone Matlab platform to do such task.Jimmyjiangyq", "num_user_post": " 5", "author": "jimmyjiangyq"}, {"date": "October 31, 2015 - 8:46 pm", "content": "I am also facing problem using if function. I am getting current time using clock function. Then I want to do some check on time and based on the time I want to feed data to new channel. It appears if function does not work at all.Update: I did not write end statement. It works.", "num_user_post": " 8", "author": "rkgarg"}, {"date": "November 2, 2015 - 8:10 pm", "content": "@Adarsh_Murthy - if you are considering feature requests for future releases can I suggest passing URL parameters through to the matlab environment?   This would allow more generic and re-usable  code since you could specify a channel or field number in the URL and have matlab process it rather than have to hard-wire it into each block.", "num_user_post": " 271", "author": "rw950431"}, {"date": "November 3, 2015 - 10:21 am", "content": "This is a good idea for enhancing our MATLAB functionality. We will take a closer look at it. Thanks!", "num_user_post": " 402", "author": "Hans"}, {"date": "November 3, 2015 - 10:54 am", "content": "Thanks for sharing your idea rw950431!", "num_user_post": " 62", "author": "Adarsh_Murthy"}]}, {"url": "https://community.thingspeak.com/forum/matlab/how-to-plot-line-with-different-line-style-part-way-through/", "posts": [{"date": "October 18, 2015 - 1:46 pm", "content": "Hello,I have a few devices sending 3 variables to thingspeak every 30 minutes... device id, temperature, and mode.  I need some help making one graph to display the following:1) a separate line plotted on the same graph for each deviceID2) for each line plotted, I would like the line style to change from a solid linestyle when mode is 1 to a dashed linestyle when mode is 0?3) y axis should represent temperature and x axis should represent the timestampI'm new to thingspeak and matlab...the best I have been able to achieve so far is one line on a graph but it has all temperatures and mode from all devices...I haven't been able to separate the lines by deviceID and have no clue if matlab can plot a line using different linestyles *partway* through the line.Any gurus out there that can point me in the right direction?Thanks,Marco", "num_user_post": " 4", "author": "moballa"}, {"date": "October 19, 2015 - 8:38 am", "content": "moballa,It is possible to plot multiple lines on a single graph in MATLAB using the 'plot' function:http://www.mathworks.com/help/matlab/ref/plot.htmlAccording to the documentation, you would provide your data to the function as a column vector, or matrix, depending on the number of lines to plot. Lines can be assigned a line style or LineSpec. At this time, it does not appear possible for segments between points to be different LineSpecs. However, it is possible to break the data down into more line segments and assign LineSpecs to each line segment. See the following example in the documentation:http://www.mathworks.com/help/matlab/ref/plot.html?searchHighlight=plot#btzpndl-1", "num_user_post": " 4", "author": "hans"}, {"date": "October 19, 2015 - 10:29 am", "content": "Hi,Plotting is a huge subject in MATLAB:  See the doc for the plot command here:http://www.mathworks.com/help/matlab/ref/plot.htmlThere are lots of ways to do this, but here's something to get you started:% Generate some datad = table;d.timestamp = (datetime('now') - minutes(240):minutes(30):datetime('now'))';d.temperature = [23;45;56;24;44;56;23;43;55];d.id = [1;2;3;1;2;3;1;2;3];d.mode = [1;1;1;1;1;1;0;0;0];d% Plot by sensor IDplot(d.timestamp(d.id == 1),d.temperature(d.id == 1),...    d.timestamp(d.id == 2),d.temperature(d.id == 2),...    d.timestamp(d.id == 3),d.temperature(d.id == 3))However, it doesn't solve your 'dotted when mode is 1' request.  You can do this, but it'll take some more work.  You'll need to plot the non dotted and dotted separately.  So, you'll have 6 lines in your plot.-Rob", "num_user_post": " 47", "author": "Rob Purser"}]}, {"url": "https://community.thingspeak.com/forum/matlab/are-all-matlab-functions-available-in-thingspeak-matlab-apps/", "posts": [{"date": "October 16, 2015 - 4:58 am", "content": "I'm new to MATLAB but have found a MATLAB function stairs() that appears to be able to plot the step line graph that is the form in which I'd like to visualize my data.Is the stairs() function available to me in the MATLAB visualisation app?If the answer is 'yes', I'm happy to have a go at finding out for myself how to do so but I don't want to waste time if it's not possible 🙂Looking forward to becoming another happy ThingSpeak (and MATLAB) user!", "num_user_post": " 1", "author": "ALikelyLad1942"}, {"date": "October 16, 2015 - 9:15 am", "content": "Yes. It is possible to use the MATLAB plotting function 'stairs' in ThingSpeak.", "num_user_post": " 4", "author": "hans"}]}, {"url": "https://community.thingspeak.com/forum/matlab/matlab-analysis-and-visualizations-forbidden-to-me/", "posts": [{"date": "October 12, 2015 - 4:20 pm", "content": "Hi Thingspeak,I think this is a 'problem' for an administrator that knows who can answer.Next thank you in advance to who can help me.Also english is not my mother language so I hope you can understand me (and please, do not laugh a lot 🙂I will use the ESP8266 everywhere in my house and send data to Thingspeak and see there some processeddata visualizations.After sign in, in My Channels I can click and pick one of the channelsIn the channel picked I can use the 5 tabs and click the 5 buttons (3 green).The trouble begins in the APPS window https://thingspeak.com/appsI tried succefully Chart With Multiple Series and Google Gauge in the Plugins link/boxWhen clicking MATLAB Analysis or Visualizations I get the NEW button and then the choices and examplesWhen clicking the CREATE button I get the next window BUT the MATLAB Code box is empty with a little rotatingcircle indicating to wait for something that NEVER happens. I can not write anything there either.Also in React the same behaviorThe only thing I can do is to Delete this windowI have this problem since the early days of OctoberWhat am I doing wrong?HS", "num_user_post": " 91", "author": "piajola"}, {"date": "October 13, 2015 - 1:31 am", "content": "Did you try to clear your browser history, restart your browser and try again?  Sometimes this helps..", "num_user_post": " 271", "author": "rw950431"}, {"date": "October 13, 2015 - 4:03 am", "content": "Hi everybody,I am facing exactly the same problem as piajola : unable to start Matlab with the same symptom.@rw950431 : a chrome session with a crystal clear history doesn't change anything.Please, Thingspeak team, help us !Alain", "num_user_post": " 3", "author": "aby"}, {"date": "October 13, 2015 - 8:48 am", "content": "aby and piajola,Thank you for reporting this issue. To further diagnose the problem, can you tell us which browser and version you are using? Older browsers like Internet Explorer 9 are not fully supported.", "num_user_post": " 4", "author": "hans"}, {"date": "October 13, 2015 - 9:52 am", "content": "Thank you jklol for your quick answer,You're right, it is actually a question of browser in which the MatLab Editor can't open :For me :It doesnt work with the latest releases of Firefox (41.0.1) and Chrome (45.0.2454.101 m) running on Windows8It works with the latest one of IE 11(IE 11.0.9600.18036) running on the same computerI hope it will be useful", "num_user_post": " 3", "author": "aby"}, {"date": "October 13, 2015 - 10:53 am", "content": "My tribulations:In w7-chrome Versión 45.0.2454.101 m-ie            Versión 11.0.8600.18015In my Android 4 smartphone via wifi same router so I think same IP to mathworks-CM Browser   cheetah mobile inc    5.20.10-UC Browser   ucweb inc                       10.7.0Also tried in W8Chrome and Ie but I am starting to use W8 so I do not know versions because I do not have that machine at handAll same odd behavior little waiting circle in MATLAB boxMy guess is that mathworks is blocking my IP ... I access Thingspeak server and I think the MATLAB box is resolved in Mathworks server who refuses my IP (if sent) ... just a wild and uninformed guess ...I have not tried to update my IE I do not use it but later I will try it for the cause@aby lucky you at least you can use IE @jklol Thank you very much from this lost and alone soul ... a ray of hope to me HSPS @jklol I will try anything you ask for", "num_user_post": " 91", "author": "piajola"}, {"date": "October 13, 2015 - 11:13 am", "content": "To be exact, I have tested Chrome  on Vista Pro, not on W8Alain", "num_user_post": " 3", "author": "aby"}, {"date": "October 13, 2015 - 6:00 pm", "content": "This might also happen if javascript cannot run on the page. Can you see if you have extensions that are blocking any javascript from running on the page such as NoScript? If you don't see any that might be causing the issue, can you list all the extensions that are installed on Chrome here?", "num_user_post": " 4", "author": "gamerji"}, {"date": "October 13, 2015 - 7:12 pm", "content": "@gamerjiRemember we are 2 Aby and me. It seems NOT exactly same cause only the resultHe can use IE 11In chrome://extensions-Avast Online Security  10.2.0.190-Documentos de Google sin conexión 0.5 -- Offline Google docs-Google Docs 0.9-Hojas de cálculo de Google 1.1  -- Google Spreadsheets-Presentaciones de Google 0.9 -- like Office PowerPointI think that I did not install these extensions (at least not on purpose)Also remember I use Chart With Multiple Series & Google Gauge in the Plugins link/boxThat is javascript, right?HS", "num_user_post": " 91", "author": "piajola"}, {"date": "October 14, 2015 - 9:43 am", "content": "Extensions can block some javascript, but allow others. Not sure but in your case it looks like Avast Online Security could be the issue.Can you try accessing the MATLAB apps/visualizations in chrome without these extensions? You can try using incognito mode in Chrome or start chrome with the --disable-extensions flag.", "num_user_post": " 4", "author": "gamerji"}, {"date": "October 14, 2015 - 5:32 pm", "content": "@gamerjiWell ... nothing newAll the same behavior ... little waiting circle every try. Normally I use Chrome in incognito mode.I think I had Avast extension always disabled because I tried it enabled and disabled.Enabled has some warnings about blocked things I did not saw before.Also tried disbling all Avast shields directly in Avast (with respective warnings and redsigns the world is ending!)HS", "num_user_post": " 91", "author": "piajola"}, {"date": "October 15, 2015 - 2:58 pm", "content": "Hi... we made some updates to the editor window to reduce the file size and load time. Can you try again and see if you get better results?Thanks,Hans", "num_user_post": " 402", "author": "Hans"}, {"date": "October 15, 2015 - 4:45 pm", "content": "@Hans,10:30 my time, about 4+ hours ago, checking with my smartphone via Chrome I get the little waiting circle and after some 10 seconds suddenly the box is filled with code!! Fantastic ... so I tried to edit the code and it worked So next ... try in the PC. When started I get a window saying to install Windows 10 free! so now I have W10 in my PC and working Chrome with MATLAB Analysis working now. A lot of changes at same time, so you have to guess what the problem was.I will try MATLAB Visualizations next and report here ... also I will report the results of my ventures in MATLAB in ThingspeakHans, say THANK YOU VERY MUCH to yourself and  all the persons involved in my happiness I hope this is permanent to continue and finish my project.HS", "num_user_post": " 91", "author": "piajola"}]}, {"url": "https://community.thingspeak.com/forum/matlab/retrieve-last-value-for-a-specific-field/", "posts": [{"date": "October 13, 2015 - 8:59 pm", "content": "I need to be able to retrieve the last value written to a specific field along with its timestamp.  I have no way of knowing if the field was written to a minute ago or 20 days ago.  It's entirely possible there are 8000 NaN values between now and that last write so I can't reliably read in an array and search for the data.  I was able to get the value using the URLfilter (url:https://thingspeak.com/channels/666/fields/2/last.json?api_key=BLECHIMTIREDOFFLAILING) but I can't see how I can retrieve the date/time.I don't suppose there's a simple name/value pair for 'last?'  Or perhaps a workaround?  I need to retrieve two or three values from the same channel and unfortunately it's not possible for me to split them up into their own dedicated channels.thanks,Brad", "num_user_post": " 9", "author": "AYAduino"}, {"date": "October 13, 2015 - 10:19 pm", "content": "Brad, Try 'webread' instead of urlfilter. This will allow you to get all of the data fields inside of last.json Hans", "num_user_post": " 402", "author": "Hans"}, {"date": "October 14, 2015 - 6:25 pm", "content": "Thanks, exactly what I needed. Brad", "num_user_post": " 9", "author": "AYAduino"}]}, {"url": "https://community.thingspeak.com/forum/matlab/fast-fourier-transform-and-moving-average-in-mat-lab/", "posts": [{"date": "October 11, 2015 - 1:06 am", "content": "Hey,I recently joined Thingspeak.com and I want to log voltage and current reading and measure up the 10th harmonic hence I am wondering if anyone knows how to perform the fast Fourier transform of data posted to Thingspeak.com. I am monitoring a like that expects Dc current only hence I would like to implement a moving average filter if it has any disturbances. Any help or suggestion will be highly appreciated", "num_user_post": " 2", "author": "muunduk@gmail.com"}, {"date": "October 11, 2015 - 8:04 pm", "content": "hi, You could use MATLAB Analysis app in ThingSpeak to do the fast fourier transform of data. You would need to read the data from your ThingSpeak channel via ThingSpeakRead API. Here are links to relevant documentation: 1. MATLAB Analysis: https://thingspeak.com/docs/matlab_analysis#matlab_analysis2. ThingSpeakRead: https://thingspeak.com/docs/matlab_analysis#thingSpeakRead3. FFT using MATLAB: http://www.mathworks.com/help/matlab/ref/fft.htmlThanksAkhila", "num_user_post": " 21", "author": "akhila"}, {"date": "October 13, 2015 - 7:40 pm", "content": "Hey akhilaThanks for this really helped, I managed to read my data and plot a graph of the data in thingspeak by usingthingSpeakPlot(data);  but i am not able to do the fft, if you know the syntax on how to perform the fft , please help.ThanksMuundu", "num_user_post": " 2", "author": "muunduk@gmail.com"}, {"date": "October 14, 2015 - 9:41 am", "content": "Hi,Like Akhila commented earlier, there's a good discussion of how to use the FFT function in MATLAB.  See the link she posted.  There's also a good discussion here: http://www.mathworks.com/matlabcentral/newsreader/view_thread/27009Typically, people are really interested in the Power Spectral Density, rather than the true FFT -- the topic above discusses that, and wikipedia has a lot of good information.-Rob", "num_user_post": " 47", "author": "Rob Purser"}]}, {"url": "https://community.thingspeak.com/forum/matlab/annoucing-coursera-mooc-introduction-to-programming-with-matlab-starts-october-5th/", "posts": [{"date": "September 23, 2015 - 2:18 pm", "content": "If you are interested in getting a more in-depth introduction to MATLAB, this Vanderbilt MOOC is excellent.https://www.coursera.org/course/matlabThis is an introductory college-level course in computer science for engineering and science students. However, it is also suitable for high school students who are interested in programming. The material assumes no background in mathematics beyond the standard high school curriculum. Students taking the course will get a MATLAB license free of charge for a three-month period. Students who successfully complete this course will:* become familiar with general concepts in computer science* gain an understanding of the general concepts of programming* obtain a solid foundation in the use of MATLABHighly recommended!-Rob", "num_user_post": " 47", "author": "Rob Purser"}]}, {"url": "https://community.thingspeak.com/forum/matlab/send-info-to-a-different-field/", "posts": [{"date": "September 20, 2015 - 12:12 am", "content": "Hi all,My first post and am new to matlab and thingspeak so hope my code is easy to fix.Basically I need to read from fields 1 & 2 then send the difference to field 3.When I run my code below I keep getting this error messageError using thingSpeakWriteWait for 15 seconds since the last update was completed before requesting another.My code% Channel ID to read data fromChannelID = 48915;% Field index IDPortFieldID = 1;StbdFieldID = 2;ListFieldID = 3;% API keywriteKey = 'OQQMWYDW2J5WLAJQ';% Read Port and stbdPortVal = thingSpeakRead(ChannelID, 'Fields', PortFieldID);StbdVal = thingSpeakRead(ChannelID, 'Fields', StbdFieldID);% Calculate differenceList = PortVal - StbdVal;thingSpeakWrite(ChannelID, List, 'Fields', 3, 'WriteKey', writeKey)", "num_user_post": " 6", "author": "hmslouis"}, {"date": "September 21, 2015 - 7:53 am", "content": "Hi hmslouis,ThingSpeak implements a 15 sec limit between consecutive updates to a channel. Therefore, if your fields 1 and 2 on channel 48915 are being updated once every 15 seconds, then the update to field 3 from your MATLAB code will be within 15 seconds of the last update to (fields 1 & 2 on) channel 48915. Therefore, thingSpeakWrite function generates an error. In such a case, I would create a new channel to store the difference between field 1 and field 2. This would avoid the update rate limit.Example code - I have renamed channelID to ReadChannelID and added WriteChannelID to store the ID of the new channel that the difference data needs to be written to. I have also set the difference data to be written to field 1 of the new channel instead of field 3:% Channel ID to read data fromReadChannelID = 48915;WriteChannelID =% Field index IDPortFieldID = 1;StbdFieldID = 2;ListFieldID = 3;% API keywriteKey = ;% Read Port and stbdPortVal = thingSpeakRead(ReadChannelID , 'Fields', PortFieldID);StbdVal = thingSpeakRead(ReadChannelID , 'Fields', StbdFieldID);% Calculate differenceList = PortVal - StbdVal;thingSpeakWrite(WriteChannelID , List, 'Fields', 1, 'WriteKey', writeKey)- Adarsh", "num_user_post": " 62", "author": "Adarsh_Murthy"}, {"date": "September 21, 2015 - 10:51 pm", "content": "Hi Adarsh,Thanks so much for your explanation - that make perfect sense now.I set up a new channel and send the data there now and the error is gone, which is great.When I check the data in the new channel however there is nothing there.Do I need to do something for this code to loop so that the new data will show up in the new channel?Thanks heapsLouis", "num_user_post": " 6", "author": "hmslouis"}, {"date": "September 21, 2015 - 11:00 pm", "content": "Hi Louis,The easiest way to do this would be to create a React ( https://thingspeak.com/docs/react ) which is connected to your MATLAB analysis.  Every time new data is written to your original channel, React will automatically run the MATLAB code and write to your derived channel via thingSpeakWrite.lee", "num_user_post": " 457", "author": "lee"}, {"date": "September 22, 2015 - 1:22 am", "content": "Thanks Lee,I'll do some more reading and give it as go.If I'm right my process flows like this;1. Photon 1 reads pressure to field 1 on my data collection channel2. Photon 2 reads pressure to field 2 on the same data collection channel3. React senses a change in values of field 1 above and runs Matlab analysis4. Matlab analysis reads in the 2 values above and sends them to a new channel5. The new channel data is posted via a google gauge pluginDoes this make sense.Cheers - thanks again for your help.Louis", "num_user_post": " 6", "author": "hmslouis"}, {"date": "September 22, 2015 - 2:33 am", "content": "Hi all,I think the whole loop works better for me by using separate channels as opposed to sending info to different fields within the same channel.I'll test further but for my application I need more frequent feeds and less storage of data.Is there a paid version or equivalent service that reads every 5 seconds but stores much less data ( maybe the previous 5 - 10 readings)?For my current application I only need to know what is happening right now and the past is not so relevant any more.Am loving the learning curve and the flexibility of thingspeak and can't wait to set my little project up.Cheers,Louis", "num_user_post": " 6", "author": "hmslouis"}, {"date": "September 22, 2015 - 9:29 am", "content": "Hi Louis,Yes you've got the workflow correct, I'm glad that you seem to have things working!No, we don't have a paid version that would allow updates to a single channel at a more frequent rate, but it is something we're considering for the future.lee", "num_user_post": " 457", "author": "lee"}, {"date": "September 22, 2015 - 5:25 pm", "content": "Thanks Lee,All working well now.The other way of achieving a more frequent output for my project would be to alter the React to include multiple parameters.For example having either of two conditions met (e.g. if channel X field>0 or if channel Y field>0).I tried to make 2 separate Reacts but it wouldn't allow it.Currently I can setup the 2 feed channels to update (every 15 seconds) but have them set up to alternate thereby sending a value every 7-8 seconds.This frequency of data would be ideal for me. But the React on only one channel gets me back to reading only every 15 seconds.Is my understanding correct and if so might there be another work around for me?Cheers,Louis", "num_user_post": " 6", "author": "hmslouis"}, {"date": "September 22, 2015 - 10:25 pm", "content": "Hi Louis,An alternative could be to set React to update on every data insert, and run a MATLAB analyses each time.  You could check both conditions in MATLAB and then write to the derived channel if necessary.If you're ok with delayed data, you can also set a TimeControl to run every 5 minutes and perform the MATLAB analysis.lee", "num_user_post": " 457", "author": "lee"}, {"date": "September 23, 2015 - 4:00 am", "content": "Thanks again Lee,Yes I've set it up to react on every data insert.All working well.Cheers,Louis", "num_user_post": " 6", "author": "hmslouis"}]}, {"url": "https://community.thingspeak.com/forum/matlab/solution-calculating-the-average-of-channel-with-uneven-timestamps-using-trapz/", "posts": [{"date": "September 15, 2015 - 1:55 pm", "content": "fishmastaflex asked a question about using the trapz function in MATLAB to calculate the average temperature on a channel where the samples come in irregularly.  There's no built in function to do this, but it's only a couple lines of code.I have a similar challenge with one of my temperature sensors.  It only sends data when there is a significant change:>> data = thingSpeakRead(32188,'NumPoints',5,'OutputFormat','table')data =          Timestamps         TempF    ____________________    ______    15-Sep-2015 13:28:33    68.584    15-Sep-2015 13:29:34    68.685    15-Sep-2015 13:30:34    68.861    15-Sep-2015 13:34:36    69.047    15-Sep-2015 13:36:36    69.188To use trapz, you need to convert the timestamps into X coordinates.  Do this by calculating the relative time for each timestamp in seconds:X = seconds(data.Timestamps - data.Timestamps(1))X =     0    61   121   363   483Calculate the area under the curve (approximate integral) using trapz, then divide by the number of elapsed seconds to get the mean average:>> avg = trapz(X,data.TempF) / X(end)avg =   68.9317More about trapz: http://www.mathworks.com/help/matlab/ref/trapz.html", "num_user_post": " 47", "author": "Rob Purser"}, {"date": "September 15, 2015 - 3:30 pm", "content": "Thanks Rob. Glad to spark the conversation. My method works pretty good too using the posix time function. It's only one line of code:areaUnderCurve = trapz(posixtime(X),Y);X is my matrix of timestampsY is my dataWatch out for NaN values though as well. Even if you have just one, the trapz function will spit out NaN. I used isnan to delete values in the matrix.", "num_user_post": " 11", "author": "fishmastaflex"}, {"date": "September 15, 2015 - 7:17 pm", "content": "I like it.", "num_user_post": " 47", "author": "Rob Purser"}]}, {"url": "https://community.thingspeak.com/forum/matlab/posix-number-of-days-since-not-working/", "posts": [{"date": "September 14, 2015 - 2:34 pm", "content": "Hey guys,I'm noticing a some strange things with a MATLAB function I am using. It seems to be missing the hour, minute, and seconds in the calculation.  posixtime(t) takes a datetime value t  and should output the 'number of seconds elapsed since 00:00:00 1-Jan-1970 UTChttp://www.mathworks.com/help/matlab/ref/posixtime.htmlI am reading in the correct datetime values using thingSpeakRead. If I print the string in the console for the first value, I get exactly:13-Sep-2015 18:20:58Sounds good. Okay, now I try to apply the MATLAB function posixtime(t) to get the number of seconds for the value above, and it outputs:1.4422e+09 (1442200000 seconds)Which is according to human readable format: GMT: Mon, 14 Sep 2015 03:06:40 GMTThe date seems to be fairly accurate (probably off by a timezone), but the hour/minutes/seconds don't make sense. I am thinking that the MATLAB function has thrown away the HH:MM:SS and not performing the calculation. I don't think this is me...I also tried a different function for calculating time and got some issues. I used datenum(t) and it also forgets to add hours, minutes, seconds. Further out, I used datenum(t, formatIn) to try to force the timestamp format and the console gave me this error:datenum(t,'dd-mmm-yyyy HH:MM:SS')Error using datetime/datenumToo many input arguments.Can someone look into this? Thanks!", "num_user_post": " 11", "author": "fishmastaflex"}, {"date": "September 14, 2015 - 3:47 pm", "content": "Hi,We'll look into this, and try to understand what's going on.  That said, in general, I'd strongly recommend working with the (reasonably new) datetime object, which understands timezones and has a wide array of functions for manipulating dates and times.  This is what ThingSpeakRead retuns.  Many of the plot functions natively understand it as well, and 'do the right thing' when you pass them in.More on datetime: http://www.mathworks.com/help/matlab/ref/datetime.html  and http://www.mathworks.com/help/matlab/date-and-time-operations-1.html-Rob", "num_user_post": " 47", "author": "Rob Purser"}, {"date": "September 14, 2015 - 3:53 pm", "content": "Thanks Rob,Going a little bit off-topic here for my specific project, but how would you recommend me using the MATLAB trapz(x,y) function to look at the area under the curve of my data over time? Where X is my data and Y would be my datetime object that thingSpeakRead outputs. Obviously the trapz function doesn't take datetime objects. I tried that first thing which is why I started looking into changing my datetime value to epoch seconds. That is an easy number for MATLAB to calculate which is why I went that route.trapz, integral, integral2, intelgra3 functions don't take datetime objects. Damn!", "num_user_post": " 11", "author": "fishmastaflex"}, {"date": "September 14, 2015 - 3:58 pm", "content": "Hi fishmastaflex,I tried this:x = datetime('now')y = posixtime(x)z = datetime(y,'ConvertFrom','posixtime')And got:x =   14-Sep-2015 15:52:32y =   1.4422e+09z =   14-Sep-2015 15:52:32Which is what I would expect....If you're trying to calculate elapsed seconds between two datetimes, just subtract them, which will give you a duration object, and you can convert that to seconds:>> elapsedTimeInDay = datetime('now') - datetime('today')elapsedTimeInDay =   15:57:09>> seconds(elapsedTimeInDay)ans =   5.7429e+04>> hours(elapsedTimeInDay)ans =   15.9526>> days(elapsedTimeInDay)ans =    0.6647", "num_user_post": " 47", "author": "Rob Purser"}, {"date": "September 14, 2015 - 4:19 pm", "content": "Thank you for your help, Rob. I think I see what is going on here and my spirits have been lifted! I was using the console to double-check my work and did not realize that it wasn't outputting the entire double number in the console screen. The console keeps outputting: 1.4422e+09And I am expecting more decimal places: 1442245952I never tried: z = datetime(y,'ConvertFrom','posixtime') to read back as a datetime object. Not sure if you can increase the number of decimal places in the console screen. I would assume that somebody might run into a similar situation as I did and just assume. My mistake - sorry!", "num_user_post": " 11", "author": "fishmastaflex"}, {"date": "September 14, 2015 - 4:47 pm", "content": "Hi fishmastaflex,That is a good point. I use the 'format long g' command to display the a number in a non-exponential format, i.e.,dt = datetime('now')format long gposixtime(dt) ans = 1442248971.20384- Adarsh", "num_user_post": " 62", "author": "Adarsh_Murthy"}, {"date": "September 15, 2015 - 1:56 pm", "content": "Glad you figured out the console display thing.  MATLAB is generally optimized to print out matrixes, so it tends to choose terse display formats by default.  As Adarsh says, you can set the display format.On trapz, I broke my answer into a seperate topic on the forum so other people might see it:http://community.thingspeak.com/forum/matlab/solution-calculating-the-average-of-channel-with-uneven-timestamps-using-trapz/", "num_user_post": " 47", "author": "Rob Purser"}, {"date": "September 15, 2015 - 3:31 pm", "content": "Good call, cheers!", "num_user_post": " 11", "author": "fishmastaflex"}]}, {"url": "https://community.thingspeak.com/forum/matlab/changing-graph-properties-for-matlab-visualizations/", "posts": [{"date": "September 6, 2015 - 5:49 pm", "content": "Hello,I just made this channel: https://thingspeak.com/channels/51914All nice and everything is working nice, but I would like to be able to:Define Xmin, Xmax, Ymin, Ymax for both thingSpeakPlot and thingSpeakScatterDefine graph width, for both thingSpeakPlot, and thingSpeakScatter.I would also be able to lock the graph, so the pointer can not change things like scales.Defining size of iframe does not lead to a bigger or wider graph for both matlab or regular field plots.Best Regards,C.A.", "num_user_post": " 1", "author": "altineller"}, {"date": "September 8, 2015 - 3:27 pm", "content": "Hi, The channel and the custom visualizations you have created look great, thank you for sharing your channel. Thank you also for sharing feedback on features you would like to see with thingSpeakPlot, thingSpeakScatter, and the interactivity of the graph. We will consider adding this for a future version of these functions. One option for you to control the x-axis and y-axis limits and for creating a static plot for now would be to use the non-interactive MATLAB plotting functions: plot and scatter. For these functions you will be able to use xlim() and ylim() functions to define the axis scaling. You will be able to find additional help for these functions at the links below:Plot: http://www.mathworks.com/help/matlab/ref/plot.html?Scatter: http://www.mathworks.com/help/matlab/ref/scatter.html?Xlim: http://www.mathworks.com/help/matlab/ref/xlim.html?Ylim: http://www.mathworks.com/help/matlab/ref/ylim.html? Thanks,Adarsh", "num_user_post": " 62", "author": "Adarsh_Murthy"}]}, {"url": "https://community.thingspeak.com/forum/matlab/delay-function-thingspeakwrite-into-same-channel-based-on-data-insertion/", "posts": [{"date": "August 31, 2015 - 8:58 am", "content": "Hi,Is there a way how to write data into the field of the same channel I am doing calculations from? Example - I would like to calculate dew point from temperature and humidity based in field 1 and 2 and write it to field3. If I do it using React app it gives me error because it's trying to perform 2 field writes in 1 second. I suppose a delay function would do the trick but it seems it is not supported. I also tried to use TimeControl to do calculations but it isn't really something I am satisfied with as it writes blank values in case there are no new data in fields 1 and 2. Any idea for a usable workaround?", "num_user_post": " 1", "author": "Vojta1"}, {"date": "August 31, 2015 - 10:31 am", "content": "One approach is to write to a new channel.  Your MATLAB code could be set up to read field 1 and 2, perform your dew point calculation, and write to a new channel.  You could optionally perform a calculation such as mean or median on your original data and write them to the new channel too.  Note that since a channel stores time series data, each time you write one or more fields, a date and time is associated with each of the eight fields like this:Date and Time Stamp  Field 1Field 2Field 3Field 4Field 5Field 6Field 7Field 8time 1               TempHumiditynull         nullnull        null        null        nulltime 2                null        null        Dew Pointnull        null        null        null  nullwhich may not be what you expect.If you write to a new channel you could get something like this:Date and Time Stamp  Field 1        Field 2        Field 3        Field 4Field 5Field 6Field 7Field 8time x               Avg. TempAvg. HumidityDew Point  null        null        null        null        nullwhich may be closer to what you are looking for.", "num_user_post": " 4", "author": "Robert Mawrey"}]}]}