[{'url': u'https://community.thingspeak.com/forum/matlab/page-1/', 'threads': [{'url': u'https://community.thingspeak.com/forum/matlab/thingspeakplot-error/', 'posts': [{'date': u'September 13, 2018 - 10:38 pm', 'content': u"Sometime in the last few days a visualization that uses thingSpeakPlot has stopped working. The error is:Error using thingSpeakPlot (line 59)The following error occurred converting from datetime to double:Undefined function 'double' for input arguments of type 'datetime'. To convert from datetimes to numeric, first subtract off a datetime origin, then convert to numeric using theSECONDS, MINUTES, HOURS, DAYS, or YEARS functions.The same code was previously working. I've created a very simple test that reproduces the problem (code below). Seems like something has changed in thingSpeakPlot ... help !% dummy table dataTimestamps = datetime({'2015-12-18 08:03:05';'2015-12-18 10:03:17';'2015-12-18 12:03:13';'2015-12-18 13:07:23';'2015-12-18 14:45:51'});Temp1 = [37.3; 39.1; 42.3; 38.9;  33.6];Temp2 = [33.5; 33.7; 34.5; 35.7; 37.6];Temp3 = [24.0;  28.1; 26.3; 27.3; 33.6];% create timetableTT = timetable(Timestamps,Temp1,Temp2,Temp3);% Visualize DatathingSpeakPlot(TT.Timestamps, TT.Variables);", 'num_user_post': u' 2', 'author': u'beluga'}, {'date': u'September 14, 2018 - 2:15 pm', 'content': u'I am able to reproduce this issue.   We are working on a resolution and expect to implement it shortly.', 'num_user_post': u' 401', 'author': u'cstapels'}, {'date': u'September 14, 2018 - 3:30 pm', 'content': u'The issue has been resolved. I no longer see the same error when I test the code you provided.  Please let us know if you continue to see the issue.  Be sure to refresh your browser before testing. Thank you for your help!', 'num_user_post': u' 401', 'author': u'cstapels'}, {'date': u'September 14, 2018 - 4:29 pm', 'content': u'Working perfectly again. Thanks for the quick response', 'num_user_post': u' 2', 'author': u'beluga'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/urlfilter-stopped-working-with-strfind-error/', 'posts': [{'date': u'September 13, 2018 - 8:39 pm', 'content': u"I had an email that my MatLab Analysis stopped working today around 11:35AMThe general error is:Error using strfindInputs must be string scalars or character vectors.Error in urlfilterError in Scrape AmbientWeather.net (line 11)DataSet = urlfilter(URL, 'winddir', 20)This has been working fine for months. Now I can't get it fixed for the life of me. I have been all over the map looking at and trying code examples with no luck.Any help would be greatly appreciated.My (redacted) code is listed below.---------------------------------------------------------------% WriteChannelIDWriteChannelID = NNNNNN;% WriteAPIKeyWriteAPIKey = 'ABC123';% URL SetupURL = 'https://api.ambientweather.net/v1/devices?applicationKey=ZYX&apiKey=098';% Data CollectionDataSet = urlfilter(URL, 'winddir', 20)% Display All Datadisplay(DataSet(1),'Wind Direction');display(DataSet(2),'Wind Speed - MPH');display(DataSet(3),'Wind Gust - MPH');display(DataSet(4),'Maximum Daily Wind Gust - MPH');display(DataSet(5),'Outside Air Temperature - F');display(DataSet(6),'Outside Humidity');display(DataSet(7),'Hourly Rain Rate - Inches');display(DataSet(8),'Daily Rain Total - Inches');display(DataSet(9),'Weekly Rain Total - Inches');display(DataSet(10),'Monthly Rain Total - Inches');display(DataSet(11),'Yearly Rain Total - Inches');display(DataSet(12),'Total Rainfall - Inches');display(DataSet(13),'Inside Air Temperature - F');display(DataSet(14),'Inside Humidity');display(DataSet(15),'Relative Barometric Pressure - Inches of Mercury');display(DataSet(16),'Absolute Barametric Pressure - Inches of Mercury');display(DataSet(17),'UV');display(DataSet(18),'Solar Radition - w/m2');display(DataSet(19),'Outside Temperature Feels like - F');display(DataSet(20),'Dew Point');%Write eight parameters of datathingSpeakWrite(WriteChannelID, {DataSet(1),DataSet(2),DataSet(5),DataSet(6),DataSet(7),DataSet(8),DataSet(15),DataSet(19)}, 'Writekey', WriteAPIKey)------------------------------------------------------------Attached is a screenshot of the output from the AmbientWeather api.If you need additional info, please let me know and I will track it down or explain in more detail.Thanks!Scott", 'num_user_post': u' 2', 'author': u'svinzant'}, {'date': u'September 14, 2018 - 11:41 am', 'content': u'We are able to reproduce this problem and we are working a resolution. We will post in the forum when it has been resolved.', 'num_user_post': u' 401', 'author': u'cstapels'}, {'date': u'September 14, 2018 - 12:47 pm', 'content': u"One thing I have noted, my other MatLab Analysis that DOES work is only using 'http', whereas the one that is NOT working uses 'https'.It is certainly something in the 'urlfilter' command, maybe something with the way input is handled? Or something with the way secure http is dealt with.If there is a way to chat/message privately, please contact me and I can share my complete api keys with you for further testing on your end.Thanks!Scott", 'num_user_post': u' 2', 'author': u'svinzant'}, {'date': u'September 14, 2018 - 3:27 pm', 'content': u'The issue has been resolved, please let us know if you continue to see the issue.  Be sure to refresh your browser before testing.  I think you have provided enough information for us to recreate the experiment. Thanks for the helpful information.  We will reach out if we need more information.', 'num_user_post': u' 401', 'author': u'cstapels'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/problem-with-timestamp-when-i-use-thingspeakwrite/', 'posts': [{'date': u'September 4, 2018 - 8:38 pm', 'content': u"Hello,I have problems with the time stamps. What I wanted to do is to send data that I have in my laptop to Thingspeak, so I can visualize it in the web. I need that the time stamp of the data that appear in thingspeak be the same as the one that the data have in my laptop, which is the time where the data was created in the first place. However, Thingspeak shift the time to adjust for local time which is a problem in my case, because I have weather data and I don't want my solar radiation sensor peak at 5-6 am.As an example, when I upload the data from Matlab using thingspeakwrite with a time stamp of 04-Sep-2018 16:23:43 , in Thingspeak appear shifted to 04-Sep-2018 08:23:43 (UTC -7), then when I download the same data using the data export button, this value appear shifted again to 04-Sep-2018 12:23:43 (UTC-3). What I would really like to have is the option that Thingspeak maintain the timestamp instead of keep changing it. Is there a way to do this? Can I configure the UTC time in Thingspeak or in Matlab? It seem that one way to control the shift is changing my laptop local time, but hopefully there will be a better option as a rather prefer to maintain my laptop at the correct time.I can see that there is an option in the data import/export label to modify the UTC time, but it seems that this is just for manually upload data to Thingspeak which is not what I want to do.Thank you very much for the help.", 'num_user_post': u' 2', 'author': u'kikorojo'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/react-30-60-minutes-not-working/', 'posts': [{'date': u'August 22, 2018 - 6:16 am', 'content': u'I subscribed to the service, set up a react.react is working on data insertion and with 10 min frequency but is NOT working with 30 / 60 min frequencey.Any ideas?', 'num_user_post': u' 2', 'author': u'joergkainz'}, {'date': u'August 22, 2018 - 2:25 pm', 'content': u'We are able to reproduce the issue and are investigating potential resolutions. Thank you for your post.', 'num_user_post': u' 401', 'author': u'cstapels'}, {'date': u'August 22, 2018 - 3:52 pm', 'content': u'The issue has been fixed.  Please let us know if you continue to observe the original problem.  Thanks again for reporting.', 'num_user_post': u' 401', 'author': u'cstapels'}, {'date': u'August 23, 2018 - 7:23 am', 'content': u'THX - now its working perfectly!', 'num_user_post': u' 2', 'author': u'joergkainz'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/show-time-in-correct-format-in-matlab-view/', 'posts': [{'date': u'July 26, 2018 - 5:02 am', 'content': u'Hi,in my channel, timestamps are corectly shown in the 24H format (HH:MM). I made two MATLAB views from channel data, but the X axis (timestamps) is shown in the 12H format (HH:MM P/M). How can I make things consistent?', 'num_user_post': u' 14', 'author': u'fmarzocca'}, {'date': u'August 6, 2018 - 9:00 am', 'content': u"Can you consider using the dateaxs settings?https://www.mathworks.com/help/finance/dateaxis.htmlHere is an example that uses those settings:https://www.mathworks.com/help/thingspeak/candle-plot-with-customized-date-axis.htmlI don't thing you can apply it to a thingSpeakPlot, but it will work with other MATLAB plot types that you can use in ThingSpeak.", 'num_user_post': u' 401', 'author': u'cstapels'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/matlab-views-on-smartphone-app/', 'posts': [{'date': u'July 26, 2018 - 5:00 am', 'content': u'Hi,I have set two MATLAB views on my channel. I can see them from the web interface, but they do not show in the smartphone App ThingView Full. Is it normal?', 'num_user_post': u' 14', 'author': u'fmarzocca'}, {'date': u'July 26, 2018 - 11:45 am', 'content': u"I found contact information for the ThingView developer at the bottom of this page: https://play.google.com/store/apps/details?id=com.cinetica_tech.thingview&hl=en_US.  If the developer or someone else who uses ThingView checks the forum, hopefully they can chime in.  If you reach out to them, can you mention this forum to them, in case they aren't aware?If you get the answer from the developer, please post it here too.", 'num_user_post': u' 401', 'author': u'cstapels'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/testing-the-communication-reliability/', 'posts': [{'date': u'July 24, 2018 - 10:20 am', 'content': u'Hi everyone,is it possible to create artificially communication faults, data congestion or corrupted data  etc.in order to test how the communication network responds to that?thanks in advanceNikolas', 'num_user_post': u' 3', 'author': u'teratoulis'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/thingspeakplotyy-visualization-setup/', 'posts': [{'date': u'July 5, 2018 - 4:39 am', 'content': u"Hello Everybody.I'm trying to visualize multiple series with Mathlab Visualization YY Plot.Everything works great but the visualization is real bad:I can't control Y axis extention (the right one should be from -0.5 to 1.5) and the numbers on the left are displayed with 10 decimals. The plot is here:https://thingspeak.com/apps/matlab_visualizations/238861This is actually my plot code:thingSpeakPlotYY(timeStampsT,TMandata,timeStampsIO,correctState, ...                         'Ylabel1','Temperature',...                         'Ylabel2','State',...                         'LineWidth2',2);Thank You!", 'num_user_post': u' 1', 'author': u'Simone'}, {'date': u'July 10, 2018 - 3:33 pm', 'content': u'I would consider using the basic MATLAB plot() function.  You lose some of the real time updating capabilities of thingSpeakPlots, but there are a lot more axis options.https://www.mathworks.com/help/matlab/ref/plot.html', 'num_user_post': u' 401', 'author': u'cstapels'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/entries-history-visualization/', 'posts': [{'date': u'May 22, 2018 - 4:28 am', 'content': u'how can i make a visualization of how many Entries i recived in a day on a bar graph? something like the the graph you can find in the account page https://thingspeak.com/account but not for every entry the account recived but just the ones from a particular channel. thank you! \U0001f642', 'num_user_post': u' 7', 'author': u'frenk0'}, {'date': u'May 23, 2018 - 2:37 pm', 'content': u"See the workflow in the Get Started tutorial, it has some similarities:https://www.mathworks.com/help/thingspeak/getting-started-with-thingspeak.htmlCreate a new MATLAB analysis.Use  thingSpeakRead to read the values from your raw channel, read for one day, you can read into a timetable and measure the height.numEntries=height(thingSpeakRead(channelID,'numDays',1,'OutputFormat','timetable'));Then use thingSpeakWrite() to write the value of numEntries to another new channel that you create (processed channel).Then save the analysis and set up a time control to call the analysis you made once per day.The thingSpeak plot in your processed channel view can be changed to a bar graph using the pencil icon in the upper right of the plot.  The default is a line plot.", 'num_user_post': u' 401', 'author': u'cstapels'}, {'date': u'May 24, 2018 - 4:45 am', 'content': u"thanks a lot this really helped! i didn't know about the height function!", 'num_user_post': u' 7', 'author': u'frenk0'}, {'date': u'May 24, 2018 - 11:48 am', 'content': u"Glad I could help!Let us know if you have an interesting new ThingSpeak application to share.If you read into a vector such as[data, times] = thingSpeakRead(channelID,'numDays',1);Then you should use length(times) .height() and width() are for timetables.", 'num_user_post': u' 401', 'author': u'cstapels'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/time-difference-between-two-dates-on-x-axis/', 'posts': [{'date': u'May 21, 2018 - 3:06 am', 'content': u"Hey everyone,i really looking forward for some help. I try to calculate the time difference between two RFID loggin Data\xb4s. I mapped the UID\xb4s from the cards with '1'. So ich only get 1 on y-axis and the time on x-achsis. See here: https://thingspeak.com/channels/497889I really dont\xb4t know what function to take for calculating Time 2 - Time 1 = minetime?timeit? Tic? Toc? Plot time ? Datediff ? Diff ? and how do i get what i need ? The introductions from this functions are not givin examples from that what i want :-/ Always the last value of the table minus the second last value...Can i take this code for starting ? ( And underneath the function i need...)//readChannelID = 497889;% TODO - Replace the [] with the Field ID to read data from:fieldID1 = 1;% Channel Read API Key% If your channel is private, then enter the read API% Key between the '' below:readAPIKey = 'XXX';%% Read Data %%% Read first data variable[data,timestamps] = thingSpeakRead(497889,'Fields',[1],'NumMinutes',360)//then i get something like this: //data =     9     9     9     9timestamps =   4\xd71 datetime array   21-May-2018 08:21:36   21-May-2018 08:21:53   21-May-2018 08:22:13   21-May-2018 08:30:36//Many thanks for some help in advance \U0001f642", 'num_user_post': u' 1', 'author': u'BoOM'}, {'date': u'May 21, 2018 - 8:14 am', 'content': u'I suspect that the diff() or caldiff() functions are what you are looking for.  Hopefully one of the Matlab experts will chime in with the right syntax..', 'num_user_post': u' 271', 'author': u'rw950431'}, {'date': u'May 22, 2018 - 4:19 pm', 'content': u"When you read the data, MATLAB takes care of interpreting the times and you can subtract the directly.[myData,myTimes]=thingSpeakRead(497889,'NumPoints',2);numMinutes=minutes(myTimes(2)-myTimes(1));I sometimes prefer to use a timetable:myTableData=thingSpeakRead(497889,'NumPoints',2,'OutputFormat','timetable');numMins=minutes(myTableData.Timestamps(2)-myTableData.Timestamps(1));Does that help you do what you wanted to do?", 'num_user_post': u' 401', 'author': u'cstapels'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/plotting-a-best-fit-line-on-thingspeak-based-on-data-points-gathered-is-it-possible/', 'posts': [{'date': u'May 8, 2018 - 1:22 pm', 'content': u"Hi all,I want to plot a best fit (2D) line on ThingSpeak.I am using ThingSpeak MATLAB visualisations and I edited the program from there by adding in the function 'lsline;' to plot the best fit line.My program is as such: % TODO - Replace the [] with channel ID to read data from:readChannelID = 484262;% TODO - Replace the [] with the Field ID to read data from:fieldID1 = 1;%% Read Data %%[data, time] = thingSpeakRead(readChannelID, 'Field', fieldID1, 'NumPoints', 20);%% Visualize Data %%thingSpeakPlot(time, data);lsline;However, I have an error code which says this:To use 'lsline', the following product must be licensed, installed, and enabled:  Statistics and Machine Learning ToolboxError in Create a 2-D line plot 3 (line 21)lsline;I wish to do all of the analysis on ThingSpeak cloud platform, and not have to export the data (out from ThingSpeak) and analyse the trends by uploading data to the actual MATLAB R2018 program.Is it even possible to plot a best fit line on ThingSpeak itself, based on the data points from my channel? Or can this only be done on the actual MATLAB program?Also, is it possible to plot a best fit line on MATLAB Analysis instead? (Program above is using MATLAB Visualisation)", 'num_user_post': u' 2', 'author': u'tiaratan'}, {'date': u'May 9, 2018 - 8:50 pm', 'content': u'If you have a license that includes Statistics and Machine learning, then log into thingspeak using the Mathworks account that has the license.  You will then be able to use Isline.  There are definitely other ways to fit data using the base MATLAB that is available through ThingSpeak.  Such a solution will not require a license. See the example at https://www.mathworks.com/help/thingspeak/Visualize-Correlation-Between-Temperature-and-Humidity.html.  The last section at the bottom shows how to use polyfit to do linear regression.  Poly fit will also fir to higher order polynomials.  There are also functions for fit other types of curves.  You can definitely do these operations in ThingSpeak MATLAB Visualizations app or the MATLAB analysis app.  You cannot plot a fit line using MATLAB analysis, but you can determine fit parameters to your data in MATLAB analysis.The linear regression page shows you how to determine slope and intercept for a line of best fit.  https://www.mathworks.com/help/matlab/data_analysis/linear-regression.htmlThe matrix technique shown will work in MATLAB analysis but you would not be able to visualize our data.', 'num_user_post': u' 401', 'author': u'cstapels'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/scraping-data/', 'posts': [{'date': u'January 18, 2018 - 8:18 am', 'content': u"Hi I am trying to scrape the data from my temp sensor. it is located at malcomp.mooo.com:1010\xa0I have put the temperature between span tags like the example but it doest like it.im sure im just missing something but it just doesnt seem to get any data?\xa0any ideas?\xa0[code]% Scrape a website to identify the current temperature . The% temperature is then written to another ThingSpeak channel.% Specify the url containing information on current temperature in Natick, MA, U.S.A.url = 'http://malcomp.mooo.com:1010/index.htm';% TODO - Replace the [] with channel ID to write data to:writeChannelID = 405063;% TODO - Enter the Write API Key between the '' below:writeAPIKey = 'UGEUH8A5T1V9AFA9';% Fetch data and parse it to find information of interest. Learn more about% the URLFILTER function by going to the Documentation tab on the right% side pane of this page.temp = urlfilter(url,'Temp');display(temp, 'Temperature');[/code]", 'num_user_post': u' 18', 'author': u'jacktheripper125'}, {'date': u'January 18, 2018 - 9:21 am', 'content': u"Looks like the site is loading some of the DOM dynamically. You will need to do this in two steps:1) Create a ThingHTTP appSet the URL to: http://malcomp.mooo.com:1010Set the Parse String to:\xa0//span[2]/text()Now you can hit this ThingHTTP from a device, or from MATLAB and the result will be the text in the second <span> on the page2) Create a MATLAB Analysis app with this code:opts = weboptions('Timeout',15);data = webread('INSERT API URL FROM STEP 1',opts)", 'num_user_post': u' 225', 'author': u'Vinod'}, {'date': u'January 18, 2018 - 11:01 am', 'content': u"I have no idea how that works in the second part but it does. now I need to push the data to the feilds but the examples given dont make sence to mei have tried the code below, but it is so far off it is probably laughable.I am trying to get the data to\xa0 field\xa0 \xa0lounge_Temp\xa0 and then once I have this I will try to play to get it to do the 4 other sensors.\xa0thank you for your help im relived it is at least scraping\xa0[code]% Enter your MATLAB Code belowopts = weboptions('Timeout',15);data = webread('https://api.thingspeak.com/apps/thinghttp/send_request?api_key=PC4EOCTMNDPPQOSW',opts)writeChannelID = 405063;% TODO - Enter the Write API Key between the '' below:writeAPIKey = 'blahblahblah';% Fetch data and parse it to find information of interest. Learn more about% the URLFILTER function by going to the Documentation tab on the right% side pane of this page.lounge_Temp = urlfilter(numbers);display(lounge_Temp, 'Temp');% Write the temperature data to another channel specified by the% 'writeChannelID' variabledisplay(['Note: To successfully write data to another channel, ',... 'assign the write channel ID and API Key to ''writeChannelID'' and ',... '''writeAPIKey'' variables above. Also uncomment the line of code ',... 'containing ''thingSpeakWrite'' (remove ''%'' sign at the beginning of the line.)'])% Learn more about the THINGSPEAKWRITE function by going to the Documentation tab on% the right side pane of this page.% thingSpeakWrite(writeChannelID, tempF, 'Writekey', writeAPIKey);[/code]", 'num_user_post': u' 18', 'author': u'jacktheripper125'}, {'date': u'January 18, 2018 - 11:01 am', 'content': u'Just clarifying the reason you were unable to use WEBREAD to get to the data - the website that was serving the data was serving it on port 1010. This is a non-standard port for HTTP web servers and MATLAB running in the cloud blocks access to these non-standard ports.\xa0By using the ThingHTTP app we were able to put a redirection from the normal port (port 80) to the non-standard port (1010) on the website serving the data.', 'num_user_post': u' 225', 'author': u'Vinod'}, {'date': u'January 18, 2018 - 11:30 am', 'content': u"OOHHHI only picked 1010 because I could remember it. 80 is being used and a few others so i just picked 1010 as it isnt used by any of my software.what is the best port to use other than 80I will move it to that port then.once i have done that I would like to scrape this data from the page into their 4 fields. can you help with the code to do it?my fields are 1 lounge_temp 2 Loft_temp 3 Lounge_humid 4 Loft_humidthe page comes out like this below (source)\xa0thank you for your help. I think I shot myself in the foot!\xa0The Fan is 0<br>\xa0<span>Temp: </span>\xa0<span>\xa018\xa0</span>\xa0<span>Temp2: </span>\xa0<span>\xa07\xa0</span>\xa0<span>humidity: </span>\xa0<span>\xa060\xa0</span>\xa0<span>humidity2: </span>\xa0<span>\xa081\xa0</span>\xa0<br>\xa0Click <a href='/H'>here</a> turn the Fan on<br>\xa0Click <a href='/L'>here</a> turn the Fan off<br>", 'num_user_post': u' 18', 'author': u'jacktheripper125'}, {'date': u'January 18, 2018 - 11:43 am', 'content': u"If you're not using port 80, you will need to use ThingHTTP to essentially proxy the data from port 1010 to port 80. I showed in the example above, the Temperature, 18, is in the second span, which is why I set the Parse String to extract the value in the second <span>.\xa0You can create any number of ThingHTTPs, one for each field.Say you want humidity2, you will change the Parse String to\xa0\xa0//span[8]/text()This parses the text and pulls the value within the 8th span.\xa0Hope this helps explain the concept so you can modify accordingly.", 'num_user_post': u' 225', 'author': u'Vinod'}, {'date': u'January 18, 2018 - 12:02 pm', 'content': u'\xa0super 3 questions please im nearly there.1 how often will the thinghttp or the app poll for infromation and where to I change it2 can I remove the span and just look for the temp: before the temperature and temp2: before the second (this way I can remove the spans from the code saving some software space as im pushing my luck on it3 how do I get that info to the correct fields in analysis\xa0I am aware of my stupidity with this but Im so upside down with C+ my brain isnt coping well\xa0thank you for your patience and help\xa0', 'num_user_post': u' 18', 'author': u'jacktheripper125'}, {'date': u'January 18, 2018 - 1:02 pm', 'content': u"Ok Im nearly nearly there.\xa01 I set that easy to answer\xa02 yes i can3 still cant figuremy output is now as belowbut I cant figure the command to take the 4 numbers and fill them into the for fields.could anyone tell me what is needed? I have got part way with\xa0\xa0thingSpeakWrite(xxxxxx, analyzedData, 'WriteKey', xxxxxxxxxx);its the analyseddata bit im stuck on?\xa0data = ' 17 6 61 83 '", 'num_user_post': u' 18', 'author': u'jacktheripper125'}, {'date': u'January 18, 2018 - 1:50 pm', 'content': u"have a look at the documentation for thingSpeakWrite.\xa0 There are some good examples there.I think you want to use the name,value pair 'fields'thingSpeakWrite(xxxxxx,'values', analyzedData, 'WriteKey', xxxxxxxxxx,'fields',[1 2 3 4]);You may have to transpose analyzedData, depending on what shape it is in.\xa0 Use and apostrophe after the variable to transpose it.\xa0 -> analyzedData'", 'num_user_post': u' 401', 'author': u'cstapels'}, {'date': u'January 18, 2018 - 1:59 pm', 'content': u"Hi thank you for your replyI looked at the examples over and over and thought they would work but they only seem to be this sort\xa0\xa0thingSpeakWrite(17504,[2.3,1.2,3.2,0.1],'WriteKey','23ZLGOBBU9TWHG2H')perfect I thougt so off i went to use it and realised it was just filling in the data 2.3 to the first and so on and I dont know how to turn the output into a string,i tried  your command but it saidUndefined function or variable 'analyzedData'.?is no one else doing this? scraping data off a webpage and putting it into thingspeak? a big thank you for your help", 'num_user_post': u' 18', 'author': u'jacktheripper125'}, {'date': u'January 19, 2018 - 1:29 pm', 'content': u"Can you show what the value or some sample values you have for analyzedData?\xa0 or show the command where you scrape web data?You need to be pretty explicit about format so that thingSpeak can put stuff where you want it.perhaps consider this format :\xa0thingSpeakWrite(17504,'Fields',[1,4,6],'Values',{2.3,'on','good'},'WriteKey','23ZLGOBBU9TWHG2H')The result of the above will be an entry as followsTime              field1  field2  field3  field4  field5  field6 field7 field8 status location{write time}\xa0 \xa0 \xa02.3\xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 on\xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 good\xa0Is that the effect you are looking for?", 'num_user_post': u' 401', 'author': u'cstapels'}, {'date': u'January 19, 2018 - 1:48 pm', 'content': u"Kind of I saw an example like that but every example I see are not taking values from the output and putting them into the channel. they all say the values in the code and I dont see the point in that. the output it sees aredata = 'Lounge_Temp 17 Loft_Temp 6 Lounge_Humidity 64 Loft_Humidity 88'I have Fields with the names Lounge_Temp and Loft_Temp etc... so I need the value after putting in its field. and every time I try to do this I get an error.\xa0I would have thought this is a normal thing to do but I cant find any examples?Hopefully you can help?", 'num_user_post': u' 18', 'author': u'jacktheripper125'}, {'date': u'January 19, 2018 - 4:31 pm', 'content': u"If anyone is interested I fixed it, rather than trying to do all the data in one go and feed it to the channel I made 4 Matlab apps and have set them to keep requesting data.this is the code that worked.\xa0\xa0% Template MATLAB code for reading numeric data from a webpage, analyzing % the data and storing the analyzed data in a channel.% Prior to running this MATLAB code template, assign the url for the % webpage to scrape to the 'url' variable. Also assign the target string to % search for in the web page to the 'targetString' variable.% To store the scraped data, you will need to write it to a channel other % than the one you are reading data from. Assign this channel ID to the % 'writeChannelID' variable. Also assign the write API Key to the % 'writeAPIKey' variable below. You can find the write API Key in the right % side pane of this page as well.% TODO - Specify URL of the page to read data from url = 'https://api.thingspeak.com/apps/thinghttp/send_request?api_key=xxxxxxxxxxxxxxx'; % TODO - Specify the target string to search in webpage targetString = 'Lounge_Temp';% TODO - Replace the [] with channel ID to write data to: writeChannelID = xxxxxx; % TODO - Enter the Write API Key between the '' below: writeAPIKey = 'xxxxxxxxxxx';%% Scrape the webpage %% data = urlfilter(url, targetString); display(data);%% Analyze Data %% % Add code in this section to analyze data and store the result in the % analyzedData variable. analyzedData = data;%% Write Data %% thingSpeakWrite(writeChannelID, {analyzedData,'Lounge_Temp'}, 'WriteKey', writeAPIKey);", 'num_user_post': u' 18', 'author': u'jacktheripper125'}, {'date': u'January 19, 2018 - 9:33 pm', 'content': u'You can use a single MATLAB analysis to scrape your data, parse the different fields and write it to 4 fields of a channel, or 4 different channels, if that is what you wish.I was trying to write the example for you, but your website is malcomp.mooo.com:1010 does not seem to be up.', 'num_user_post': u' 225', 'author': u'Vinod'}, {'date': u'January 19, 2018 - 11:39 pm', 'content': u"I set up a\xa0ThingHTTP that reads the #T1 element on your page to get its data.Here's the simple MATLAB Analysis App example that parses the data and writes\xa0it into fields 1 through 4 of your channel in a single write.opts = weboptions('Timeout',18); data = webread('https://api.thingspeak.com/apps/thinghttp/send_request?api_key=USE YOUR THINGHTTP API KEY HERE',opts); d2 = strsplit(data, char(13)); LoungeTemp = str2double(regexprep(d2{2},'[^0-9]', '')); LoftTemp = str2double(regexprep(d2{4},'[^0-9]', '')); LoungeHumidity = str2double(regexprep(d2{6},'[^0-9]', '')); LoftHumidity = str2double(regexprep(d2{8},'[^0-9]', '')); thingSpeakWrite(YOURCHANNELIDHERE, [LoungeTemp, LoftTemp, LoungeHumidity, LoftHumidity], 'WriteKey', 'USE YOUR CHANNEL WRITE API KEY HERE');\xa0If you're new to MATLAB, you can search for what some of the functions like STRREP, STRSPLIT, STR2DOUBLE, REGEXPREP, etc. do here.", 'num_user_post': u' 225', 'author': u'Vinod'}, {'date': u'February 6, 2018 - 6:10 pm', 'content': u'WOW!\xa0thank you.it works. i would never had got to that point, to many syntax traps for me in that code!\xa0thank you thank you thank you!\xa0', 'num_user_post': u' 18', 'author': u'jacktheripper125'}, {'date': u'February 28, 2018 - 5:04 pm', 'content': u'after trying this code ive found it doesnt show minus figures anymore.do you know why?\xa0', 'num_user_post': u' 18', 'author': u'jacktheripper125'}, {'date': u'February 28, 2018 - 5:30 pm', 'content': u"The example code works by splitting the return string based on new lines (d2 = strsplit(data, char(13));) and then replaces all characters that are not in [0-9] in each of the subsets with a ''. This will essentially convert '-123' into 123. If you want to modify it to not drop the '-' sign, then you will need to modify the regular expression to\xa0regexprep(d2{4},'[^-0-9]', '')That says replace everything that is not '-','0','1',...,'9' with a null value. It spares your '-' sign from being converted to a null string. If you want to ensure decimal points also should not be dropped, you will need to modify toregexprep(d2{4},'[^-.0-9]', '')", 'num_user_post': u' 225', 'author': u'Vinod'}, {'date': u'March 27, 2018 - 6:55 pm', 'content': u"Amazing! how do you know this stuff??\xa0unfortunately due to me being useless I broke it.\xa0I think it had something to do with me changing the name from LoungeTemp to Lounge_Temp but I have now changed both back but i still get the error.\xa0Index exceeds array bounds.Error in Main_Sensor_Data (line 4)LoungeTemp = str2double(regexprep(d2{2},'[^-.0-9]', ''));\xa0opts = weboptions('Timeout',18);data = webread('https://api.thingspeak.com/apps/thinghttp/send_request?api_key=xxxxxxxxxxxxx',opts);d2 = strsplit(data, char(13));LoungeTemp = str2double(regexprep(d2{2},'[^-.0-9]', ''));LoftTemp = str2double(regexprep(d2{4},'[^-.0-9]', ''));LoungeHumidity = str2double(regexprep(d2{6},'[^-.0-9]', ''));LoftHumidity = str2double(regexprep(d2{8},'[^-.0-9]', ''));thingSpeakWrite(xxxxxx, [LoungeTemp, LoftTemp, LoungeHumidity, LoftHumidity], 'WriteKey', 'xxxxxxxxxxxx');display(data);\xa0my channel info isName:\xa0Main_Sensor_DataChannel ID: 4xxxxxxxxxAccess: PublicRead API Key:\xa0OxxxxxxxxxWrite API Key:\xa0ZxxxxxxxxxFFields:\xa0 \xa0 \xa0 1: LoungeTemp\xa0\xa0 \xa0 \xa0 2: LoftTemp\xa0\xa0 \xa0 \xa0 3: LoungeHumidity\xa0\xa0 \xa0 \xa0 4: LoftHumidity\xa0\xa0as usual thank you for helping me out \U0001f642", 'num_user_post': u' 18', 'author': u'jacktheripper125'}, {'date': u'March 27, 2018 - 11:20 pm', 'content': u"I think there is something else going on. Your server at http://malcomp.mooo.com:1010 has become terribly slow and takes a long time to render. Additionally, there are changes in the server which cause it to sometimes return '-1' for the rendered text. To confirm this, open a new Chrome tab and hit F12. You will see the Chrome debugger. Now click no the 'Network' tab of the debugger. Now, in the address bar, type: http://malcomp.mooo.com:1010. You will see that the page takes >15s for it to render! This will likely cause your MATLAB code to timeout, since as a free user your MATLAB code has to execute in less than 20 seconds.I don't believe the solution to what you are looking for is on the ThingSpeak end. You would need to modify the code on your server that is rendering the page at http://malcomp.mooo.com:1010.\xa0Good luck!", 'num_user_post': u' 225', 'author': u'Vinod'}]}]}, {'url': u'https://community.thingspeak.com/forum/matlab/page-2/', 'threads': [{'url': u'https://community.thingspeak.com/forum/matlab/please-allow-code-window-to-be-resized-larger/', 'posts': [{'date': u'January 25, 2018 - 12:14 pm', 'content': u"I've been spending lots of time learning Matlab in the Thingspeak Matlab Analysis webpage. \xa0The size of the code window is limiting. \xa0Please allow code window to be resized larger.Is there a group indent capability, or a whole document auto format?", 'num_user_post': u' 70', 'author': u'turgo'}, {'date': u'February 26, 2018 - 1:09 pm', 'content': u'This is a good feedback, thanks. We are working on editor improvements. Would you be open to discuss this further?', 'num_user_post': u' 402', 'author': u'Hans'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/learn-matlab-udemy-course/', 'posts': [{'date': u'February 28, 2016 - 3:23 pm', 'content': u'Hi,You can take advantage and get 74% OFF coupon to Learn Matlab Udemy courseCoupon code: MATLAB25https://www.udemy.com/learn-matlab/?couponCode=MATLAB25', 'num_user_post': u' 2', 'author': u'raihan97'}, {'date': u'February 18, 2018 - 4:50 pm', 'content': u'thank you usefullطراحی سایت', 'num_user_post': u' 1', 'author': u'shahsavan'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/plotting-data-with-respect-to-station-year-month/', 'posts': [{'date': u'February 13, 2018 - 8:03 am', 'content': u'hi\xa0i am new in mat Labi have set of data that are constitute of station, year, month, day and Temperaturei want to plot the temperature values per month in each year according to a specific station\xa0any one can help me to make this process will be appreciatebest regards.\xa0', 'num_user_post': u' 1', 'author': u'abdmet74'}, {'date': u'February 13, 2018 - 2:19 pm', 'content': u'The configuration of plots in ThingSpeak depends strongly on how the data is organized.\xa0 \xa0 Does each station have its own channel?\xa0 Or is all the station data in one big table where the fields have the labels you describe?\xa0If the channel is public, you can share the channel number here and we can have a look at it to help the discussion.\xa0\xa0There are a lot of analysis and visualization tools in MATLAB that are available in ThingSpeak.\xa0 Have a look through some of the tutorials and examples, especially the Getting Started tutorial for some ideas.Welcome to MATLAB and ThingSpeak!', 'num_user_post': u' 401', 'author': u'cstapels'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/how-to-ignore/', 'posts': [{'date': u'February 7, 2018 - 8:20 am', 'content': u"Hi. I would like to ignore data outside a range, ie if the data is over 400 or below 0.this is what i am using now, occasionally the sensor goes mad. I have had a try but im just messing up my data more with errors, this is my current code.\xa0[code]\xa0% TODO - Specify URL of the page to read data fromurl = 'https://api.thingspeak.com/apps/thinghttp/send_request?api_key=xxxxxxxxxxxxx';% TODO - Specify the target string to search in webpagetargetString = 'is';% TODO - Replace the [] with channel ID to write data to:writeChannelID = xxxxxxx;% TODO - Enter the Write API Key between the '' below:writeAPIKey = 'xxxxxxxxxxxxx';%% Scrape the webpage %%data = urlfilter(url, targetString);display(data);%% Analyze Data %%% Add code in this section to analyze data and store the result in the% analyzedData variable.analyzedData = data;%% Write Data %%thingSpeakWrite(writeChannelID, analyzedData,'Fields',[1], 'WriteKey', writeAPIKey);\xa0[/code]", 'num_user_post': u' 18', 'author': u'jacktheripper125'}, {'date': u'February 13, 2018 - 1:48 pm', 'content': u"Hi,How many points does the output of urlfilter command contain? For the code examples below, I am assuming that it only contains a single point.There are several options available based on what is required for your applications. Here are a couple options that might be relevant:Option 1: If the data is outside the desired range, then you can choose not to write that data to 'writeChannelID':% TODO - Specify URL of the page to read data fromurl = 'https://api.thingspeak.com/apps/thinghttp/send_request?api_key=xxxxxxxxxxxxx';% TODO - Specify the target string to search in webpagetargetString = 'is';% TODO - Replace the [] with channel ID to write data to:writeChannelID = xxxxxxx;% TODO - Enter the Write API Key between the '' below:writeAPIKey = 'xxxxxxxxxxxxx';%% Scrape the webpage %%data = urlfilter(url, targetString);display(data);%% Analyze Data %%% Add code in this section to analyze data and store the result in the% analyzedData variable.maxValue =400 ;minValue = 0;if (data > maxValue) || (data < minValue)% Do nothing because data is outside the range defined [0, 400]else%% Write Data %%thingSpeakWrite(writeChannelID, data,'Fields',[1], 'WriteKey', writeAPIKey);end\xa0Option 2: If the data is outside the desired range, then you can write a predefined value to 'writeChannelID'. For example, if the value is greater than 400, then you write 400 and if the value is less than 0, then you write 0:\xa0% TODO - Specify URL of the page to read data fromurl = 'https://api.thingspeak.com/apps/thinghttp/send_request?api_key=xxxxxxxxxxxxx';% TODO - Specify the target string to search in webpagetargetString = 'is';% TODO - Replace the [] with channel ID to write data to:writeChannelID = xxxxxxx;% TODO - Enter the Write API Key between the '' below:writeAPIKey = 'xxxxxxxxxxxxx';%% Scrape the webpage %%data = urlfilter(url, targetString);display(data);%% Analyze Data %%% Add code in this section to analyze data and store the result in the% analyzedData variable.maxValue =400 ;minValue = 0;if (data > maxValue)\xa0 \xa0 analyzedData = maxValue;elseif (data < minValue)\xa0 \xa0 analyzedData = minValue;else\xa0 \xa0analyzedData = data;end%% Write Data %%thingSpeakWrite(writeChannelID, analyzedData,'Fields',[1], 'WriteKey', writeAPIKey);", 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/matlab-thingspeakwrite-data-appears-1-day-off/', 'posts': [{'date': u'January 25, 2018 - 3:09 pm', 'content': u"I'm using thingspeakwrite to upload Nov 2013 data to a new channel. \xa0I downloaded data from a channel dated:\xa022-Nov-2013 00:00:00 UTCThe last data point I processed and wrote is dated 22-Nov-2013 00:00:00.\xa0When I view the data on the graph in the private view on my channel, the last date is: 22-Nov-2013 00:00:00\xa0GMT - 800When I download the newly written channel, the last date is: 2013-11-22 08:00:00 UTCMy data appears to have been shifted ahead 8 hours on the thingspeakwrite step.Is there an error in the way thingspeak is handling these dates, or is there some nuance that I don't understand?", 'num_user_post': u' 70', 'author': u'turgo'}, {'date': u'January 25, 2018 - 6:40 pm', 'content': u"I see in the documentation that:\xa0\xa0'the\xa0Timestamp\xa0provided is interpreted in local timezone.'How do I get thingspeak to take my timestamp data in UTC, or how do I convert it to local time, accounting for daylight savings time?", 'num_user_post': u' 70', 'author': u'turgo'}, {'date': u'January 25, 2018 - 7:07 pm', 'content': u"This timestamp business is a confusing topic. \xa01. For example, when I use thingspeakread in matlab, are the start and end dates in UTC or local time? \xa0The documentation doesn't say.2. Is thingspeakread returning UTC or local time in a timetable?3. Are the datetime values shown in Matlab UTC or local time. \xa04. If I set a local timezone(d.TimeZone = 'America/New_York'), does it affect the timetable I send to thingspeakwrite, or just the display values in the matlab output pane?", 'num_user_post': u' 70', 'author': u'turgo'}, {'date': u'January 26, 2018 - 2:16 pm', 'content': u"Hi turgo,datetime('now') function in MATLAB by default displays the local timezone defined in MATLAB. If you set the time, i.e., evaluate code likedt = datetime('1-Jan-2018'),then the datetime value is assigned to dt (without a timezone). you can assign a timezone to this variable by setting the property:dt.TimeZone = 'America/New_York'ordt.TimeZone = 'local'Refer to this link for further information:https://www.mathworks.com/help/matlab/matlab_prog/specify-time-zones.html-----------------------------------------------------\xa0When you use ThingSpeakRead in MATLAB, the returned timestamps are always in local time by default. This is the case whether you return the data in an array, table, and timetable, i.e., for each of the cases below, timestamps will be in your local timezone:[data, time] = thingSpeakRead(12397, 'NumPoints', 10);dataT = thingSpeakRead(12397, 'NumPoints', 10, 'OutputFormat', 'table');dataTT = thingSpeakRead(12397, 'NumPoints', 10, 'OutputFormat', 'timetable');---------------------------If the timestamps provided to thingSpeakWrite do not have their TimeZone property set, then thingSpeakWrite assumes local timezone (as defined by MATLAB). Else if the timestamps provided to thingSpeakWrite have their TimeZone property set, then thingSpeakWrite will use the specified TimeZone.\xa0-Adarsh\xa0", 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}, {'date': u'January 26, 2018 - 5:13 pm', 'content': u"Thanks Adarsh.\xa0Upon examination of the flow of dates in and out of matlab and thingspeak, I think that there is no problem with the new recorded data:1. \xa0thingspeakread Start and end dates are in local time.2. \xa0Results are returned from thingspeakread to matlab in local time.3. \xa0Datetime values displayed in Matlab are in local time4. \xa0Didn't mess with d.Timezone5. thingspeakwrite converts local times to UTC and writes UTC to the channel feed.", 'num_user_post': u' 70', 'author': u'turgo'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/cant-calculate-max-temperature-for-the-last-30-days-is-there-a-limit/', 'posts': [{'date': u'January 4, 2018 - 4:01 pm', 'content': u"I've chosen a ThingSpeak example: 'Calculate hourly max temperature'I modified the code to calculate the max temperature for 30 days:% Temperature for the past hour is read from a ThingSpeak channel and% maximum temperature is written to another ThingSpeak channel.% Channel 12397 contains data from the MathWorks Weather Station, located% in Natick, Massachusetts. The data is collected once every minute. Field% 4 contains temperature data.% Channel ID to read data fromreadChannelID = 300978;% Temperature Field IDTemperatureFieldID = 2;% Channel Read API Key% If your channel is private, then enter the read API% Key between the '' below:readAPIKey = '';% To store the maximum temperature, write it to a channel other than% the one used for reading data. To write to a channel, assign the write% channel ID to the 'writeChannelID' variable, and the write API Key to the% 'writeAPIKey' variable below. Find the write API Key in the right side pane% of this page.% TODO - Replace the [] with channel ID to write data to:writeChannelID = [];% TODO - Enter the Write API Key between the '' below:writeAPIKey = '';% Read temperature data for the last 60 minutes from the MathWorks Weather% Station. Learn more about the THINGSPEAKREAD function by going to the Documentation% tab on the right side pane of this page.[tempF, timeStamp] = thingSpeakRead(readChannelID, 'Fields', TemperatureFieldID, 'numMinutes', 60*24*30, 'ReadKey', readAPIKey);% Calculate the maximum temperature[maxTempF, maxTempIndex] = max(tempF);% Choose the timestamp at which the maximum temperature was measuredtimeMaxTemp = timeStamp(maxTempIndex);display(maxTempF, 'Maximum Temperature for the last hour is');% Write the maximum temperature to another channel specified by the% 'writeChannelID' variabledisplay(['Note: To successfully write data to another channel, ',...'assign the write channel ID and API Key to ''writeChannelID'' and ',...'''writeAPIKey'' variables above. Also uncomment the line of code ',...'containing ''thingSpeakWrite'' (remove ''%'' sign at the beginning of the line.)'])% Learn more about the THINGSPEAKWRITE function by going to the Documentation tab on% the right side pane of this page.% thingSpeakWrite(writeChannelID, maxTempF, 'timestamp', timeMaxTemp, 'Writekey', writeAPIKey);The code previously was calculating data for 60 minutes, and it works fine.I've changed\xa0it to\xa060*24*30 (trying to calculate for 30 days) and the result (max temperature) is not correct, the result may be true for 7 days but not for 30.Doesn't\xa0matter what I use\xa060*24*7 or\xa060*24*30 or\xa060*24*90 I always get the same max temperature.I assume that there is some limit (probably 8000 points).P.S. I am new to MATLAB, maybe I am doing something wrong, please explain to me.", 'num_user_post': u' 3', 'author': u'Deimos'}, {'date': u'January 4, 2018 - 8:22 pm', 'content': u'You are correct, ThingSpeak limits the number of points you can read with thingSpeakRead or a single REST API call to 8000.\xa0 However, you can read more by creating a loop if you need to.\xa0 Just be careful not to hit the code time maximum for your license type.', 'num_user_post': u' 401', 'author': u'cstapels'}, {'date': u'January 4, 2018 - 10:13 pm', 'content': u"A much better approach than to read more than 8000 points in a loop is to downsample the data and store it in another channel.\xa0So, let's say you are getting raw data from your sensors every 15 seconds. You could set up a timecontrol that runs every hour and averages this data and saves it to another channel. If you needed averaging at a lower resolution, you could further resample the 1 hour averaged data to every day and write to another channel, etc.The main advantage of this approach is that it allows you to operate on smaller amounts of data, which is much more efficient and quick than operating on large arrays of data.To give an analogy, if you had to count the number of grains of sand in a bucket of sand, rather than count each grain, a better approach would be to count the grains in a small cup, and count the number of cups in the bucket. The second is an approximation, but it is a good enough approximation that you can hope to complete the task in a reasonable amount of time than spending a few years on something that doesn't need to be that precise.", 'num_user_post': u' 225', 'author': u'Vinod'}, {'date': u'January 5, 2018 - 8:09 am', 'content': u'I agree, downsampling is a much better solution, and can be exact, not an approximation in the case of measuring a maximum (compared to counting sand).', 'num_user_post': u' 401', 'author': u'cstapels'}, {'date': u'January 6, 2018 - 4:54 pm', 'content': u"I've got a data channel with 8 million fifteen second entries. \xa0I need to aggregate this into hourly averages. \xa0How do I practically do this, given the 8000 point limit, and the 20 second calculation timeout?\xa0", 'num_user_post': u' 70', 'author': u'turgo'}, {'date': u'January 16, 2018 - 6:47 pm', 'content': u"Turgo,One method you could try would be to downsample the data bit by bit and use a timecontrol to run this code regularly.\xa0 The code below uses a new channel and reads its length to determine where to start the downsampling.\xa0 Put the code in a MATLAB analysis and trigger it with a timecontrol.\xa0 It will eventually reach the max or run out of data and stop.\xa0 Then you can turn off the timeControl.You need to set up a new channel and provide its read and write API keys.\xa0 The variable oldChannel is the channel with many entries. hourlyChannel is the downsampled data.\xa0 If your old channel is a private channel, you will need to provide its read api key as well.\xa0oldChannel=1234;hourlyChannel=123456;writeAPIKey='XXXXXXXXXXXXXXXX';readAPIKey='YYYYYYYYYYYYYYYY';sizeCheck=thingSpeakRead(hourlyChannel,'ReadKey',readAPIKey,'numDays',2000,'outputformat','timetable');daySpot=round(height(sizeCheck)/24); % Hourly datadaysMax=1000; % 3 years of dataif (daySpot<daysMax) % Make sure you don't read foreveroneDayData=thingSpeakRead(oldChannel,'DateRange',[datetime('today')-days(daySpot+1),datetime('today')-days(daySpot)],'Outputformat','timetable');if height(oneDayData)>0hourlyData=retime(oneDayData,'hourly','mean');thingSpeakWrite(hourlyChannel,hourlyData,'WriteKey',writeAPIKey);endend\xa0Keep in mind that this method could consume a lot of messages (as many as 24,000).\xa0\xa0For future channels that you need long periods of data from, I suggest setting up a downsampled channel at design time. Hopefully that will save you the trouble next time.\xa0\xa0", 'num_user_post': u' 401', 'author': u'cstapels'}, {'date': u'January 16, 2018 - 7:21 pm', 'content': u"Thanks for your effort to craft this solution. One note, it will take 5 day to run this script on each channel (11 total). \xa0I'd best get going as I have 15 days left!", 'num_user_post': u' 70', 'author': u'turgo'}, {'date': u'January 25, 2018 - 6:09 pm', 'content': u"I discovered that staples method result in a channel which is written backwards in groups. This results in a channel feed that is hard to use and read when downloaded. Here is a method that writes the channel from start to finish averaging hourly data into daily data. \xa0Note the use of channel arrays to manage large numbers of channels. \xa0I assemble the arrays from an excel spreadsheet.% Aggregate daily from hourly (Channel 1) myChannelName = 'Channel 1'; datetimeStart = datetime(2013,11,11); % UPDATE Start date of data channelList = {'Hourly Channel 1';'Daily Channel 1';'Hourly Channel 2}; channelID = {####;####;####}; channelReadKey = {'XXXXXXXXXXX';'XXXXXXXXXX';'XXXXXXXXXXXX'}; channelWriteKey = {'XXXXXXXXXXX';'XXXXXXXXXX';'XXXXXXXXXXXX'}; channelTable = table(channelID,channelReadKey,channelWriteKey,'RowNames',channelList); hourlyChannelID = channelTable.channelID{['Hourly ' myChannelName],:}; hourlyReadAPIKey = channelTable.channelReadKey{['Hourly ' myChannelName],:}; dailyChannelID = channelTable.channelID{['Daily ' myChannelName],:}; dailyReadAPIKey = channelTable.channelReadKey{['Daily ' myChannelName],:}; dailyWriteAPIKey = channelTable.channelWriteKey{['Daily ' myChannelName],:};% determine the next day to read aggregateProgress = thingSpeakRead(dailyChannelID, 'numPoints',1, 'ReadKey', dailyReadAPIKey,'outputFormat', 'timetable'); display(aggregateProgress); if isempty(aggregateProgress) % New Hourly channel display(['Daily channel empty ']); datetimeStop = dateshift(datetimeStart,'start','day') + days(300); else % Existing hourly channel datetimeStart = dateshift(aggregateProgress.Timestamps(1),'start','hour') + hours(24); datetimeStop = dateshift(aggregateProgress.Timestamps(1),'start','day') + days(300); end % Read the next day worth of data display(datetimeStart); display(datetimeStop);data = thingSpeakRead(hourlyChannelID, 'DateRange',[datetimeStart,datetimeStop], 'ReadKey', hourlyReadAPIKey,'outputFormat','timetable'); % display(summary(data)); if height(data) > 5 display(data(1:5,:)); end % Convert text numbers strVars = varfun(@iscellstr,data,'output','uniform'); display(strVars); for varnum = 1:length(strVars) if strVars(varnum) celldata = table2cell(data(:,varnum)); celldata = str2double(celldata); data.(varnum)= celldata; end end % error correction -999 to NaN for humidity data negToNaNfunc = @(x) x .* (x>=-100)./(x>=-100); display(negToNaNfunc(-1000)); data = varfun(negToNaNfunc,data); if height(data) > 5 display(data(1:5,:)); end if isempty(data) display(['No data for that day period']); else dataDaily = retime(data,'daily','mean'); display(dataDaily(1:5,:)); thingSpeakWrite(dailyChannelID, dataDaily, 'Writekey', dailyWriteAPIKey); end", 'num_user_post': u' 70', 'author': u'turgo'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/update-channel-from-output/', 'posts': [{'date': u'January 18, 2018 - 1:49 pm', 'content': u"ANYONE OUT THERE WHO CAN HELP??\xa0can anyone help on what i need to send the data from a matlab output to a field on thingspeak?this is my current code.......% Enter your MATLAB Code belowopts = weboptions('Timeout',15); data = webread('https://api.thingspeak.com/apps/thinghttp/send_request?api_key=PC4EOCTMNDPPQOSW',opts) writeChannelID = xxxxx;% TODO - Enter the Write API Key between the '' below: writeKey = 'xxxxxxxxxx';thingSpeakWrite(writeChannelID,data', writeKey);but it comes up with this in the output????\xa0 data =' 18 6 60 88 'Error using READ TEMP (line 10) Error using thingSpeakWrite Expected a string scalar or character vector for the parameter name.", 'num_user_post': u' 18', 'author': u'jacktheripper125'}, {'date': u'January 19, 2018 - 10:51 am', 'content': u'Bumpy road', 'num_user_post': u' 18', 'author': u'jacktheripper125'}, {'date': u'January 19, 2018 - 11:48 am', 'content': u"I have now got to\xa0this is my current code.......% Enter your MATLAB Code belowopts = weboptions('Timeout',15);data = webread('https://api.thingspeak.com/apps/thinghttp/send_request?api_key=PC4EOCTMNDPPQOSW',opts)writeChannelID = xxxxx;% TODO - Enter the Write API Key between the '' below:writeKey = 'xxxxxxxxxx';thingSpeakWrite(writeChannelID, data, writeKey);but it comes up with this in the output????Lounge_Temp18Loft_Temp6Lounge_Humidity62Loft_Humidity88' must be a string scalar or character vector that can represent a field name.Any ideas how to fix?im not sure the blank lines are causing this but there is no help at all for thingspeak. such a shame as im sure it is just a little bit of code im missing but no one on the forum no help, and no real support unless i want to pay 200 for it?. maybe I should abandon thingspeak\xa0 \U0001f641", 'num_user_post': u' 18', 'author': u'jacktheripper125'}, {'date': u'January 19, 2018 - 1:01 pm', 'content': u"Use 'display(data);' to see what exactly you are sending to thingspeakwrite. \xa0Check out the data format expectations in the documentation for thingspeak write. \xa0Change your code to get the format right. \xa0Good luck!", 'num_user_post': u' 70', 'author': u'turgo'}, {'date': u'January 19, 2018 - 1:43 pm', 'content': u"Thank you for your help, But the data comming in seems fine. I have even got rid of the the spaces before and after from the server but now I just cant get the code to push it to the fields into the channelmy code is below (including your display data) and the output.What i need is the code to get the it to the fields. but nothing I try has worked? why is it so difficult??the field names are there and they match my fields I am guessing that I need to push them to the database but nothing I have tried gets any part of it to the database.\xa0data = webread('https://api.thingspeak.com/apps/thinghttp/send_request?api_key=PC4EOCTMNDPPQOSW',opts)writeChannelID = 405063;writeKey = 'UGEUH8A5T1V9AFA9';display(data);thingSpeakWrite(writeChannelID, data, writeKey);\xa0\xa0my output is\xa0data = 'Lounge_Temp 17 Loft_Temp 6 Lounge_Humidity 64 Loft_Humidity 88'data = 'Lounge_Temp 17 Loft_Temp 6 Lounge_Humidity 64 Loft_Humidity 88'Error using READ TEMP (line 13)Error using thingSpeakWriteUnmatched parameter name 'Lounge_Temp 17 Loft_Temp 6 Lounge_Humidity 64 Loft_Humidity 88' must be a string scalar or character vector that can represent a field name.", 'num_user_post': u' 18', 'author': u'jacktheripper125'}, {'date': u'January 19, 2018 - 9:34 pm', 'content': u'You can use a single MATLAB analysis to scrape your data, parse the different fields and write it to 4 fields of a channel, or 4 different channels, if that is what you wish.The example I wrote is in this post.', 'num_user_post': u' 225', 'author': u'Vinod'}, {'date': u'January 20, 2018 - 1:40 am', 'content': u"It looks to me like your 'data' is a string with line feeds in it. \xa0I bet that thingspeakwrite doesn't like that. \xa0The documentation shows that thingspeakwrite expects data types:data — Data to write to channelarray | numeric | table | timetable\xa0I'd look for some slick matlab command to load your string with line feeds into a table.You could also try commas instead of line feeds.This stuff is hard. \xa0You'll get it.", 'num_user_post': u' 70', 'author': u'turgo'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/how-to-determine-the-date-of-the-first-channel-entry-point/', 'posts': [{'date': u'January 16, 2018 - 2:55 pm', 'content': u"I'm trying to\xa0determine the date of the first channel entry point. \xa0This would seem a simple exercise, but there are problems. \xa0For example, downloading the channel yield a 500 mb file which is impossible to open. \xa0Using thingspeak read with a broad range of dates yields only the ending points. \xa0If the dates are both prior to the channel start, an error is generated. \xa0What do I do?\xa0It would be really helpful for thingspeak read to have the ability to return points by index value.", 'num_user_post': u' 70', 'author': u'turgo'}, {'date': u'January 16, 2018 - 5:52 pm', 'content': u'If have the file on a Linux computer, you can use the head command.\xa0If you are on Windows, you will need to open up a powershell and executeget-content c:path_to_fileyour_file_name -totalcount 10to get the first 10 lines.Out of curiosity, of this 500MB of data how much of it is critical to you and how do you use it?', 'num_user_post': u' 225', 'author': u'Vinod'}, {'date': u'January 16, 2018 - 7:02 pm', 'content': u"I use the data in realtime as a gage. \xa0Rapid update is important. \xa0However, I don't need this kind of resolution in the historical data, hence my other threads about consolidating my data. \xa0Is there a unix shell command that will work on the mac OS?", 'num_user_post': u' 70', 'author': u'turgo'}, {'date': u'January 16, 2018 - 7:30 pm', 'content': u'The head command should work on the Mac. Tryhead -n 10 filename.csv', 'num_user_post': u' 225', 'author': u'Vinod'}, {'date': u'January 20, 2018 - 1:29 am', 'content': u'I found another way. \xa0First, start downloading the entire channel; then cancel the download; finally open the small file containing the first points.', 'num_user_post': u' 70', 'author': u'turgo'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/time-to-consolidate-my-data/', 'posts': [{'date': u'December 6, 2016 - 8:28 pm', 'content': u'Thanks Hans, for all the years of ThingSpeak functionality and data storage. \xa0I have gigabytes of data on your servers, and with the new pricing, I need to average it down into new channels. \xa0How do I do this? \xa0I expect there will be many users in my situation, is there a template for doing this?', 'num_user_post': u' 70', 'author': u'turgo'}, {'date': u'January 6, 2018 - 11:39 am', 'content': u"The free year is almost expired, and now I need to consolidate my data. \xa0Again I ask, 'How do I do this? \xa0I expect there will be many users in my situation, is there a template for doing this?'", 'num_user_post': u' 70', 'author': u'turgo'}, {'date': u'January 16, 2018 - 6:51 pm', 'content': u"I've posted a slow but sure solution in another topic.\xa0 Please let us know if that helps.", 'num_user_post': u' 401', 'author': u'cstapels'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/how-to-perform-operations-on-8-million-points/', 'posts': [{'date': u'January 9, 2018 - 11:56 am', 'content': u'How do I do processing on large channels, with, say 8 million points. \xa0The apparent limitations are 8000 points per load, and the 20 second compute timeout.', 'num_user_post': u' 70', 'author': u'turgo'}, {'date': u'January 16, 2018 - 6:50 pm', 'content': u"I've posted a slow but sure solution in another topic.", 'num_user_post': u' 401', 'author': u'cstapels'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/matlab-hexadecimal-number-conversion/', 'posts': [{'date': u'January 4, 2018 - 9:22 am', 'content': u"Hi, i would like to ask for help.I am sending value to thingspeek periodically (lets say every 5 minute) where the original message is number. But the transmission changes the string(number value) into hex format, so instead of 40 i do receive\xa03430, after 5 minutes instead of value lets say 45 i receive\xa03435 and so on. I want to plot original values. I started with analysis tool writing code below, but i need help with function for changing hexadeciaml value back into original value.readChannelID = xxxxx;readAPIKey = 'xxxxxx;writeChannelID = xxxxxx;writeAPIKey = 'xxxxxx;data = thingSpeakRead(readChannelID, 'ReadKey', readAPIKey,'OutputFormat','table');analyzedData = data; analyzedData.('Counter') = data.('Counter');thingSpeakWrite(writeChannelID, analyzedData, 'WriteKey', writeAPIKey);Tank you", 'num_user_post': u' 1', 'author': u'avbuuren'}, {'date': u'January 4, 2018 - 11:09 am', 'content': u"try this:value = '3435';intConvert=str2num(char(sscanf(value,'%2x')'))notice that value has to be a character vector.If you can keep the device or program that is posting from converting to hex, ThingSpeak will definitely accept field values as string.\xa0 However, adding a string manipulation class your code may not be easy if you are using a limited hardware.\xa0\xa0", 'num_user_post': u' 401', 'author': u'cstapels'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/derivation-of-channel-data/', 'posts': [{'date': u'December 21, 2017 - 6:37 am', 'content': u"Hello,I want to create a plot with the derivation of existing channel-data.I send about every 5 minutes the amount of used energy to thingspeak. This is more or less a constant increasing value.Watching these values in a graph is boring.I want to display the derivation of these values in a graph.Example:Sending each time a value of totally used Kilo-Watt-Hours (kWh):100,00 ... 100,01 ... 100,02 ... 100,03 ... 100,10 (using the microwave) ... 100,11 ... 100,12 ... 100,12 (main fuse blows) ... 100,12 ...This should display a const horizontal line with a single peak (microwave) and going back to zero at the end.I tried this but i does not work:[energyData, time] = thingSpeakRead(readChannelID, 'Fields', energyFieldID, 'NumPoints', 100, 'ReadKey', readAPIKey);dydx = diff(energyData(:))./diff(time(:)); % Cannot divide a double array by a duration array.\xa0And it should be some kind of logarithm. I want to see small changes (e.g. kitchen-light with 60W) as well as big changes (e.g. microwave with 1500W).\xa0Is there a easy way to do so?Thanks a lot!", 'num_user_post': u' 3', 'author': u'Max Marder'}, {'date': u'December 21, 2017 - 1:29 pm', 'content': u'Try converting to seconds:dydx = diff(data(:))./seconds(diff(time(:)));', 'num_user_post': u' 401', 'author': u'cstapels'}, {'date': u'December 21, 2017 - 3:37 pm', 'content': u"Hy,thanks a lot for the really fast response!I guess its pretty close to a working solution...:My code is:[data, time] = thingSpeakRead(readChannelID, 'Field', fieldID1, 'NumPoints', 250, 'ReadKey', readAPIKey);dydx = diff(data(:))./seconds(diff(time(:)));thingSpeakPlot(time, dydx);And the result is:Error using thingSpeakPlot (line 59)X must be same length as Y.Error in Create a 2-D line plot 2 (line 25)thingSpeakPlot(time, dydx);\xa0Can you help me one more time?", 'num_user_post': u' 3', 'author': u'Max Marder'}, {'date': u'December 26, 2017 - 10:01 am', 'content': u"Since dxdy is a difference, there is one less point in that array, compared to the time stamps. After you do the calculation, remove the first point in the time array.I changed one of your variable names in the code below.[data, times] = thingSpeakRead(readChannelID, 'Field', fieldID1, 'NumPoints', 250, 'ReadKey', readAPIKey);dydx = diff(data(:))./seconds(diff(times(:)));times(1)=[];\xa0 %remove one data point for plotting.\xa0 MATLAB arrays stary at 1, not zero.thingSpeakPlot(times, dydx);", 'num_user_post': u' 401', 'author': u'cstapels'}, {'date': u'January 2, 2018 - 1:59 pm', 'content': u"PERFECTThanks a lot, nice christms gift \U0001f642\xa0My code looks at the end like this:%% Energy - 2 days deviation log%readChannelID = xxx; % public!fieldID = yy;% numOfPoints = 750;% numOfHours = 2;numOfDays = 2;readAPIKey = '';\xa0%% Read Data %%% [data, time] = thingSpeakRead(readChannelID, 'Field', fieldID, 'NumPoints', numOfPoints, 'ReadKey', readAPIKey);[data, time] = thingSpeakRead(readChannelID, 'Field', fieldID, 'NumDays',numOfDays);dydx = 100 * (diff(data(:))./seconds(diff(time(:))));numOfPoints = numel(time); % Number of array elementsdisp(['numOfPoints is: ''', num2str(numOfPoints), '''']);time2 = time(2:numOfPoints,1);whos; % DEBUGGING%% Visualize Data %%thingSpeakPlot(time2, dydx, 'LineWidth',1, 'Color','red', 'YScale','log');\xa0", 'num_user_post': u' 3', 'author': u'Max Marder'}, {'date': u'January 2, 2018 - 3:36 pm', 'content': u'Thanks for posting the solution, I like your syntax better - it is more generic. (and happy new year too!)', 'num_user_post': u' 401', 'author': u'cstapels'}]}]}, {'url': u'https://community.thingspeak.com/forum/matlab/page-3/', 'threads': [{'url': u'https://community.thingspeak.com/forum/matlab/all-data-download-to-matlab/', 'posts': [{'date': u'December 1, 2017 - 6:40 pm', 'content': u"Hi!How do I download all the data from the channel and open it in MATLAB? I saw the download in CSV but it's not ok for MATLAB. I tried webread with the json page but it only has 100 data points.Could you please help?Channel ID is:\xa0372152.Thank you!", 'num_user_post': u' 1', 'author': u'fcoppo'}, {'date': u'December 2, 2017 - 1:29 pm', 'content': u'You can use the ThingSpeak Support Toolbox\xa0from desktop MATLAB to directly pull the data into MATLAB without having to go through a file. You can also use the same functions in MATLAB apps on ThingSpeak.', 'num_user_post': u' 225', 'author': u'Vinod'}, {'date': u'December 4, 2017 - 1:21 pm', 'content': u'Using thingSpeakRead() in the\xa0ThingSpeak Support Toolbox\xa0is the easiest way.\xa0If you do need to use the REST command to get channel information with webread,\xa0 you can use the results parameter to increase the number of entries up to 8000\xa0GET https://api.thingspeak.com/channels/9/fields/1.json?results=8000', 'num_user_post': u' 401', 'author': u'cstapels'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/visualizations-all-empty/', 'posts': [{'date': u'September 24, 2017 - 11:16 am', 'content': u"Why do visualizations no longer work since some days ? Before everything was ok. All Graphics are now empty and I can't create\xa0 new ones. Matlab Code runs successfully but nothing shows up", 'num_user_post': u' 5', 'author': u'chrissaxon'}, {'date': u'September 24, 2017 - 11:38 pm', 'content': u'The visualizations seem to work fine on my channel.Can you please share a screenshot of the channel view? Alternatively, please share the channel privately with me (vinod<period>cherian@mathworks<period>com)', 'num_user_post': u' 225', 'author': u'Vinod'}, {'date': u'September 25, 2017 - 4:03 am', 'content': u'OK, thanks for the reply, I have shared the channel with you. Hope you can fix the issue.', 'num_user_post': u' 5', 'author': u'chrissaxon'}, {'date': u'November 3, 2017 - 12:04 pm', 'content': u'Same problem again!A few hours ago everything was fine. I did not change anything.Now all my visualizations\xa0 are empty!', 'num_user_post': u' 5', 'author': u'chrissaxon'}, {'date': u'November 6, 2017 - 3:46 pm', 'content': u'Now everything is ok again. Visualizations are ok.', 'num_user_post': u' 5', 'author': u'chrissaxon'}, {'date': u'November 6, 2017 - 3:49 pm', 'content': u'\xa0It tried mine after I read your post and they seemed to be working by then.\xa0 \xa0 Good to hear.\xa0 Thanks for updating the thread.\xa0\xa0', 'num_user_post': u' 401', 'author': u'cstapels'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/thingspeakplot-plot-data-from-multiple-fields-with-yticks/', 'posts': [{'date': u'November 4, 2017 - 1:36 am', 'content': u'I have made a plot from multiple fields using thingSpeakPlot which works but my fields can only have the value 1 or 0 corresponding to On or Off.The problem I have is the y-scale is 0 to 1 with 0.1 ticks which does not look that good. Is there a way to do any of the following.Use the yticks? I tried but cannot get it to work.Use another method to set the ticks to just 0 and 1.To remove the tick labels completely?ThanksKim', 'num_user_post': u' 2', 'author': u'kim'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/background-color/', 'posts': [{'date': u'November 1, 2017 - 12:40 pm', 'content': u"Hi everyone,\xa0How can i change the color of graph background\xa0 in matlab visualization ??Is there any solution?\xa0\xa0Thank you for your answershere is my code% Template MATLAB code for visualizing data using the THINGSPEAKPLOTYY% function.% Prior to running this MATLAB code template, assign the channel ID to read% data from to the 'readChannelID' variable. Also, assign the field IDs% within the channel that you want to read data from to 'fieldID1', and% 'fieldID2'.% TODO - Replace the [] with channel ID to read data from:readChannelID = 343953;% TODO - Replace the [] with the Field ID to read data from:fieldID1 = 1;% TODO - Replace the [] with the Field ID to read data from:fieldID2 = 2;% Channel Read API Key% If your channel is private, then enter the read API% Key between the '' below:readAPIKey = 'DT410A2H8TT2VPXI';%% Read Data %%% Read first data variable[data1, time1] = thingSpeakRead(readChannelID, 'Field', fieldID1, 'NumPoints', 850, 'ReadKey', readAPIKey);% Read second data variable[data2, time2] = thingSpeakRead(readChannelID, 'Field', fieldID2, 'NumPoints', 850, 'ReadKey', readAPIKey);%% Visualize Data %%thingSpeakPlotYY(time1, data1,time2, data2,'Title','T\xb0 sol 15 cm (rouge) & 30 cm(bleu)','Grid','on');", 'num_user_post': u' 6', 'author': u'gillesroszak'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/plot-suddenly-not-working/', 'posts': [{'date': u'October 30, 2017 - 8:01 pm', 'content': u"Hi AllI had the below code working a week ago, and now that I finally got my setup deployed, its not working.The marker only lines work, but the lines (AKA (:,1) and (:,3)) don't show at all, however its clear that the scaling is correct for the actual data.What gives?https://thingspeak.com/apps/matlab_visualizations/180907\xa0Thanks\xa0readChannelID = [];% TODO - Replace the [] with the Field ID to read data from:fieldIDs = [1,2,3,4];% Channel Read API Key% If your channel is private, then enter the read API% Key between the '' below:readAPIKey = '';%% Read Data %%%%[data, time] = thingSpeakRead(readChannelID, 'Field', fieldID1, 'NumPoints', 30, 'ReadKey', readAPIKey);[TempData,timeStamps] = thingSpeakRead(readChannelID,'fields',fieldIDs,'NumDays',7,'ReadKey',readAPIKey);%% Visualize Data %%\xa0plot(timeStamps,TempData(:,1));hold onplot(timeStamps,TempData(:,2),'rX','MarkerSize',10);hold onplot(timeStamps,TempData(:,3),'g');hold onplot(timeStamps,TempData(:,4),'k+','MarkerSize',10);xlabel('Time')ylabel('Temperature')legend({'Well Temp','Power Loss Min Well Temp','Outside Temp','Power Loss Min Outside Temp'})grid('on')title('Cabin Temp - Last Week')hold off", 'num_user_post': u' 4', 'author': u'lboucher'}, {'date': u'October 31, 2017 - 7:23 am', 'content': u"My guess is it is the data you are reading.\xa0\xa0I tried your code with some made up data and I see all the lines.\xa0 Have a look at each series individually- make sure there aren't NAN's or missing points or text data.timeStamps=100:200; TempData(:,1)=1:101; TempData(:,2)=201:301; TempData(:,3)=301:401; TempData(:,4)=401:501;plot(timeStamps,TempData(:,1));hold onplot(timeStamps,TempData(:,2),'rX','MarkerSize',10);hold onplot(timeStamps,TempData(:,3),'g');hold onplot(timeStamps,TempData(:,4),'k+','MarkerSize',10);xlabel('Time')ylabel('Temperature')legend({'Well Temp','Power Loss Min Well Temp','Outside Temp','Power Loss Min Outside Temp'})grid('on')title('Cabin Temp - Last Week')hold off", 'num_user_post': u' 401', 'author': u'cstapels'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/simple-xtickformat-question/', 'posts': [{'date': u'October 22, 2017 - 7:29 pm', 'content': u"Hi AllI'm a newb and this should be a real simple question. Trying to plot some data for the past week which works, but the X Ticks are unreadable. I would like it to just display the month and day, regardless of scrolling or zooming.Link to unreadable plothttps://thingspeak.com/apps/matlab_visualizations/180907I have been searching the documenation on xtickformat and xdatetick, but nothing works.My code is below, if I run it with the xtickform('MM-dd') i get the following error.Error using xtickformat (line 34) Invalid numeric tick label format.Error in Last Week Cabin Well Temperature (line 30) xtickformat('MM-dd');Also, a secondary question. I would like 1 line to plot solid, and another to plot only markers. I assume I must specifically edit each line as desire after the thinkspeakplot command, but I don't know the syntax.\xa0Any help is much appreaciated. Thanks!readChannelID = [339540]; fieldIDs = [1,2,3,4]; readAPIKey = ''; [TempData,timeStamps] = thingSpeakRead(readChannelID,'fields',fieldIDs,'NumDays',7,'ReadKey',readAPIKey);thingSpeakPlot(timeStamps,TempData,'xlabel','TimeStamps',... 'ylabel','Measured Values','title','Last Week Cabin Temperature Data',... 'Legend',{'Well Temp','Power Loss Well Min Temp','Outside Temp','Power Loss Outside Temp'},'grid','on');xtickformat('MM-dd');", 'num_user_post': u' 4', 'author': u'lboucher'}, {'date': u'October 23, 2017 - 3:06 pm', 'content': u"thingSpeakPlot() has some extra functionality built in to simplify things, but it doesn't have all of the MATLAB plot options.\xa0You could use plot();plot(timeStamps,TempData);xlabel('TimeStamps');ylabel('Measured Values');title('Last Week Cabin Temperature Data');grid onlegend({'Well Temp','Power Loss Well Min Temp','Outside Temp','Power Loss Outside Temp'})xtickformat('MM-dd');For your secondary question, have a look at the line specification page.\xa0 There are some examples using multiple line styles there.\xa0\xa0", 'num_user_post': u' 401', 'author': u'cstapels'}, {'date': u'October 23, 2017 - 9:50 pm', 'content': u"Thanks!I was thinking along those lines, but wasn't sure how much of Matlab thingspeak supports.Been about 10 years since i have done heavy matlab work.", 'num_user_post': u' 4', 'author': u'lboucher'}, {'date': u'October 24, 2017 - 7:21 am', 'content': u'Follow on question.Now i have a plot looking the way I want, but I loose the dynamic zooming capability.Inspecting the html coming back to the browser, it appears that\xa0 using the plot command results in an image coming back to the browser instead of a webplot when using thingSpeakPlot.Any way to get zoom control when using regular old plot.I do online there is some fancy javascript out there to make nice looking plots, but thats probably more work than i need to do.', 'num_user_post': u' 4', 'author': u'lboucher'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/data-analysis-and-predictive-analysis/', 'posts': [{'date': u'September 21, 2017 - 6:31 am', 'content': u'I am currently doing a school project where i collect data using the Bosch XDK 110 sensor and send the data to ThingSpeak, which i then need to analyse the data and figure out the predictive algorithm. I am currently using sample data to work on to try it out first. However i am unsure of how to do data analysis. May i request help from anybody who knows to help out.', 'num_user_post': u' 5', 'author': u'decx'}, {'date': u'September 21, 2017 - 3:23 pm', 'content': u'What data are you collecting and what are you trying to predict? That kit has an Accelerometer, Gyroscope, Humidity, Magnetometer, Pressure, Temperature Sensor. (according to the spec)', 'num_user_post': u' 401', 'author': u'cstapels'}, {'date': u'September 27, 2017 - 8:57 am', 'content': u'I will be collecting and predicting temperature.', 'num_user_post': u' 5', 'author': u'decx'}, {'date': u'September 28, 2017 - 4:28 pm', 'content': u'Hi,The question is too general, that is why it is not possible to give you precise answer, but I will try to give you some tips.First, answer for yourself for these two questions:How often you will read temperature data? Once per month/week/day/hour/minute?How many data points you want to predict?\xa0Generally, analysing temperature data you can expect periodical behaviour. So, you may assume model: some cyclical trend (maybe even some deterministic function like sin or cos) and some noise.Check (google) Holt-Winters seasonal model.\xa0Regardsgc', 'num_user_post': u' 10', 'author': u'trach555'}, {'date': u'September 28, 2017 - 11:00 pm', 'content': u"I believe thingspeak allows data insertion once every 15 seconds for the trial account, however, not sure why, the bosch sends out data about every 1 min. The temperature will always be monitored, as i am doing a Industry 4.0 project, doing machine monitoring. So, it's like a live monitoring thing.\xa0I am, however, unsure of how many data points to predict as i've never done this before. But for my current project, i can say, perhaps just a small amount should be enough.\xa0My plan is: To get the average working temperature of the machine, in my case, a 3d printer. So when there is a anomaly in the temperature, it sends out notifications via thingHTTP and thingTweet to notify the user.", 'num_user_post': u' 5', 'author': u'decx'}, {'date': u'September 29, 2017 - 4:29 pm', 'content': u"Your plan doesn't sound like a prediction model. It is more like an alert when present situation is different than normal/average behaviour.Simple solution:You can calculate simple mean of your temperature AVG measurements and its standard deviations SD.Then you can rise an alarm if present temperature does not belong into interval (AVG - alpha1*SD, AVG + alpha2*SD), where alpha1 and alpha2 are some constants.Those constants depends how much dispersion from the mean you are able accept as normal. alpha1 and alpha2 could be equal, but it is up to you if you want symmetrical interval or not. For example, you can accept AVG - 3*SD temperature, but you will want to rise an alarm if temperature exceeds value AVG+2*SD.\xa0 \xa0\xa0\xa0Add some complexity:Will you be measuring the temperature 24h per day or just when 3d printer is on?If you think about measuring the temperature 24h per day\xa0you'll have to face cyclical behaviour - you will have different values temperature at night and during the day and also it does matter if the 3d printer is on or off.\xa0So, the simple model should be divided (your measurments) on some time intervals conditionally if your 3d printer is on or off.\xa0\xa0", 'num_user_post': u' 10', 'author': u'trach555'}, {'date': u'October 2, 2017 - 6:19 am', 'content': u'I think i made a mistake in try to explain what im doing but i see you got the right idea. But i need a predictive graph for my project as well. As for my project, we are aiming to integrate Industry 4.0 into it. Attached is the link to what Industry 4.0 is aiming for.\xa0\xa0As for that, it requires 24h monitoring as it will mostly be used on heavy machineries used in factories. However, i forgot about the fact that im using a 3d printer, therefore it will only be monitored when it is on.', 'num_user_post': u' 5', 'author': u'decx'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/creating-scatter-or-2-d-line-plot-for-1-day-data/', 'posts': [{'date': u'September 19, 2017 - 12:31 pm', 'content': u'Hello everyone,I am new to ThingSpeak and I am getting data from 2 sensors for liquid measurement onto my thingSpeak channel. I want to create a MATLAB visualization that combines data from 2 fields of the channel, combine the data for a day and display it in the form of scatter or 2-d line plot. How can I do that? I am new to MATLAB and thingSpeak.\xa0\xa0I look forward to your answers.Thanks', 'num_user_post': u' 8', 'author': u'rushanarshad'}, {'date': u'September 29, 2017 - 4:58 pm', 'content': u"Hi,You have to just clicked 'Matlab visualisation' and the choose 'Create correlation plot'.You will be on the tab with some code already prepared. In the code you must put in proper place (there are suitable comments) your channel Id and fields' Ids.In thingSpeakRead() function you will see 'NumPoints' parameter with default value 30. Then you must adjust this number to get values from one day if you think about day as a 24 hour period.\xa0If you think about one day as exactly one day (one date in calendar) you will have adjust this number as above, but then you will have to filter data to only present date.Regardsgc\xa0", 'num_user_post': u' 10', 'author': u'trach555'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/matlab-visualisation-not-working/', 'posts': [{'date': u'September 22, 2017 - 3:11 pm', 'content': u"Hi,I am using 2d plot with two y-axes. It was working when I configured it, but on another day it stopped working.When I edit the code and hit 'save and run' button I see info that Matlab code run successfully, but there is no Matlab plot output.What is going on?", 'num_user_post': u' 10', 'author': u'trach555'}, {'date': u'September 24, 2017 - 4:51 am', 'content': u"trach555 said Hi, I am using 2d plot with two y-axes. It was working when I configured it, but on another day it stopped working. When I edit the code and hit 'save and run' button I see info that Matlab code run successfully, but there is no Matlab plot output. What is going on?\xa0\xa0^ Exactly the same problem as above. The visualizations ceased to work a few days ago.", 'num_user_post': u' 1', 'author': u'getty'}, {'date': u'September 24, 2017 - 11:42 pm', 'content': u"Thank you for reporting this. I am unable to reproduce this on my channels.Could one of you facing the problem please share a screenshot, or share the channel privately with me (vinod<period>cherian@mathworks<period>com)?\xa0If you don't mind sharing the code used on the visualization with the read API keys redacted, that would be helpful in debugging the issue.", 'num_user_post': u' 225', 'author': u'Vinod'}, {'date': u'September 25, 2017 - 2:04 pm', 'content': u"For the folks who reported this, are you using data from the weather channel? Are you pre-processing your data to remove NaN's?\xa0Before plotting your data can you display the data that is being plot and observe if it has NaN's in them?", 'num_user_post': u' 225', 'author': u'Vinod'}, {'date': u'September 25, 2017 - 5:29 pm', 'content': u"Hello,I think I have the same problem :I already had an old chart visualization on my channel from months ago, and I can see my data updating.The problem is my NEW plot visualizations don't work too.When \xa0hit 'save and run' , I see info that Matlab code ran OK, but there is no \xa0plot output, only a blank windowTried some examples, but plot visualizations don't work.What is happening ?", 'num_user_post': u' 1', 'author': u'LvdK'}, {'date': u'September 26, 2017 - 6:42 am', 'content': u"Hi,There are no NaN's in data. If I scratch semicolon after subsetting data1 I can see data in Output window, but there is no plot in Matlab plot Output window (and also on private view there is only empty 'iframe').I use Chrome. On Microsoft Edge it behaves exactly the same.My channel is marked as public, so you do not need API key. Below is my code. But the same happens when I just create new Matlab Visualisation and put channelId and fieldId (no matter which visualisation or even analysis I chose).\xa0% Template MATLAB code for visualizing data using the THINGSPEAKPLOTYY% function.% Prior to running this MATLAB code template, assign the channel ID to read% data from to the 'readChannelID' variable. Also, assign the field IDs% within the channel that you want to read data from to 'fieldID1', and% 'fieldID2'.% TODO - Replace the [] with channel ID to read data from:readChannelID = 212263;% TODO - Replace the [] with the Field ID to read data from:fieldID1 = 7;% TODO - Replace the [] with the Field ID to read data from:fieldID2 = 7;% Channel Read API Key% If your channel is private, then enter the read API% Key between the '' below:readAPIKey = '';%% Read Data %%n = 30;% Read first data variable[data1, time1] = thingSpeakRead(readChannelID, 'Field', fieldID1, 'NumPoints', n, 'ReadKey', readAPIKey);data1 = data1(1:2:end, 1);time1 = time1(1:2:end, 1);% Read second data variable[data2, time2] = thingSpeakRead(readChannelID, 'Field', fieldID2, 'NumPoints', n, 'ReadKey', readAPIKey);data2 = data2(2:2:end, 1);time2 = time2(2:2:end, 1);%% Visualize Data %%if (min(data1) > 0) thingSpeakPlotYY(time1, data1, time2, data2, 'Color1', [0.35 0.0 0.0], 'Color2', 'blue', ... 'LineWidth1', 2,'LineWidth2', 2, 'YLabel1', 'G_Humidity', 'YLabel2', 'Photo');else thingSpeakPlotYY(time1, data1, time2, data2, 'Color1', 'blue', 'Color2', [0.35 0.0 0.0], ... 'LineWidth1', 2,'LineWidth2', 2, 'YLabel1', 'Photo', 'YLabel2', 'G_Humidity');endRegardsgc", 'num_user_post': u' 10', 'author': u'trach555'}, {'date': u'September 26, 2017 - 9:50 am', 'content': u"We're able to reproduce the issue. It appears to impact the thingSpeakPlot, thingSpeakPlotYY, and similar functions.\xa0Note that visualizations using the MATLAB plot, plotYY and similar functions are unaffected.We are investigating a solution that does not require any code changes to your code. Thank you for your patience as we work to resolve the issue.", 'num_user_post': u' 225', 'author': u'Vinod'}, {'date': u'September 27, 2017 - 4:48 am', 'content': u'New version of Java killed functionality...?', 'num_user_post': u' 10', 'author': u'trach555'}, {'date': u'September 28, 2017 - 12:28 pm', 'content': u'A fix was deployed earlier today that restored full functionality. Everything is working as documented.Please let us know if you are still seeing any issues.', 'num_user_post': u' 225', 'author': u'Vinod'}, {'date': u'September 28, 2017 - 4:07 pm', 'content': u"Yes, it is working now.Is it intentional behaviour that Matlab visualisation can be displayed only in private view? I found some info, that Matlab visualisations are preferred option for public view instead of plugins like google gauge for example which cannot be used in public view. Even, the comment for for multiple series chart plugin says'NOTE: This plugin will not be visible on public views of a channel. If you intend to make your channel public, consider using the MATLAB Visualization App to create your visualizations.'Regardsgc", 'num_user_post': u' 10', 'author': u'trach555'}, {'date': u'September 28, 2017 - 4:54 pm', 'content': u"It is possible to add a MATLAB visualization to the public view of your channel. Steps:1) Make your channel public2) On the MATLAB visualization page, check the checkbox that says 'Create a public URL'3) On the same page, enable the checkbox to add the visualization to the public view of the channel.Let me know if that doesn't work.\xa0", 'num_user_post': u' 225', 'author': u'Vinod'}, {'date': u'September 29, 2017 - 4:39 pm', 'content': u"Yes, it works.It wasn't clear for me that I must 'create a public URL'. I just saw the tooltip, which appear when you drug mouse on the checkbox 'public view' - it says 'Matlab visualisation is private' (when checkbox 'create public url' is not marked).Thanks.", 'num_user_post': u' 10', 'author': u'trach555'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/matlab-visualizations-to-do-predictive-algorithm-and-show-average-temperature/', 'posts': [{'date': u'September 25, 2017 - 12:24 pm', 'content': u"% Enter your MATLAB code belowreadChId = 322698;readKey = '548GQEP6OLOSFZIR';writeChId = 334199;writeKey = 'ERGWRT0AC8YB5B9Z';[temp,timeStamps] = thingSpeakRead(readChId,'fields',[1],... 'NumPoints',100,'ReadKey',readKey);thingSpeakWrite(writeChId,[tempAvg],'Fields',[1],...'TimeStamps',timeStamps,'Writekey',writeKey);thingSpeakPlot(timeStamps,tempAvg,'xlabel','TimeStamps',...'ylabel','Avg Temp','title','Average temperature',...'Legend',{'Avg Temperature'},'grid','on');\xa0Above is my current code. I am doing a school project on machine monitoring and i need to calculate the average temperature of every 4 data inputted from the sensor i have(bosch xdk 110). Then find out what's the average working temp, so when there is anomaly in the temperature, the predictive algorithm can hopefully display it and send an alert to the user(thingtweet or twillio)Please help me out with how i can make this current code find the average of every 4 data inputted and also how to write the predictive algorithm code as i've seen multiple codes but i don't understand it.", 'num_user_post': u' 5', 'author': u'decx'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/displaying-data-from-different-fields-into-one-bar-chart/', 'posts': [{'date': u'September 17, 2017 - 3:49 pm', 'content': u"\xa0Hello everyone,\xa0\xa0I am using MATLAB visualizations to display data from two fields of same channel in one chart. Basically, i want to calculate average liquid from two liquid sensors into one chart. It works for one field with the following line of code to extract data from one field:\xa0data1 = thingSpeakRead(CID,'NumPoints',10,... 'Fields',1);But when i use the same code and add them, it doesnt display anything.\xa0\xa0Can anyone help me with this problem?\xa0\xa0Thanks.\xa0", 'num_user_post': u' 8', 'author': u'rushanarshad'}, {'date': u'September 18, 2017 - 5:38 pm', 'content': u"There could be \xa0different data types or missing data in one of the arrays. \xa0If you remove the semicolon, the output window should show you the values in data1. \xa0Do the same thing for your other sensor, and make sure there isn't any text in there or missing values by accident. \xa0 \xa0Can you show the step where you are averaging the values, and then the step where you plot the values? \xa0", 'num_user_post': u' 401', 'author': u'cstapels'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/matlab-visualization-dynamic-update/', 'posts': [{'date': u'August 24, 2017 - 6:28 am', 'content': u"Hi All,Im using the following code in MATLAB visualization to display some text of a field value in a public view. The problem is it does not dynamically update. How do i achieve that?\xa0Code...................................................FlowLh = thingSpeakRead(xxxxxxxx,'Field',1);FlowLh = FlowLh/1000annotation('textbox',[0.2 0.2 0.6 0.6],...'HorizontalAlignment','center',...'VerticalAlignment','middle',...'LineStyle','none',...'String',[num2str(FlowLh) ' m3'],...'FontSize',48);\xa0ThanksRay", 'num_user_post': u' 11', 'author': u'rayellam'}, {'date': u'August 24, 2017 - 2:05 pm', 'content': u'Ray,The MATLAB code will only run when you tell it to.I would suggest setting a TimeControl\xa0to update your value on a regular schedule, or you could set up a React to change every time the channel value changes.', 'num_user_post': u' 401', 'author': u'cstapels'}, {'date': u'September 8, 2017 - 4:58 am', 'content': u"Hi,Thanks for the reply but it seems that time and react controls will only work with MATLAB Analysis and NOT with visualization. If im correct then this seems like a major draw back? Can anyone confirm this is the case as my MATLAB experience is very limited.\xa0I am using this NON ELEGANT work around to refresh the public view, below. Edit your public channel ID and refresh time then save as an html file. Then run this file.<html lang='en'> <body style='margin:0;padding:0'> </body> var width = window.innerWidth || document.documentElement.clientWidth || document.body.clientWidth; var height = window.innerHeight || document.documentElement.clientHeight || document.body.clientHeight; var frameHdl = document.getElementById('myIFrame'); frameHdl.src = 'https://thingspeak.com/channels/YOUR CHANNEL NUMBER HERE' frameHdl.height = height; frameHdl.width = width; window.setInterval('reloadPage();', 1*60*1000); //minutes to milliseconds function reloadPage() { location.reload(true); }</html>\xa0TIARay", 'num_user_post': u' 11', 'author': u'rayellam'}, {'date': u'September 8, 2017 - 3:51 pm', 'content': u"I assume there is some data tht you are posting to a channel that you want to reference somewhere else. \xa0If that is incorrect, can you provide more info on what is your final goal?Use a react or timeControl to trigger MATLAB analysis that writes data to a field. Use thingSpeakWrite() in your MATLAB analysis for example. \xa0Then when you read that field,\xa0If your data is numeric and you can display it in a plot, you can use the  to embed your plot in a page (raw html) \xa0and set the plot to dynamic with a refresh rate where you want it. See embed a plot. \xa0'update' is the time in seconds to refresh the plot.", 'num_user_post': u' 401', 'author': u'cstapels'}, {'date': u'September 9, 2017 - 3:00 am', 'content': u'Here is a link to my Public channel.https://thingspeak.com/channels/311730The problems are associated with the middle two iFrames that are both MATLAB visualizations and the data for these comes from channels that are updated once per minute. The problem is both these iFrames DO NOT dynamically update when new channel values are received as the rest of the thingspeak iframes do, instead i have to manually refresh the whole screen using F5 keyboard key to view the new data.So my question is how do i assign a dynamic update to MATLAB visualizations?Thanks againRay', 'num_user_post': u' 11', 'author': u'rayellam'}, {'date': u'September 14, 2017 - 3:28 pm', 'content': u'Ray,At present, it is not possible to have the visualizations update automatically in the same way thingSpeak plots update. \xa0This may be considered as a possible upgrade in the future. \xa0You may also consider using the plugins app. \xa0Another possibility to consider would be to embed the <iframe> for your visualization in a different page that has an automatic refresh built in, but the rate available to you may be limited.\xa0', 'num_user_post': u' 401', 'author': u'cstapels'}]}]}, {'url': u'https://community.thingspeak.com/forum/matlab/page-4/', 'threads': [{'url': u'https://community.thingspeak.com/forum/matlab/calculating-averages-per-weekday/', 'posts': [{'date': u'January 5, 2017 - 4:34 am', 'content': u'\xa0Hi,\xa0I am logging my energy usage to channel\xa0203631 (public).I would like to calculate the average (or median) energy usage per weekday (monday/tuesday/wednesday/....). \xa0I am clueless on how to do this. Can somebody help me?The channel contains 2 fields, no1 = the energy used per 30 seconds. The other the sum of energy used per 24 hours. I hope the timestamp from the channel it self can be used for date/time that is requierd.\xa0Feel free to use the data from the channel.\xa0Thanx in advance!\xa0Niels', 'num_user_post': u' 2', 'author': u'nielsb100'}, {'date': u'January 5, 2017 - 7:13 pm', 'content': u"Hi Niels,Please first run as is (hope it run in your machine \U0001f609See the output windows to check it is doing something useful ...Read the comments ( % ) then Change it however you want/needFinally post questionsHow are you reading watts? Can we know? Always good to know\xa0\xa0ver[ 'Time is=> UTC ' datestr(datetime('now','TimeZone','UTC')) ' - Lima ' datestr(datetime('now','TimeZone','America/Lima'))]%%diChanAiDi = 203631;%taim = 1; \xa0 \xa0% TimeStampscam1 = 2; \xa0 % Field1cam2 = 3; \xa0 % Field2% etc%% t1=datetime('now'); \xa0 \xa0% time at running time i.e. 'right now'yi=2017; \xa0 % year(t1); initial point in space-time -- as in Star Trek \U0001f609mi=1; \xa0 \xa0 \xa0% month(t1);di=5; \xa0 \xa0 \xa0 % day(t1);hi=16; \xa0 \xa0 % hour(t1);mmi=0; \xa0 % minute(t1);si=0; \xa0 \xa0 \xa0 % second(t1);yf=2017; \xa0%ending point in desired time lapsemf=1;df=5;hf=16;mmf=14; % minute(t1);sf=59; \xa0 \xa0 % second(t1);%tini=datetime([yi,mi,di,hi,mmi,si],'TimeZone','UTC')tini=datetime([yi,mi,di,hi,mmi,si]);tfin=datetime([yf,mf,df,hf,mmf,sf]);tkomo = 0;if tkomo==1 tini.TimeZone = 'UTC'; tfin.TimeZone = 'UTC';else tini.TimeZone = 'America/Lima'; \xa0 \xa0 % change as per your galaxy and sun color tfin.TimeZone = 'America/Lima';end%tini.TimeZone, tfin.TimeZone['from-> ' datestr(tini) ' ** to-> ' datestr(tfin)]%[datCH] = thingSpeakRead(diChanAiDi,'Fields',[1 2],'numpoints',100,'OutputFormat','table'); % last 100 points[datCH] = thingSpeakRead(diChanAiDi,'Fields',[1 2],'DateRange',[tini,tfin],'OutputFormat','table')t1 = datCH{:, taim}; \xa0 %x1 = datCH{:, cam1}; % datCH{start:end, field} nothing:nothing means ALL arrayx2 = datCH{:, cam2}; %['total kw-> ' num2str(sum(x1))]%second(t1)% prome=mean(x1);['median/avrg kw-> ' num2str(median(x1))]% prome=max(x1); % prome=min(x1);xdif = diff(datCH{:, taim}) % keyword diff finds 2nd-1st, 3rd-2nd, 4th-3rd, 5th-4th,.. so on to end of array['there are not regular 30 sec.']", 'num_user_post': u' 91', 'author': u'piajola'}, {'date': u'January 8, 2017 - 3:38 pm', 'content': u"Thanx piajola!I have been working on the code and have so far the following code.Now i want to calculate the averages per weekday. haven't figured out how to do this.\xa0----\xa0ver[ 'Time is=> UTC ' datestr(datetime('now','TimeZone','UTC')) ' - Lima ' datestr(datetime('now','TimeZone','America/Lima'))]%%diChanAiDi = 203631;%taim = 1;\xa0\xa0\xa0 % TimeStampscam1 = 2;\xa0\xa0 % Field1cam2 = 3;\xa0\xa0 % Field2% etc%% t1=datetime('now');\xa0\xa0\xa0 % time at running time i.e. 'right now'yi=2017;\xa0\xa0 % year(t1); initial point in space-time -- as in Star Trekmi=1;\xa0\xa0\xa0\xa0\xa0 % month(t1);di=5;\xa0\xa0\xa0\xa0\xa0\xa0 % day(t1);hi=0;\xa0\xa0\xa0\xa0 % hour(t1);mmi=0;\xa0\xa0 % minute(t1);si=0;\xa0\xa0\xa0\xa0\xa0\xa0 % second(t1);yf=2017;\xa0 %ending point in desired time lapsemf=1;df=5;hf=23;mmf=59;\xa0\xa0\xa0 % minute(t1);sf=59;\xa0\xa0\xa0\xa0 % second(t1);for j=1:8,\xa0\xa0\xa0 %day x to y\xa0\xa0 \xa0%stepsize to 7? for weekdays\xa0\xa0 \xa0%assign j to any of the yi - di variablesdi = j;df = j;%tini=datetime([yi,mi,di,hi,mmi,si],'TimeZone','UTC')tini=datetime([yi,mi,di,hi,mmi,si]);tfin=datetime([yf,mf,df,hf,mmf,sf]);tkomo = 0;if tkomo==1tini.TimeZone = 'UTC';tfin.TimeZone = 'UTC';elsetini.TimeZone = 'America/Lima';\xa0\xa0\xa0\xa0 % change as per your galaxy and sun colortfin.TimeZone = 'America/Lima';end%tini.TimeZone, tfin.TimeZone%[datCH] = thingSpeakRead(diChanAiDi,'Fields',[1 2],'numpoints',100,'OutputFormat','table'); % last 100 pointsdatCH = thingSpeakRead(diChanAiDi,'Fields',[1 2],'DateRange',[tini,tfin],'OutputFormat','table');t1 = datCH{:, taim};\xa0\xa0 %x1 = datCH{:, cam1};\xa0 % datCH{start:end, field} nothing:nothing means ALL arrayx2 = datCH{:, cam2};\xa0 %out =['total energy during ' num2str(yi) '-' num2str(mi) '-' num2str(di) ': ' num2str(max(x2)) 'Kwh'];disp(out)end%to figure out: group by weekday and post to anonther channel", 'num_user_post': u' 2', 'author': u'nielsb100'}, {'date': u'January 9, 2017 - 12:25 pm', 'content': u"I'm probably being simplistic, but timetables in MATLAB are probably what you need here. \xa0You can use the retime function to apply an operation on a daily basis:energyData = thingSpeakRead(203631, 'NumDays', 7, 'OutputFormat', 'timetable');retime(energyData,'daily',@median)\xa0You'll get:ans =5\xd72 timetable arrayTimestamps Kwatt TotalKwh ____________________ _____ ________05-Jan-2017 00:00:00 0.37 8.642 06-Jan-2017 00:00:00 0.36 5.373 07-Jan-2017 00:00:00 0.37 7.736 08-Jan-2017 00:00:00 0.24 5.787 09-Jan-2017 00:00:00 0.23 3.357", 'num_user_post': u' 47', 'author': u'Rob Purser'}, {'date': u'September 8, 2017 - 5:18 am', 'content': u'Neat Rob, just what im looking for as a starting point for my application (i think)\xa0ThanksRay', 'num_user_post': u' 11', 'author': u'rayellam'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/matlab-visualization-rainfall/', 'posts': [{'date': u'August 28, 2017 - 10:44 am', 'content': u'\xa0Hi,\xa0I am discovering matlab on the go. I have one problem. \xa0I get an incrementing value of rainfall in mm. I would like to get a bar graph for example per day. \xa0The substraction of two values i have figured out (at begin of the day and at the end) but how do i link it to a date and visualize it? Thanks in advance for any help.', 'num_user_post': u' 1', 'author': u'LEDsREPAIR'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/displaying-sum-for-the-day-and-specific-hours/', 'posts': [{'date': u'July 18, 2017 - 7:10 pm', 'content': u'Hello Guys,\xa0I am getting data from flow sensor and I want to calculate and display total liquid recorded for a day and for a specific hour. How can I do that using MATLAB Visualizations or Analysis?\xa0Thank you and I look forward to some great suggestions.Best RegardsRushan', 'num_user_post': u' 8', 'author': u'rushanarshad'}, {'date': u'July 20, 2017 - 3:48 pm', 'content': u"Rushan,There is an example of how to aggregate data in the documentation here. \xa0You can find more information on retime in the main MATLAB documentation. You can also use the mean function in MATLAB to create an average value. \xa0Read the data using MATLAB analysis into a variable using thingspeakRead()\xa0(you could use the 'NumPoints' or 'NumMinutes' to select a slice of your data.) \xa0Then you can use the between function to calculate the elapsed time between your first and last points. \xa0Multiple the average flow rate by the time to get the total liquid. \xa0Then use the thingSpeakWrite() to write the data to another channel, or another field of the same channel. \xa0And if you really want to get fancy, you can create a plugin to display the numbers you are looking for on your private view of the channel.Good luck!", 'num_user_post': u' 401', 'author': u'cstapels'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/error-using-thingspeakwrite-command-in-a-matlab/', 'posts': [{'date': u'May 5, 2017 - 10:02 am', 'content': u"I am very impressed what thingspeak cloud service do but now, I can't solve the problem with running matlab code that ask for waiting the 15 second although I put the delay(45) up and down the command. \xa0Please help me for the current project according to the attacted photo.Error displayMatlab command", 'num_user_post': u' 3', 'author': u'zkornz'}, {'date': u'May 6, 2017 - 1:22 pm', 'content': u'Please help me guys. T_T', 'num_user_post': u' 3', 'author': u'zkornz'}, {'date': u'May 6, 2017 - 2:49 pm', 'content': u'Thanks for the comment. I will try and find someone to help you as soon as possible. Thanks.\xa0', 'num_user_post': u' 402', 'author': u'Hans'}, {'date': u'May 8, 2017 - 7:57 am', 'content': u'Hi,\xa0A channel on thingSpeak can be updated at the fastest rate of once every 15 seconds (free account) or once every 1 second (paid account). This limit is enforced even if multiple independent sources/clients are writing to the same thingSpeak channel at different rates. With this is mind, could you confirm that the MATLAB code that you have shared above is the only source writing to channel\xa0242517?Note that the update rate limit is enforced even if you are writing to different fields at different rates. Consider the following example for the free account case: on channel 242517, if fields 1 and 2 are being updated once every 15 seconds from one client/MATLAB function and fields 3 and 4 are being updated once every 30 seconds by another client/MATLAB program, you might see an error because channel 242517 might get two updates in less than 15 seconds.\xa0Let us know if you are still seeing an error after ensuring that there is only one client/MATLAB program writing to your channel. \xa0\xa0- Adarsh', 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/calculate-total-time-channel-data-is-0/', 'posts': [{'date': u'January 22, 2017 - 12:59 pm', 'content': u"Hello,I have a thingSpeak project that requires some analysis.\xa0 However, Matlab is totally foreign to me.\xa0 I have been able to accomplish much of what I need but I'm stuck and would like some guidance.\xa0I have a channel that has 8 fields and the values within those fields are zeroes or ones.\xa0 I want to calculate for one specific day, and one specific field how much time the zeroes have been on.\xa0 I cannot create a variable that contains the data points for just those zeroes such that I can then calculate the difference between the timestamps and then sum them.\xa0 Here's what I thought would work but doesn't:\xa0[data2,timestamps,chInfo] = thingSpeakRead(YYYYYY,'ReadKey','XXXXXX','Fields',[1],'DateRange',[datetime('Jan 21, 2017'),datetime('Jan 22, 2017')],'OutputFormat','timetable');t=table2array(data2);for i =1:1:60\xa0\xa0\xa0 if(t(i,1) == 0)\xa0\xa0\xa0\xa0\xa0\xa0\xa0 zerodata=[t(i,1),1;];\xa0\xa0\xa0 endendt1=diff(t.Timestamps);t1a=cumsum(t1);t2=max(t1a);t2\xa0I believe the statement defining zerodata is wrong, but I cannot fix it.\xa0 Also, I am just trying 60 data points rather than all the data for that day.\xa0Please excuse any stupid errors since I am trying to use Matlab without getting deeply into it.\xa0Thank for any guidance you can give me.", 'num_user_post': u' 5', 'author': u'Doug'}, {'date': u'January 23, 2017 - 1:14 pm', 'content': u"I think you're looking for a feature in MATLAB called logical indexing.All you need is the timetable that is in the variable data2 in your example. \xa0Assuming it looks something like this:data2 =\xa0 \xa0 \xa0 \xa0time \xa0 \xa0 \xa0 \xa0 \xa0field1 field2 field3____________________ ______ ______ ______23-Jan-2017 06:57:28 1 \xa0 \xa0 \xa0 0 \xa0 \xa0 \xa0123-Jan-2017 07:57:28 0\xa0 \xa0 \xa0\xa0 0 \xa0 \xa0 \xa0123-Jan-2017 08:57:28 0\xa0 \xa0 \xa0 \xa01 \xa0 \xa0 \xa0123-Jan-2017 09:57:28 0\xa0 \xa0 \xa0 \xa01 \xa0 \xa0 \xa0123-Jan-2017 10:57:28 1 \xa0 \xa0 \xa0 1 \xa0 \xa0 \xa0023-Jan-2017 11:57:28 0 \xa0 \xa0 \xa0 0 \xa0 \xa0 \xa0023-Jan-2017 12:57:28 0 \xa0 \xa0 \xa0 0 \xa0 \xa0 \xa01You can take the diff of the timestamps to get the duration between the timestamps, like you didtimeon = diff(data2.time);Since diff returns one fewer rows than it's given, you'll need to decide what to do with the last row. \xa0If you just ignore it (which is simple), you'll need to 'tack on' a duration of 0:timeon = [timeon;hours(0)]A more sophisticated solution would be to tack on the elapsed time since the last row was written.OK, now you can use the logical indexing. \xa0With it, you only select the rows that meet your condition (in this case, where field1 == 0)timeon(data2.field1 == 0)ans = 5\xd71 duration array   01:00:00   01:00:00   01:00:00   01:00:00   00:00:00Really, you want the sum though:sum(timeon(data2.field1 == 0))ans = duration   04:00:00Repeat for the other fields:sum(timeon(data2.field2 == 0))sum(timeon(data2.field3 == 0))Hope this helps,-Rob", 'num_user_post': u' 47', 'author': u'Rob Purser'}, {'date': u'January 23, 2017 - 3:35 pm', 'content': u"Rob Purser said timeon = diff(data2.time);OK, now you can use the logical indexing. \xa0With it, you only select the rows that meet your condition (in this case, where field1 == 0)timeon(data2.field1 == 0)Rob,Thanks a lot for your help. One thing I don't understand: Doesn't the second equation listed above from your post go back to the original data (ie data2) rather than use the difference data of equation one? Will I not get from timeon(data2.field1 ==0) \xa0the original data from data2 that has 0 in field 1 but not the difference in the timestamps? \xa0 So shouldn't I do it this way then:timeon(data2.field1 == 0)thentimeondiff = diff(timeon.time)BTW, \xa0when I run your code, I get message: Unrecognized variable name 'time'.Of course my code doesn't run either!What now?\xa0Thanks again for your help.", 'num_user_post': u' 5', 'author': u'Doug'}, {'date': u'January 24, 2017 - 6:24 am', 'content': u"Hi,The timeon array contains the duration of time elapsed between each reading -- both the times that the condition was met, and the times when it wasn't.This line does two things:timeon(data2.field1 == 0)1. It compare the contents of field1 in the data2 timetable with the value of 0. \xa0This produces a logical array of trues and falses identifying all the rows that met the condition (in this case, has a value of zero).2. It then uses that logical array to select from the timeon array the only the periods of time when the condition was met. \xa0Now, you have an array of all the durations when the field1 value was 0. \xa0You can just sum them.-Rob", 'num_user_post': u' 47', 'author': u'Rob Purser'}, {'date': u'January 24, 2017 - 4:01 pm', 'content': u"I got it! Thanks! \xa0I'm now able to get an email each day saying how long my boiler was on for the previous day. \xa0This way I can monitor it if I'm away. \xa0Cool!\xa0Thanks again\xa0Doug", 'num_user_post': u' 5', 'author': u'Doug'}, {'date': u'January 29, 2017 - 11:31 am', 'content': u"Well, I guess it is not quite perfect. \xa0At times, I get the following message:Count = 966Index exceeds matrix dimensions.I then run it again later and all is well:\xa0Count=1023etc\xa0Here's my code. \xa0I have removed comment lines but left in lines that are never used in the code that could be removed but haven't been. \xa0Field1 is Boiler (with values of 0 or 1) and Field8 is dataNo (an index that counts the number of data points created by the Arduino but not necessarily transmitted for whatever reason).\xa0readChannelID = xxxx;BoilerFieldID = 1;readAPIKey = 'xxxxxxx';writeChannelID = xxx;writeAPIKey = 'xxxxx';[data2,timestamps,chInfo] = thingSpeakRead(xxx,'ReadKey','xxxxxx','Fields',[1,8],'NumMinutes',1440,'OutputFormat','timetable');t=table2array(data2);Count=max(data2.dataNo)timeon = diff(data2.Timestamps)Sum = sum(timeon(data2.Boiler == 0))formatOut = 13; % sets output to HH:MM:SS see datestr descriptionTotalBoilerOn = datestr(Sum,formatOut) %convert to stringthingSpeakWrite(writeChannelID, {TotalBoilerOn, Count}, 'writekey', writeAPIKey); %{} needed to write nonnumeric data\xa0I test it by running it every hour -everything is fine, then set it to every day and it sometimes gives that error.....Index exceeds matrix dimensions.\xa0Can anyone explain?? \xa0Thanks for your help.", 'num_user_post': u' 5', 'author': u'Doug'}, {'date': u'January 30, 2017 - 3:05 pm', 'content': u"I can't see anything obvious by inspection. \xa0Can you add a few calls to disp() to try and figure out what line is failing? \xa0", 'num_user_post': u' 47', 'author': u'Rob Purser'}, {'date': u'January 30, 2017 - 4:02 pm', 'content': u"Rob Purser said I can't see anything obvious by inspection. \xa0Can you add a few calls to disp() to try and figure out what line is failing? \xa0\xa0\xa0\xa0I don't have a lot of experience with it, but I was thinking that since it printed 'count' and a number and then said 'Index exceeds matrix dimensions' that the problem would be with the next statement that should have printed a result - that being the statement 'timeon = diff(data2.Timestamps)'. \xa0Would disp() tell me anything different? \xa0I suspect index means in this context the position within the matrix that is being referred to and then that position is larger than the matrix dimension. \xa0But I don't see anywhere that I'm doing that!Thanks for your help.", 'num_user_post': u' 5', 'author': u'Doug'}, {'date': u'January 31, 2017 - 6:29 am', 'content': u"Hi Doug,You're absolutely right. \xa0I tried a few experiments to figure out what would cause the diff function to give that error, and didn't see anything obvious. \xa0 Can you send me an email at rob.purser at mathworks.com, and we can try to figure it out another way?Thanks,-Rob", 'num_user_post': u' 47', 'author': u'Rob Purser'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/error-unrecognized-variable-name-x-by-non-ascii-field-name/', 'posts': [{'date': u'December 15, 2016 - 11:27 pm', 'content': u"In my channel, there are several fields that their names was written with Unicode character -- '온도', '습도', '기압', ...(FYI, 온도 is temperature, 습도 is humidity, and 기압 is air pressure)\xa0It looks like thingSpeakRead function doesn't work well with non-ASCII characters.The function reads '온도' field, but it throws Unrecognized variable name 'x' Error when it reads '습도' field.However '습도' field is read since I renamed the field to humidity.", 'num_user_post': u' 2', 'author': u'ykim'}, {'date': u'December 22, 2016 - 3:18 pm', 'content': u'Thanks for sharing the issue. Could you share your channel ID as well to help us reproduce the error?\xa0', 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}, {'date': u'December 26, 2016 - 1:29 am', 'content': u'I created new public channel and public MATLAB visualization to reproduce the error.Please check following links:https://thingspeak.com/channels/206990https://thingspeak.com/apps/matlab_visualizations/116059', 'num_user_post': u' 2', 'author': u'ykim'}, {'date': u'December 29, 2016 - 1:52 pm', 'content': u"Thanks for creating and sharing the new public channel. I am able to reproduce the\xa0behavior:\xa0thingSpeakRead(206990, 'outputFormat', 'table')\xa0ans =1\xd72 timetable arrayTimestamps \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 x \xa0 \xa0 \xa0 \xa0x_1 ____________________ ______ ______26-Dec-2016 01:20:11 \xa0 \xa017.271 \xa045.443\xa0As you mentioned, non-Ascii characters are not supported for column names by the existing functionality.\xa0We will consider adding this to a future release of thingSpeakRead. Thanks again for sharing your use case.", 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/report-generation-toolbox/', 'posts': [{'date': u'December 28, 2016 - 11:15 am', 'content': u"Has anyone tried to use the report generation toolbox in one of their scripts? I have the license for it, but it won't load in the cloud version on Thingspeak.", 'num_user_post': u' 1', 'author': u'SoupiestZebra'}, {'date': u'December 28, 2016 - 12:21 pm', 'content': u'Hi SoupiestZebra,\xa0Currently these are the MATLAB Toolboxes that are supported by ThingSpeak:\xa0https://www.mathworks.com/help/thingspeak/matlab-toolbox-access.htmlWe plan to add more toolboxes in the future.\xa0ThanksAkhila\xa0', 'num_user_post': u' 21', 'author': u'akhila'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/convert-counter-values-to-rate/', 'posts': [{'date': u'November 3, 2016 - 12:33 am', 'content': u"I've got the following code that de-cumulates counter values into a rate display using the matlab diff function (fired by a React every time data is inserted into the channel).\xa0 It works but seems like a kludge. Is there a neater way to do the same thing? I couldnt quite see how to do a multi-dimensional diff()\xa0%read last 2 pointsdata = thingSpeakRead(readChannelID,'OutputFormat','Table','Numpoint',2, 'ReadKey', readAPIKey)%get the latest pointd=data(2,:)ts=d.Timestamps;% difference each parameterxdiff = diff(data.xcount)if xdiff<0\xa0\xa0\xa0 xdiff=d.xcount;end\xa0\xa0 \xa0ydiff = diff(data.ycount)if ydiff<0\xa0\xa0\xa0 ydiff=d.ycount;endzdiff = diff(data.zcount)if zdiff<0\xa0\xa0\xa0 zdiff=d.zcount;end%update new channel with the results.thingSpeakWrite(writeChannelID,[xdiff,ydiff,zdiff],'WriteKey', writeAPIKey,'TimeStamp',ts);", 'num_user_post': u' 271', 'author': u'rw950431'}, {'date': u'November 4, 2016 - 8:24 am', 'content': u"Hi,\xa0Could you share the 'data' table? Without looking at the data, my suggestion would be to\xa0extract the numeric data from the 'data' variable and then call diff() on the array. For example:\xa0data = thingSpeakRead(readChannelID,'OutputFormat','Table','Numpoint',2, 'ReadKey', readAPIKey);dataArr = data{:, 2:end};diffArr = diff(dataArr);\xa0diff() function supports 2D arrays. However, it doesn't support tables. The 'Differences Between Matrix Rows' example on this page should be relevant to this case:https://www.mathworks.com/help/matlab/ref/diff.htmlIn this case, 'diffArr' variable should be 1xn row vector with the differences. Even with this, since you are looking to replace each variable in diffArr with a different value (if negative), the simple way is to use the if construct to check if it is negative and then replace the value.\xa0HTH! \xa0", 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}, {'date': u'November 4, 2016 - 8:13 pm', 'content': u"Thanks Adarsh..\xa0\xa0 If I understand correctly there is no easier way to do the 'if negative replace with value from another array' step.Would it be easier if I used the '[data,timestamps]=thingSpeakRead(..)' form for the original extraction rather than a table? I'm a total newbie at Matlab and only used Table because I'm familiar with it.", 'num_user_post': u' 271', 'author': u'rw950431'}, {'date': u'November 8, 2016 - 10:23 am', 'content': u"You could use arrays as you suggested (this would remove the additional line to extract data from the table):data = thingSpeakRead(readChannelID,'Numpoint',2, 'ReadKey', readAPIKey);diffArr = diff(data);\xa0Regarding conditional replacement of values in an array, my suggestion would be to use if construct to keep the code readable. There are other techniques that you could consider, such as:diffArr(1) = (diffArr(1) < 0)*d.xcount + (diffArr(1) > 0)*diffArr(1);diffArr(2) = (diffArr(2) < 0)*d.ycount + (diffArr(2) > 0)*diffArr(2);diffArr(3) = (diffArr(3) < 0)*d.zcount + (diffArr(3) > 0)*diffArr(3);\xa0where each element of the diffArr is assigned a value depending on whether it is negative. For example, in the code snippet above, if the first element of diffArr is negative then it is replaced by d.xcount else it is replaced by its present value.If you were replacing all negative elements in an array with the same value (instead of different values: d.xcount, d.ycount, d.zcount), there are other techniques that you could\xa0consider as well.\xa0", 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}, {'date': u'December 23, 2016 - 1:53 pm', 'content': u"3 days to search .... but no result!\xa0Every minutes i've a counter value in a chanel.How can i find a value (juste one !) one (year, day or hour) before ?% For 'now' it's okData1 = thingSpeakRead(202xxx,'Fields', 4, 'ReadKey','1F16B5PPNYxxxxxx');% don't working for\xa0(year, day or hour) before[Data2, time] = thingSpeakRead(202xxx,'Fields', 4, 'DateRange', [start, stop],'ReadKey','1F16B5PPNYxxxxxx');Thank to you for helpNicolas", 'num_user_post': u' 5', 'author': u'nmac'}, {'date': u'December 25, 2016 - 2:31 am', 'content': u"From the documentation:Retrieve the data for August 8, 2014 through August 12, 2014 for fields 1 and 4 of a public channel, including the timestamp, and channel information.[data,time,channelInfo] = thingSpeakRead(12397,'Fields',[1 4],'DateRange',[datetime('Aug 8, 2014'),datetime('Aug 12, 2014')]);Did this not work for you?  Perhaps you are not formatting start and stop correctly- might be helpful if you submit more of your code showing how the start and stop times are derived.  ", 'num_user_post': u' 271', 'author': u'rw950431'}, {'date': u'December 25, 2016 - 8:11 am', 'content': u"I've see this documentation but it's not that i want,\xa0In that case, you have a specific date.In my case I want to differentiate between a value from today and a value from (day or month before).For that i've value of 'now' --> It's easy and oka = thingSpeakRead(202xxx,'Fields', 4, 'ReadKey','1F16B5PPNxxxxxxx');a =\xa013376742But i can't retrieve the data from there is a me from nowI try lots of things but nothing works; Each time it is to have full valueDate', datetime('start') ???'DateRange', [t1,t2] ???", 'num_user_post': u' 5', 'author': u'nmac'}, {'date': u'December 25, 2016 - 10:25 am', 'content': u'Correction about my translation:--> But I can not retrieve a data from a month ago from now', 'num_user_post': u' 5', 'author': u'nmac'}, {'date': u'December 25, 2016 - 11:47 pm', 'content': u"Have you tried the datetime(year.month,day,hour,minute,second) format (see https://au.mathworks.com/help/matlab/ref/datetime.html)This works for me using the public channel..% Enter your MATLAB Code below[data] = thingSpeakRead(12397,'Fields',[1 4],'DateRange',[datetime(2014,8,8,0,0,0),datetime(2014,8,8,1,0,0)],'OutputFormat','table')data =   Timestamps  WindDirectionNorth0Degrees TemperatureF ____________________ __________________________ ____________ 08-Aug-2014 00:00:22 0 78.6  08-Aug-2014 00:01:22 270 78.6  08-Aug-2014 00:02:22 270 78.6  08-Aug-2014 00:03:22 225 78.6  08-Aug-2014 00:04:22 135 78.6  08-Aug-2014 00:05:22 315 78.7  08-Aug-2014 00:06:22 45 78.7 ", 'num_user_post': u' 271', 'author': u'rw950431'}, {'date': u'December 27, 2016 - 10:37 am', 'content': u"Thank you for help.I've find that i want :%\xa0Time (month, day, hour ....) Here counter value in one hourt1 = datetime('now') - hours(1);t2 = datetime('now');[b,time,channelInfo] = thingSpeakRead(202xxx,'Fields',[4],'DateRange',[datetime(t1),datetime(t2)], 'ReadKey','1F16B5PPxxxxxxx');%\xa0Take first & end valuea = b (1);c = b (end);% Diff\xe9rence between end 1 first valued = c-a;Have a good year 2017 !", 'num_user_post': u' 5', 'author': u'nmac'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/thingspeakread-table-to-uitable/', 'posts': [{'date': u'November 11, 2016 - 8:34 am', 'content': u"Hey guys!I am facing a problem inserting a table with my data from thingspeak to a matlab uitable in guide.\xa0When I press a button, i run the following code to put the data into the uitable (created with guide before):data = thingSpeakRead(<ChannelID>, 'DateRange',[datetime('Oct 27, 2016'),datetime('Nov 4, 2016')],'OutputFormat','table')set(handles.uitable1,'Data',data);\xa0and this is the result in the command window:data =Timestamps \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0Fahrer \xa0 \xa0 \xa0 Kilometerstand \xa0 \xa0 \xa0Fahrtgrund ____________________ _________ ______________ ________________27-Oct-2016 18:15:25 \xa0 \xa0 \xa0 \xa0 \xa0 0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 'Initialisieren' 27-Oct-2016 18:17:01 \xa0 \xa0 \xa0217314240 \xa0 \xa0 \xa0 \xa0 \xa00 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 'Dienstfahrt' 27-Oct-2016 18:17:34 \xa0 \xa0 \xa0 \xa0 \xa0 0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa013 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0'Fahrtende' 27-Oct-2016 18:18:05 \xa0 \xa0 \xa0741914369 \xa0 \xa0 \xa0 \xa0 13 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 'Analyse' 27-Oct-2016 18:18:36 \xa0 \xa0 \xa0 \xa0 \xa0 0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa020 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0'Fahrtende'Error using matlab.ui.control.Table/setWhile setting the 'Data' property of Table:Data must be a numeric, logical, or cell arrayError in Test_Download>pushbutton1_Callback (line 82)set(handles.uitable1,'Data',data);Error in gui_mainfcn (line 95) feval(varargin{:});Error in Test_Download (line 42) gui_mainfcn(gui_State, varargin{:});Error in @(hObject,eventdata)Test_Download('pushbutton1_Callback',hObject,eventdata,guidata(hObject))Error while evaluating UIControl CallbackWhen i don't use the 'OutputFormat','table'-Option in ThingSpeakRead it works, but then the timestamp and the last coloumn with the strings are missing. Which is bad, because they are necessary for my application.I don't know how to access the datatypes properly to get everything running. Can anybody help me with this?\xa0Thanks a lot!\xa0", 'num_user_post': u' 3', 'author': u'wasted'}, {'date': u'November 15, 2016 - 8:08 am', 'content': u"Hi,\xa0UITABLE\xa0is currently supported only on MATLAB Desktop and MATLAB Online. It is not supported on ThingSpeak.An error is generated by\xa0your code because UITABLE at present does not support TABLE\xa0and DATETIME\xa0types in MATLAB. Therefore, when you read data from ThingSpeak with outputFormat set to Table, the returned table isn't supported by UITABLE. To work around this, here is some example code:\xa0% Read data from a channel as a tabledata = thingSpeakRead(1417, 'DateRange',[datetime('Oct 27, 2016'),datetime('Oct 28, 2016')], 'outputFormat', 'table');% Create an empty\xa0UITABLEt = uitable;% Convert the timestamps in the table to string format (from datetime type)data.Timestamps = datestr(data.Timestamps);% Convert the table to a MATLAB Cell arraycellData = table2cell(data);% Assign the data to UITABLEt.Data = cellData;Let us know if this doesn't resolve the issue.\xa0Thanks!", 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}, {'date': u'November 17, 2016 - 6:49 am', 'content': u"Hello Adarsh_Murthy,thank you for your reply. I did the same thing with my table and formated all vectors to cell array data.Here is some example code for others facing the same problem:%%%%%%%%%%%%%%data=thingSpeakRead(channelID, 'DateRange',[datetime(startdatevar),datetime(enddatevar)],'OutputFormat','table')%T1 was datetime-variableT1=data{:,1:1};T1=datestr(T1);T1=cellstr(T1);%T2 is Num-variableT2=data{:,2:2};T2=num2str(T2);T2=cellstr(T2);%T3 is num-variableT3=data{:,3:3};T3=num2str(T3);T3=cellstr(T3);%T4 is cell-variableT4=data{:,4:4};%%%%%%%%%%Thanks again for your help!", 'num_user_post': u' 3', 'author': u'wasted'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/systemic-expected-shortfall-in-matlab/', 'posts': [{'date': u'October 30, 2016 - 3:09 pm', 'content': u"Hi, everyone,I'm a newbie in Matlab seeking to develop my programming skills. I have the following code to compute Systemic Expected Shortfall (SES), as in the paper of Acharya et al. (2010). So, the SES is based on Marginal Expected Shortfall. This code is just for one company, but I have n companies (banks, more precisely) in my sample, everyone having its mes_training_sample, lvg_training_sample, ses_training_sample, mes and lvg. I need a for loop for computing ses for all companies at once, but it's hard at this stage to figure it out. Any info will be useful.Thanks in advance.num_firms = length(mes_training_sample);% RegressorsX = [ones(num_firms,1) mes_training_sample lvg_training_sample];% Regress systemic expected shortfall on marginal expected shortfall and% leveragebetas = regress(ses_training_sample, X);b = betas(2);c = betas(3);ses = (b*mes_firm + c*lvg_firm)/(b+c);", 'num_user_post': u' 1', 'author': u'Niqx'}, {'date': u'October 30, 2016 - 3:45 pm', 'content': u"I'm not sure how your question relates\xa0to ThingSpeak.Since your question is about MATLAB programming, I would encourage you to post your question to the MATLAB\xa0Community:\xa0https://www.mathworks.com/matlabcentral/answers/You may also want to look up the MATLAB syntax for loops: https://www.mathworks.com/help/matlab/matlab_prog/loop-control-statements.html", 'num_user_post': u' 225', 'author': u'Vinod'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/documentation-for-beginner-about-matlab/', 'posts': [{'date': u'August 24, 2016 - 3:47 am', 'content': u"Dear All,It seems that I like ThingSpeak service very much but as usually I want to get a little bit more than the standart functionality can offer. For example I colled data from a Gas Meter and do that with real digits. That means that every single update increases number. And always I can see my Gas meter actual values. But I also would like to get momentum values of consumtion with slices 15 or 60 minutes.\xa0In that case I need to get data from my channel and substract every value precedessor from the current value. Then, as I guess, I need to put these substracted values to a new channel (or field) and build a graph that will show me real consumption for every time period.But the problem is that I don't understand the principles how MatLab (Analyst mostly). And can't route my work into the right direction. Where can I read something on order to understand the language principles, sintaxsys and other core things of the used languages?", 'num_user_post': u' 28', 'author': u'kvv213'}, {'date': u'August 25, 2016 - 5:25 pm', 'content': u'Hi,I am not sure if I understand 100% about what you want to achieve, nevertheless I will try to provide my suggestions.Create/Open a\xa0MATLAB Analysis app.Use the thingSpeakRead function in the MATLAB Analysis to read data from your channel that contains the\xa0Gas meter actual values.Use the diff function in MATLAB to substract every value precedessor from the current value. (there are also other similar arithmetic MATLAB functions that you can find in this page)Use the thingSpeakWrite function to write the values back into a new a channel.\xa0There are many built-in MATLAB functions for using basic descriptive statistics. Also, since now ThingSpeak supports MATLAB Toolboxes, you can use advanced MATLAB functions that belong to these toolboxes - some examples of using functions from these toolboxes in ThingSpeak can be found here.If you are looking to learn MATLAB from the basics, you can visit the MATLAB Getting Started page which has links to nice tutorials of how to get started using MATLAB. Also, you have the MATLAB Central where you can ask MATLAB users\xa0and get responses for any MATLAB related questions that you may have. And you can visit the MATLAB File Exchange\xa0to find MATLAB code that other MATLAB users have posted that may help you.\xa0', 'num_user_post': u' 12', 'author': u'jvasudev'}, {'date': u'August 26, 2016 - 4:48 am', 'content': u'jvasudev said  If you are looking to learn MATLAB from the basics, you can visit the MATLAB Getting Started page which has links to nice tutorials of how to get started using MATLAB. Also, you have the MATLAB Central where you can ask MATLAB users\xa0and get responses for any MATLAB related questions that you may have. And you can visit the MATLAB File Exchange\xa0to find MATLAB code that other MATLAB users have posted that may help you.\xa0\xa0\xa0thank you very much, will try to use these suggestions!', 'num_user_post': u' 28', 'author': u'kvv213'}, {'date': u'October 7, 2016 - 4:18 am', 'content': u"jvasudev said  Hi,I am not sure if I understand 100% about what you want to achieve, nevertheless I will try to provide my suggestions.\xa0\xa0Hello\xa0jvasudev,I've manage to realize two new grpahs using ThingSpeak MATLAB Analysis apps. The first app reads twice values from one field and calculates difference between two values in hour time. The pbolem here that not every record in the original field contains data. I update the original channel with 8 fields but not all of them have values at the time of update. So here I get hourly consumption of my gas. And I write it to a new channel.The second app does a little bit different work. It calculates momentum consumption. It uses diff function (I hope that this is a function) and the result is written to a new field. If there are some NaN values that is OK. As I understand from the description they are processed correctly by diff function.So, now I have two new fields with consumption values (hourly and momentum). But I'd like to generate bars graph not ordinary grpah. Is it possible with ThingSpeak somehow?Update: I think that I'll be able to do so with MATLAB Visualization app \U0001f642\xa0PS. Here are two usefull links for MATLAB and ThingSpeak online reference manuals:http://www.mathworks.com/help/matlab/functionlist.htmlhttp://www.mathworks.com/help/thingspeak/functionlist.htmlThey helped me very much.", 'num_user_post': u' 28', 'author': u'kvv213'}, {'date': u'October 7, 2016 - 6:31 pm', 'content': u"You are right. You can use MATLAB Visualization app.checkout 'bar'\xa0function from MATLAB: https://www.mathworks.com/help/matlab/ref/bar.htmlIn the following article, refer 'Looking at Weekly Sums for Eastbound and Westbound Traffic and Plotting' section to learn more about plotting bar graphs:\xa0http://makerzone.mathworks.com/blog/counting-cars-and-analyzing-traffic-raspberry-pi-thingspeak/Hope this helps. Feel free to share your final Visualization.\xa0", 'num_user_post': u' 8', 'author': u'Meenakshi'}, {'date': u'October 11, 2016 - 11:38 am', 'content': u"Meenakshi said  You are right. You can use MATLAB Visualization app.checkout 'bar'\xa0function from MATLAB: https://www.mathworks.com/help/matlab/ref/bar.htmlIn the following article, refer 'Looking at Weekly Sums for Eastbound and Westbound Traffic and Plotting' section to learn more about plotting bar graphs:\xa0http://makerzone.mathworks.com/blog/counting-cars-and-analyzing-traffic-raspberry-pi-thingspeak/Hope this helps. Feel free to share your final Visualization.\xa0\xa0\xa0Thank you for the good example. I'm already managed to use bar grpah and get something like this:\xa0\xa0I use the following code:figure bar(timeStamp, GasImpNow); xlabel('Время'); ylabel('Потребление, кб. м.'); title('Потребление газа за последние 24 часа'); ax=gca; %set(gca,'XTickLabel', timeStamp); grid onBut the graph doesn't look pretty. The bars are too thin and the date labels are not very informative. But I can't impruve it easily. If I use XTickLabel I need to convert timeStamp into Strings and I receive just empthy graph. I also tried to collapse timeStamp into only hours because I use 24 hours graph frame but with no success.\xa0The hard way is to process all the data into a much simplified data. Where I collect all the data into hour frames or something like this.\xa0", 'num_user_post': u' 28', 'author': u'kvv213'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/how-to-get-unique-timestamps/', 'posts': [{'date': u'October 3, 2016 - 1:57 am', 'content': u"I have the matlab code below but it sometimes fails because of duplicated time-stamps in the data. (this causes 'bar' to fail with 'XData must be unique' error).Wondering how to get a unique set of timestamps then rejoin them to the values (I dont particularly care which of the duplicated values gets matched).\xa0 My newbie attempts to use the 'unique' function do not work because the row as a whole is considered unique even when the timestamps are the same.\xa002/10/2016 01:30-436.4302/10/2016 01:30-390.6102/10/2016 01:35-390.6802/10/2016 01:35-390.6% Draw a bar graph of Interconnector power% red for positive, blue for negativepower = thingSpeakRead(150393,'OutputFormat','Table','NumDays',3);pos=unique(power(power.Interconnect > 0,[1,4]));neg=unique(power(power.Interconnect <= 0,[1,4]))figure('position', [0, 0, 1200, 700])bar(datenum(neg.Timestamps),neg.Interconnect,'r','BarWidth',1,'EdgeColor','r')hold onbar(datenum(pos.Timestamps),pos.Interconnect,'b','BarWidth',1,'EdgeColor','b')hold offdatetick('x','ddd dd/mm')title 'South Australian Interconnector Load'ylabel 'Net Power (MW)'legend('Buying Power','Selling Power','Location','northwest')axis 'tight'", 'num_user_post': u' 271', 'author': u'rw950431'}, {'date': u'October 4, 2016 - 12:32 pm', 'content': u"Since you are looking to find rows with unique timestamps, call unique() only on Timestamps column.\xa0I added a couple lines of code to your snippet and it should work now.power = thingSpeakRead(150393,'OutputFormat','Table','NumDays',3);[~, uniqueIndx] = unique(power.Timestamps);power = power(uniqueIndx, :);pos= power(power.Interconnect > 0,[1,4]);neg= power(power.Interconnect <= 0,[1,4]);<insert\xa0the remaining lines of code>Take a look at the link below for further info about unique() function:https://www.mathworks.com/help/matlab/ref/unique.html\xa0I am curious about the cause for duplicate timestamps. How are you adding data to channel 150393 - from a device, or MATLAB Script tied to a TimeControl/React or another method? \xa0", 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}, {'date': u'October 4, 2016 - 8:44 pm', 'content': u"Thanks Adarsh, that worked perfectly.The repeated timestamp appears to be an artefact of the start of daylight savings time. The values are coming from a script that scrapes data off a website : the data includes a timestamp so I use 'created_at' to set this time in the thingspeak record.", 'num_user_post': u' 271', 'author': u'rw950431'}]}]}, {'url': u'https://community.thingspeak.com/forum/matlab/page-5/', 'threads': [{'url': u'https://community.thingspeak.com/forum/matlab/undefined-operator-for-input-arguments-of-type-cell/', 'posts': [{'date': u'October 4, 2016 - 1:53 am', 'content': u"I have the following code in a matlab visualisation which used to work fine. However in the last few days the data source has had problems and now my matlab code complains 'Undefined operator '>' for input arguments of type 'cell'.'\xa0readChannelID = [150393];%% Read Data %%% Read first data variablepower = thingSpeakRead(readChannelID, 'OutputFormat','table' , 'NumDays', 3)%% Visualize Data %%dates=datenum(power.Timestamps);price=power.Priceprice(price>2000)=2000\xa0 '-4e-05'\xa0\xa0\xa0 '0.00014'\xa0\xa0\xa0 '0.00014'\xa0\xa0\xa0 '0.00014'\xa0\xa0\xa0 '0.00014'\xa0\xa0\xa0 '0.00014'\xa0\xa0\xa0 '-3e-05'\xa0\xa0\xa0 '6e-05'\xa0Undefined operator '>' for input arguments of type cell.\xa0I'm guessing it doesnt like the '-4e-05' type of entry.\xa0 If I reduce the time period to exclude these values it runs OK.What can I do to clean my data so this works properly?", 'num_user_post': u' 271', 'author': u'rw950431'}, {'date': u'October 4, 2016 - 1:02 pm', 'content': u"You are right, it looks like data represented in exponential format is leading the column\xa0to be represented as a string. Couple options to resolve the error:\xa01. Manually convert the data in Price column to double datatype. Here is some example code:\xa0readChannelID = [150393];%% Read Data %%% Read first data variablepower = thingSpeakRead(readChannelID, 'OutputFormat','table' , 'NumDays', 3)%% Visualize Data %%dates=datenum(power.Timestamps);price = cellfun(@str2num, power.Price);price(price>2000)=2000\xa0\xa0The cellfun() function call is used to apply the str2num() function to all elements of the Price column. You can find more information about cellfun\xa0and str2num\xa0functions at the following link:https://www.mathworks.com/help/matlab/ref/cellfun.htmlhttps://www.mathworks.com/help/matlab/ref/str2num.html\xa02. Update your source to send data to ThingSpeak in a non-exponential format.\xa0We will look into options to update the thingSpeakRead function to handle exponential data representation.\xa0Thanks!\xa0", 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}, {'date': u'October 4, 2016 - 8:28 pm', 'content': u'Thanks Adarsh, cellfun() works perfectly.', 'num_user_post': u' 271', 'author': u'rw950431'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/timecontrolreact-app-with-matlab-analysis-code-errors/', 'posts': [{'date': u'September 22, 2016 - 4:33 pm', 'content': u'When you have MATLAB Analysis code that uses a TimeControl, the TimeControl stops running if there are a number of consecutive errors in the MATLAB Analysis code. You can choose to receive an alert via email by checking the box Notify me via email if this MATLAB Analysis fails when triggered by TimeControl or React in the MATLAB Analysis app.\xa0To restart the TimeControl, fix the error in the associated MATLAB Analysis App and press the Save and Run button.\xa0', 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}, {'date': u'September 23, 2016 - 4:22 pm', 'content': u"Hi Adarsh,From my Analysis and TimeControls (1 hour frequency). I have 'troubles' with two of themFirst Analysis ends with Webwrite to Pushingbox server that sometimes reply 502 error and I have a red line in the corresponding Analysis and TimeControlSecond Analysis ends with a try-catch as this:\xa0 \xa0 \xa0 try\xa0 \xa0 \xa0 \xa0 \xa0webwite(text for 1st try+Timestamp)\xa0 \xa0 \xa0 catch\xa0 \xa0 \xa0 \xa0 \xa0webwite(text for 2nd try+Timestamp)until now 1.4 % error 4 red lines in 2 weeks (and 40 catch 263 OK)* * No one ThingSpeak error email in any case * *Example of todayFirst column from first Analysis fired by a TimeControlSecond column from another Analysis fired by another TimeControl??? is some text plus the timestamp from Thingspeak server??? >> 20160923T150013 \xa0 \xa0 \xa0 \xa0 \xa0 ???--20160923T150406??? >> 20160923T140011 \xa0 \xa0 \xa0 \xa0 \xa0 ???--20160923T140405??? >> 20160923T130015 \xa0 \xa0 \xa0 \xa0 \xa0 ???--20160923T130407??? >> 20160923T120014 \xa0 \xa0 \xa0 \xa0 \xa0 ???--20160923T120408??? >> 20160923T110014 \xa0 \xa0 \xa0 \xa0 \xa0 ???--20160923T110409??? >> 20160923T100016 \xa0 \xa0 \xa0 \xa0 \xa0 ???--20160923T100407??? >> 20160923T090013 \xa0 \xa0 \xa0 \xa0 \xa0 ???--20160923T090407??? >> 20160923T080014 \xa0 \xa0 \xa0 \xa0 \xa0 ???--20160923T080407??? >> 20160923T070014 \xa0 \xa0 \xa0 \xa0 \xa0 ???--20160923T070408??? >> 20160923T060013 \xa0 \xa0 \xa0 \xa0 \xa0 ???--20160923T060406??? >> 20160923T050017\xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0RED line - No email??? >> 20160923T040013 \xa0 \xa0 \xa0 \xa0 \xa0 ???--20160923T040407??? >> 20160923T030011 \xa0 \xa0 \xa0 \xa0 \xa0 ???--20160923T030406??? >> 20160923T020014 \xa0 \xa0 \xa0 \xa0 \xa0 ???--20160923T020407??? >> 20160923T010015 \xa0 \xa0 \xa0 \xa0 \xa0 ???--20160923T010410??? >> 20160923T000014 \xa0 \xa0 \xa0 \xa0 \xa0 ???--20160923T000406I understood that a check in Notify sends email?Thank you in advance", 'num_user_post': u' 91', 'author': u'piajola'}, {'date': u'September 23, 2016 - 6:11 pm', 'content': u"The behavior is\xa0documented here\xa0as 'When you have MATLAB Analysis code that uses a React, React stops running if there are a number of consecutive errors in the MATLAB Analysis code. You can choose to receive an alert via email by checking the box Notify me via email if this MATLAB Analysis fails when triggered by TimeControl or React in the MATLAB Analysis app.' It is similar for TimeControl apps.The email is only triggered after the analysis code fails after a number a consecutive errors exceeds a predetermined limit. In the example you gave, the\xa020160923T050017 execution errored, but the immediate next execution of the analysis at\xa020160923T040013 executed successfully. This caused\xa0the counter on number of consecutive\xa0failures is reset back to zero, and since this number never exceeded our predetermined limit, you didn't get an email.The idea is that we do not want to shut off the MATLAB analysis\xa0if it was a temporary failure, such as in your case a failure code from the pushingbox service. If there is a consistent, repeated number of failures, then it needs user intervention, which is when the email is generated.Also, if you try-catch errors in your code and do not let the errors propagate out of your analyses, the counter\xa0of the\xa0number of failed executions will not be incremented, ultimately resulting in not getting an email since you will not\xa0hit the predetermined limit.Hope this helps clarify the behavior.", 'num_user_post': u' 225', 'author': u'Vinod'}, {'date': u'September 23, 2016 - 6:31 pm', 'content': u"Hi Vinod,Thank you for answering me.So as the try - catch reduces a lot the Pushingbox server error in accepting data from TS, I would try then a wait before the webwrite in catch, in pseudo code:\xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0try\xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 webwrite\xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0catch\xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 WAIT <- how to put here a 2 seconds 'wait' here. \xa0I think a two second wait and then 'insist' will work\xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 \xa0 webwrite\xa0Is that possible? It seems that there is a slot of time for us to 'run' our Analysis in your servers (I think)\xa0Thank you in advance for any help\xa0", 'num_user_post': u' 91', 'author': u'piajola'}, {'date': u'September 24, 2016 - 10:06 pm', 'content': u'If you are looking to send email from MATLAB on some error condition, you can do so following the directions here.You can generate an app specific password in gmail and use the SENDMAIL function in MATALB inside of your\xa0exception handling CATCH clause to send an email on every failure, instead of waiting until the failure count exceeds the limit in ThingSpeak.I hope this helps!', 'num_user_post': u' 225', 'author': u'Vinod'}, {'date': u'September 26, 2016 - 3:37 pm', 'content': u"Vinod,Thank you for your help. And apologies for the delay I was waiting for mondayI will try send SENDMAIL but it seems it sends fixed strings ...I use pushingbox (the only I am aware) because I can send variables (character strings) so I can report the 'alarming' values.My Analysis work fine every time. When after the process wish to write values to another channel it does that perfectly. No need emails here.When some process has 'alarming' values uses the webwrite to send to pushingbox these variables. Pushingbox composes an email with those variables and are sent to my smartphone service provider (free) email server that also composes a (free) SMS sent to my phone. So I have the email subject in less than 30 seconds after the 'alarming' condition. Also report values hourly. Also if there are more than 5 minutes of 'no recording data' in my ThingSpeak (base) channelAll my tribulations start when pushingbox refuses the Thingspeak sendings with the '502' response and subsequent red line. And I have no email. That occurs with 2% of sent values. When I can see the red line and 'save and run' inmediately (on time) this 'repetition' is now accepted by pushingbox and all works. So the question if 'catch' is a little delayed the second webwrite will be accepted this time.Anyway thank you for your time", 'num_user_post': u' 91', 'author': u'piajola'}, {'date': u'September 26, 2016 - 7:41 pm', 'content': u'Turns out I was wrong and the SENDMAIL function in MATLAB is not supported in MATLAB Analysis apps on ThingSpeak at this time.\xa0Let me think of\xa0a different solution for you.', 'num_user_post': u' 225', 'author': u'Vinod'}, {'date': u'September 27, 2016 - 2:57 am', 'content': u'piajola\xa0\xa0\xa0 Not sure of the details but you can capture the result of webwrite\xa0\xa0\xa0 resp=webwrite(...)\xa0\xa0\xa0 then (this is the bit that I dont know)\xa0\xa0\xa0 if resp.status_code != 200\xa0\xa0\xa0\xa0\xa0\xa0 pause(60)\xa0\xa0\xa0\xa0\xa0\xa0 webwrite()\xa0Hopefully one of the Matlab gurus will chime in with the correct syntax..\xa0\xa0\xa0\xa0\xa0\xa0\xa0', 'num_user_post': u' 271', 'author': u'rw950431'}, {'date': u'September 27, 2016 - 1:54 pm', 'content': u'Piajola,\xa0You can use the try, catch construct in MATLAB to catch the errors in your MATLAB Analysis code and add a delay of two seconds as shown below,try\xa0 \xa0 webwrite(<Your call>);catch exception\xa0 \xa0% pause the execution for 2 seconds\xa0 \xa0 pause(2);\xa0 \xa0 webwrite(<Your call>);See the documentation for the pause\xa0command. Note that pausing for more than 2 seconds is not allowed in MATLAB Analysis code.\xa0', 'num_user_post': u' 12', 'author': u'jvasudev'}, {'date': u'September 27, 2016 - 3:10 pm', 'content': u'Hi Vinod,Again thank you for your time. After writing my prior response to you I tried sendmail with a red output saying that is not for users of thingspeak I think\xa0Anyway thank you for your concern\xa0', 'num_user_post': u' 91', 'author': u'piajola'}, {'date': u'September 27, 2016 - 3:12 pm', 'content': u"Hi rw950431,Thank you very much for your post. Will try that magic word 'pause' I was thinking it was 'wait' or 'delay'Search mathworks help is complicated if you do not have the 'exact word'Regards ", 'num_user_post': u' 91', 'author': u'piajola'}, {'date': u'September 27, 2016 - 3:13 pm', 'content': u"Hi jvasudev,Thank you very much for your post.I have my code with try-catch but sometimes both webwrites fail. It seems the time to catch the 'catch exception' is not always enough for the 'insist'.So 'the ask' for the magical word that can get some more wait before the insist.Besides now I know the server slot time for us users is 2 sec.Once, trying a loop that become eternal ended in a red output sayimg I occuped all my turn and get out!Thanks again", 'num_user_post': u' 91', 'author': u'piajola'}, {'date': u'September 27, 2016 - 10:21 pm', 'content': u'Interested to find out if webwrite throws an exception when the remote site returns a 502 error.\xa0 My guess is that it wont..', 'num_user_post': u' 271', 'author': u'rw950431'}, {'date': u'September 28, 2016 - 5:07 pm', 'content': u"Hello rw950431,Delay ... you know when you write I am sleeping and send my answer when you sleep, and also you live the next day\xa0The code that ends in webwrite variables fails about 15 % so 15/100 rejects with 502 and the red line in my Analysis.The code that ends in\xa0 \xa0 \xa0 \xa0try\xa0 \xa0 \xa0 \xa0 \xa0 webwrite\xa0 \xa0 \xa0 \xa0catch \xa0 \xa0 \xa0 \xa0 \xa0 webwritefailed about 1 %Now with pause(1.5) in catch before webwrite 0 fails in almost 2 days. Time will tell ...I have webwrite in 3 analysis, 2 report each XXhour-0 min and XXHr-4 min. The third runs each 5 min checking there are 5 points of data (each minute I send 1 value) if there are 2 or less points I webwrite how many points are recorded, so this is 'random'In my Analysis when I send\xa0 \xa0 \xa0 response = webwrite(....)it returns\xa0 \xa0 \xa0 response =\xa0 \xa0 \xa0 \xa0 1\xd70 empty char arrayWhen webwrite fails in the Output box I find in redError using readContentFromWebServiceThe server returned the message: 'Bad Gateway' for URL, 'http://api.pushingbox.com/pushingbox' (with HTTP response code 502).Error in webwrite[varargout{1:nargout}] = readContentFromWebService(connection, options);In try-catch each webwrite has a very slight different text to know wich one was succesful or the red line if noneRegards\xa0", 'num_user_post': u' 91', 'author': u'piajola'}, {'date': u'September 30, 2016 - 1:01 am', 'content': u'Thats good news!\xa0\xa0 Glad to find that try/catch does work as expected.', 'num_user_post': u' 271', 'author': u'rw950431'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/error-index-exceeds-matrix-dimensions/', 'posts': [{'date': u'September 19, 2016 - 3:04 pm', 'content': u"Hello, I am getting error 'Index exceeds matrix dimensions' after running this peace of code in matlab analysis.\xa0readChannelID = 106292;pumpFieldId = 5;readAPIKey = 'myApiKey';timeRange = 10;[pump, timeStamp] = thingSpeakRead(readChannelID, 'Fields', pumpFieldId, 'numMinutes', timeRange, 'ReadKey', readAPIKey);I can successfully read other channel's fields, except field5. This was working until September 15th. I have tried clear channel, but still it doesn't work. I have no idea what could be wrong.", 'num_user_post': u' 4', 'author': u'paul'}, {'date': u'September 19, 2016 - 4:21 pm', 'content': u"Hi Paul,\xa0I couldn't reproduce the error on my end since channel 106292 is a private channel. I replaced the channel ID with 12397, and the following code worked:readChannelID = 12397;pumpFieldId = 5;timeRange = 10;[pump, timeStamp] = thingSpeakRead(readChannelID, 'Fields', pumpFieldId, 'numMinutes', timeRange);Could you share the last 10 minutes worth of data in your channel (in json format) using the GET Feed endpoint (https://www.mathworks.com/help/thingspeak/get-a-channel-feed.html)?", 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}, {'date': u'September 19, 2016 - 4:44 pm', 'content': u"Here you go Reveal Spoiler{'channel':{'id':106292,'name':'Solar heating','latitude':'0.0','longitude':'0.0','field1':'collector','field2':'boiler_mid','field3':'boiler_bottom','field5':'pump_state','created_at':'2016-04-06T14:50:48+03:00','updated_at':'2016-09-19T23:35:10+03:00','last_entry_id':52},'feeds':[{'created_at':'2016-09-19T22:57:09+03:00','entry_id':33,'field1':'9.31','field2':'52.44','field3':'21.88','field5':'0'},{'created_at':'2016-09-19T22:59:07+03:00','entry_id':34,'field1':'9.31','field2':'52.31','field3':'21.88','field5':'0'},{'created_at':'2016-09-19T23:01:11+03:00','entry_id':35,'field1':'9.25','field2':'52.31','field3':'21.88','field5':'0'},{'created_at':'2016-09-19T23:03:10+03:00','entry_id':36,'field1':'9.25','field2':'52.25','field3':'21.88','field5':'0'},{'created_at':'2016-09-19T23:05:08+03:00','entry_id':37,'field1':'9.25','field2':'52.13','field3':'21.88','field5':'0'},{'created_at':'2016-09-19T23:07:06+03:00','entry_id':38,'field1':'9.19','field2':'52.13','field3':'21.88','field5':'0'},{'created_at':'2016-09-19T23:09:10+03:00','entry_id':39,'field1':'9.13','field2':'52.13','field3':'21.81','field5':'0'},{'created_at':'2016-09-19T23:11:08+03:00','entry_id':40,'field1':'9.13','field2':'52.00','field3':'21.75','field5':'0'},{'created_at':'2016-09-19T23:13:06+03:00','entry_id':41,'field1':'9.13','field2':'52.44','field3':'21.63','field5':'0'},{'created_at':'2016-09-19T23:15:11+03:00','entry_id':42,'field1':'9.06','field2':'52.88','field3':'21.63','field5':'0'},{'created_at':'2016-09-19T23:17:09+03:00','entry_id':43,'field1':'9.06','field2':'53.00','field3':'21.63','field5':'0'},{'created_at':'2016-09-19T23:19:07+03:00','entry_id':44,'field1':'9.00','field2':'53.00','field3':'21.63','field5':'0'},{'created_at':'2016-09-19T23:21:11+03:00','entry_id':45,'field1':'9.00','field2':'52.88','field3':'21.63','field5':'0'},{'created_at':'2016-09-19T23:23:09+03:00','entry_id':46,'field1':'9.00','field2':'52.75','field3':'21.63','field5':'0'},{'created_at':'2016-09-19T23:25:07+03:00','entry_id':47,'field1':'8.94','field2':'52.69','field3':'21.63','field5':'0'},{'created_at':'2016-09-19T23:27:12+03:00','entry_id':48,'field1':'9.00','field2':'52.56','field3':'21.69','field5':'0'},{'created_at':'2016-09-19T23:29:09+03:00','entry_id':49,'field1':'8.94','field2':'52.50','field3':'21.69','field5':'0'},{'created_at':'2016-09-19T23:31:08+03:00','entry_id':50,'field1':'8.88','field2':'52.44','field3':'21.69','field5':'0'},{'created_at':'2016-09-19T23:33:05+03:00','entry_id':51,'field1':'8.94','field2':'52.38','field3':'21.69','field5':'0'},{'created_at':'2016-09-19T23:35:10+03:00','entry_id':52,'field1':'8.94','field2':'52.25','field3':'21.69','field5':'0'}]}I am afraid that it is channel specific problem.", 'num_user_post': u' 4', 'author': u'paul'}, {'date': u'September 20, 2016 - 8:40 am', 'content': u"Thanks for sharing the data. I am able to reproduce the error.While we are working on fixing thingSpeakRead, here are two options that you could consider:Option 1:- Enable Field 4: In the\xa0channel settings tab of Channel 106292, enable Field 4 by selecting the check box. This should resolve the error. Note that you don't need to add Field 4 Chart to your Channel view page. To disable the Field 4 chart, click on the 'x'. You can add it back later by using the 'Add Visualizations' button.\xa0Option 2:- Edit the thingSpeakRead call: Instead of option 1, you could change the MATLAB code to:[data, timeStamp] = thingSpeakRead(readChannelID, 'numMinutes', timeRange, 'ReadKey', readAPIKey);pump = data(:, 4);\xa0Let me know if this doesn't fix the error for you. We\xa0will post again when thingSpeakRead() is updated.\xa0Thanks,Adarsh", 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}, {'date': u'September 20, 2016 - 1:12 pm', 'content': u'I used option 2 and it works now. Thanks for help', 'num_user_post': u' 4', 'author': u'paul'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/matlab-error-thingspeak-encountered-an-internal-error-try-executing-your-code-again/', 'posts': [{'date': u'September 16, 2016 - 3:50 pm', 'content': u'The MATLAB plot() function to visualize ThingSpeak\xa0data:plot(xdata, ydata)might generate the following error if xdata is a datetime vector:ThingSpeak encountered an internal error. Try executing your code again.\xa0To resolve the error, use the following commands instead:\xa0plot(datenum(xdata), ydata)datetick;', 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}, {'date': u'September 20, 2016 - 9:06 am', 'content': u"The\xa0plot function on ThingSpeak\xa0has been updated to resolve the error. You can now\xa0visualize ThingSpeak channel data using the plot function even when xdata is a datetime vector. For example:[data, time] = thingSpeakRead(12397, 'NumPoints', 10, 'Fields', 4);plot(time, data);title('Temperature Plot');", 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/export-matlab-visualisation-as-an-image/', 'posts': [{'date': u'September 16, 2016 - 2:07 am', 'content': u'Anyone know if its possible to export a matlab visualization automatically as an image file? \xa0Say I wanted to save a snapshot at a given time or when a given condition occurs.', 'num_user_post': u' 271', 'author': u'rw950431'}, {'date': u'September 16, 2016 - 2:45 pm', 'content': u"It should be possible to\xa0use the SAVEAS\xa0function in MATLAB to save a figure to an image\xa0and then upload it to dropbox using dropbox's REST API and the WEBWRITE function.\xa0The\xa0condition detection could be in your MATLAB code.", 'num_user_post': u' 225', 'author': u'Vinod'}, {'date': u'September 16, 2016 - 5:50 pm', 'content': u"Since an example is more useful than general instruction, I have this example for you.\xa0\xa0Step 1: Sign up for a dropbox account if you don't already have one.Step 2: Go to\xa0https://www.dropbox.com/developers/apps\xa0and create a new App. Select 'Dropbox API' and 'App folder' as your choice for item\xa0(1) and (2). For\xa0item (3), pick a name. I use 'ThingSpeak' as the name of the folder. Click 'Create App'Step 3: On the page click 'Generate access token'. Copy down this string exactly; it will be needed in your MATLAB app.Step 4: In ThingSpeak, create a new MATLAB Visualization appFor\xa0the MATLAB code, type this:\xa0\xa0tstamp = regexprep(char(datetime('now','format','yyyy-MM-dd''T''HH:mm')),':| |-','_');fname = fullfile(tempdir,sprintf('ImageGeneratedAt_%s.jpg', tstamp));plot(rand(1,10));if <some condition>\xa0\xa0 \xa0\xa0saveas(gcf,fname);\xa0 \xa0\xa0\xa0dropboxAccessToken = '<insert your dropbox access token here, without angle brackets>';\xa0\xa0\xa0 \xa0fid = fopen(fname, 'r');\xa0\xa0\xa0 \xa0data = char(fread(fid)');\xa0\xa0\xa0 \xa0fclose(fid);\xa0\xa0\xa0 \xa0headerFields = {'Authorization', ['Bearer ', dropboxAccessToken]};\xa0\xa0\xa0 \xa0headerFields{2,1} = 'Content-Length';\xa0\xa0\xa0 \xa0headerFields{2,2} = string(length(data));\xa0\xa0\xa0 \xa0headerFields = string(headerFields);\xa0\xa0\xa0\xa0\xa0\xa0opt = weboptions;\xa0\xa0\xa0 \xa0opt.MediaType = 'application/octet-stream';\xa0\xa0\xa0 \xa0opt.CharacterEncoding = 'ISO-8859-1';\xa0\xa0\xa0 \xa0opt.RequestMethod = 'post';\xa0\xa0\xa0 \xa0opt.HeaderFields = headerFields;\xa0\xa0\xa0 \xa0\xa0[~,remoteFName, remoteExt] = fileparts(fname);\xa0\xa0\xa0\xa0\xa0\xa0webwrite(sprintf('https://api-content.dropbox.com/1/files_put/auto/%s%s',remoteFName,remoteExt), data, opt);end\xa0Modify your to be the condition when\xa0you want to save the\xa0snapshot of your MATLAB visualization. Remember to modify the dropboxAccessToken to exactly be the token you got from dropbox.\xa0Presumably you will replace the plot(rand(1,10)) with some other interesting plot you want to make.Now, whenever this MATLAB App is run, if <some condition> is met, you will see a .jpg file show up in your dropbox folder.\xa0Enjoy!", 'num_user_post': u' 225', 'author': u'Vinod'}, {'date': u'September 16, 2016 - 6:22 pm', 'content': u"If you can define your condition\xa0in\xa0a React app, then you can\xa0create a MATLAB Analysis app that runs in the React to\xa0generate the plot in your Dropbox folder. The MATLAB analysis app would\xa0be:\xa0tstamp = regexprep(char(datetime('now', 'format', 'yyyy-MM-dd''T''HH:mm')), ':| |-', '_');fname = fullfile(tempdir,sprintf('ImageGeneratedAt_%s.jpg', tstamp));eval('plot(rand(1,10))');saveas(gcf, fname);dropboxAccessToken = '<insert your dropbox access token here, without angle brackets>';fid = fopen(fname, 'r');data = char(fread(fid)');fclose(fid);headerFields = {'Authorization', ['Bearer ', dropboxAccessToken]};headerFields{2,1} = 'Content-Length';headerFields{2,2} = string(length(data));headerFields = string(headerFields);\xa0opt = weboptions;opt.MediaType = 'application/octet-stream';opt.CharacterEncoding = 'ISO-8859-1';opt.RequestMethod = 'post';opt.HeaderFields = headerFields;[~,remoteFName, remoteExt] = fileparts(fname);\xa0webwrite(sprintf('https://api-content.dropbox.com/1/files_put/auto/%s%s',remoteFName,remoteExt), data, opt);\xa0This MATLAB analysis app will\xa0be triggered based on your condition specified in the React and the MATLAB visualization should show up in your Dropbox's Apps/ThingSpeak\xa0folder.\xa0You will need to modify the eval('plot(rand(1,10))') to do whatever interesting visualization you want.", 'num_user_post': u' 225', 'author': u'Vinod'}, {'date': u'September 17, 2016 - 4:49 pm', 'content': u"Hi Vinod,Thank you for the 'tips'My experience follows:Blindly following your steps with Visualizations, worked fine ...I have some working Visualizations:- with Plot- with Annotation (sort of color boxes with numbers inside)- with Histogramall worked, all are in DropBoxBUT ...I have two types- with thingSpeakPlot(time, [ humidityData,temperatureData], 'legend',{'H %', 'T *C'});- with thingSpeakPlotYY( time2, data2,time1, data1, 'YGrid1','on','YLabel1','% H.R.',...'YLabel2','*C','XLabel','Feha y hora',...'Title','Tempix y Humix ultimas semana');code finished with this error(?) messagecurl: /opt/mlsedu/matlab/R2016b/bin/glnxa64/libcurl.so.4: no version information available (required by curl){'revision': 15, 'bytes': 9704, 'thumb_exists': true, 'rev': 'f4e35680f', 'modified': 'Sat, 17 Sep 2016 20:06:49 +0000', 'mime_type': 'image/jpeg', 'path': '/Mimagen_2016_09_17T15_06.jpg', 'is_dir': false, 'size': '9.5 KB', 'root': 'app_folder', 'client_mtime': 'Sat, 17 Sep 2016 20:06:48 +0000', 'icon': 'page_white_picture'}with a white box in DropBox. There is a file.Not tried your Analysis because I do not know how to eval(...) my 'visualizations'. Your example is one line eval('one_line_only') and I need to read data (thingspeakRead) and more lines with the parameters, etc. How to do thatAnd keep the 'tips' coming", 'num_user_post': u' 91', 'author': u'piajola'}, {'date': u'September 18, 2016 - 9:45 pm', 'content': u"thingSpeakPlot and thingSpeakPlotYY use a different technology and my solution will not work for\xa0those functions.However, you can still use the PLOT and YYAXIS\xa0functions in your MATLAB Analysis app and use the suggestion as above. As for multi line analysis, you can do all of that using\xa0MATLAB code. The only thing that needs to be in the eval('<plot something>') is the MATLAB commands for plotting, which is typically just one line of code anyway.Switching to pseudo code as I don't have a concrete example:thingSpeakRead(....) MATAB code for mathematical analysis ... eval('<plot something>') MATLAB code to capture snapshot and upload to dropbox ...\xa0If you have a public\xa0channel with data that you would be comfortable sharing, along with the MATLAB analysis and visualizations you currently have,\xa0I may be able to transcode it for you.", 'num_user_post': u' 225', 'author': u'Vinod'}, {'date': u'September 19, 2016 - 1:41 am', 'content': u'Vinod/\xa0\xa0 Thats a neat hack! Wonder if the same technique could be used with imgur?\xa0 Looks a little more complex due to OAuth and the 1-month expiry on access tokens. https://api.imgur.com/oauth2', 'num_user_post': u' 271', 'author': u'rw950431'}, {'date': u'September 19, 2016 - 8:09 pm', 'content': u'Hi Vinod,Thank you very much for your explanation and offer.Sorry for the delayed postReading PLOT and YYAXIS and trying I have now the plots going to Dropbox\xa0Again thanks a lot\xa0', 'num_user_post': u' 91', 'author': u'piajola'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/average-3-fields-and-dynamic-update/', 'posts': [{'date': u'September 15, 2016 - 12:28 pm', 'content': u"This is really a 2 part question:1. How do you average data from 3 fields that I've read in using thingSpeakRead? \xa0This is data taken from 3 different temperature sensors that I want to average across the 3 sensors and\xa0have this be done for each time that the samples are taken. \xa0In other words, I want to calculate and display one temp-time graph out of 3.2. How do you automatically trigger a refresh based on data that is being updated/sent to ThingSpeak?", 'num_user_post': u' 4', 'author': u'David'}, {'date': u'September 15, 2016 - 9:53 pm', 'content': u"Here is the basic outline. \xa0Create a MATLAB analysis that does something like this:______________Temp1 = thingSpeakRead ...Temp2 = thingSpeakRead ...Temp3 = thingSpeakRead ...allTemp = [Temp1,Temp2,Temp3];meanTemp = mean(allTemp);chID = xxxxx; % Your channel ID for the mean temp% Write the mean to a new channelthingSpeakWrite(chId,meanTemp);_______________To 'automatically trigger a refresh based on data that is being updated/sent to ThingSpeak'\xa0use the React App to run your MATLAB analysis on insert of your data (assuming you can reliably use one of you three temp readings to trigger with the other two already updated). \xa0If React timing is an issue then try the TimeControl App.", 'num_user_post': u' 4', 'author': u'Robert Mawrey'}, {'date': u'September 16, 2016 - 8:45 am', 'content': u'You may also find the\xa0movmean\xa0and\xa0movmedian\xa0functions to be highly useful as well.\xa0-Rob', 'num_user_post': u' 47', 'author': u'Rob Purser'}, {'date': u'September 19, 2016 - 6:33 pm', 'content': u'Exactly what I was looking for. \xa0Thanks for the help!\xa0', 'num_user_post': u' 4', 'author': u'David'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/error-message-value-must-be-a-1x2-vector-of-increasing-datetime-values/', 'posts': [{'date': u'September 16, 2016 - 3:56 pm', 'content': u"If you are manually setting the axis limits of your plot using the datenum function as below:\xa0plotHandle.Parent.XLim = [datenum(datetime('8-August-2016')), datenum(datetime('20-August-2016'))]\xa0the following error might be generated:\xa0Error using matlab.graphics.axis.decorator.DatetimeRuler/validateLimitsValue must be a 1x2 vector of increasing datetime values.Error in matlab.graphics.axis.decorator.DatetimeRuler/setLimitsDelegate\xa0To resolve the error, use the following command instead:\xa0plotHandle.Parent.XLim = [(datetime('8-August-2016'), datetime('20-August-2016')]", 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/log-scaling-problem/', 'posts': [{'date': u'September 8, 2016 - 7:27 pm', 'content': u"I'm trying to plot data on a log scale using this code fragment:thingSpeakPlot(time, light, 'YScale','log');however all I get is an empty chart. \xa0The X-axis has time values, but no Y-axis value or data plotted. \xa0The data is read in correctly - I can see it when I plot it without the log. \xa0Can anyone shed some light on this.", 'num_user_post': u' 4', 'author': u'David'}, {'date': u'September 8, 2016 - 11:52 pm', 'content': u"HI\xa0vwgtimk5,It works without any issues in my case ... I hope this help you\xa0copy - paste this code (blindly, no questions, no typing) in a\xa0MATLAB Visualizations in MATLAB Codetime = 0:1:5light = exp(time)% thingSpeakPlot(time, light);% thingSpeakPlot(time, light, 'YScale','log');2 tries,first try, erase % in first\xa0thingSpeakPlot and Save and Run. \xa0See in 'output' the values for time and\xa0light and the\xa0MATLAB Plot Outputsecond try, put again % in the first\xa0thingSpeakPlot and\xa0erase % in second thingSpeakPlot and Save and Run. See results.Maybe the characters in your machine are different.(?)Good luck", 'num_user_post': u' 91', 'author': u'piajola'}, {'date': u'September 10, 2016 - 12:40 pm', 'content': u'It turns out that I had zeros in my data. \xa0The log plot works fine once I adjusted the offending 0 values.', 'num_user_post': u' 4', 'author': u'David'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/plot-a-bar-graph-using-matlab/', 'posts': [{'date': u'August 23, 2016 - 11:16 pm', 'content': u"Anyone know how to make matlab plot a bar (column) graph instead of a line?\xa0I've got this graph https://imgur.com/a/ELcjl\xa0 which I would like to plot as a bar graph with a different colors for positive and negative values.What I am looking for is kind of like the stem plots (https://au.mathworks.com/help/thingspeak/thingspeakstem.html) but I would really like solid bars rather than lines with circles on the ends.", 'num_user_post': u' 271', 'author': u'rw950431'}, {'date': u'August 24, 2016 - 8:02 am', 'content': u'Hi. You might be looking for a histogram (or hist). I will check with others to find other options.\xa0', 'num_user_post': u' 402', 'author': u'Hans'}, {'date': u'August 24, 2016 - 1:20 pm', 'content': u"Histogram is a good option if you want to look at frequency of observations or variation. \xa0However, if you want a 'traditional' bar or column chart, take a look at the bar\xa0and barh commands in MATLAB.For example, to make a bar graph of the cars going east bound for the past 10 minutes from our car counter:cars = thingSpeakRead(38629,'OutputFormat','table','NumMinutes',10);bar(datenum(cars.Timestamps),cars.NumberOfEastboundCars)datetickRob", 'num_user_post': u' 47', 'author': u'Rob Purser'}, {'date': u'August 24, 2016 - 9:30 pm', 'content': u"Thanks Rob..\xa0 I got this code that works but looks pretty crappy.\xa0 Do you know how I can set the width so the bars dont have gaps between them? I tried the width parameter but it seems to make no difference.https://thingspeak.com/apps/matlab_visualizations/89481\xa0% Draw a bar graph of Interconnector power% red for positive, blue for negativepower = unique(thingSpeakRead(148317,'OutputFormat','table','NumDays',1));pos=power(power.Interconnect > 0,:)neg=power(power.Interconnect <= 0,:)%bar(datenum(power.Timestamps),power.Interconnect,1.0)bar(datenum(neg.Timestamps),neg.Interconnect,'r')hold onbar(datenum(pos.Timestamps),pos.Interconnect,'b')hold offdatetick\xa0", 'num_user_post': u' 271', 'author': u'rw950431'}, {'date': u'August 25, 2016 - 1:34 pm', 'content': u"Now you're getting into aesthetics.\xa0The doc pages linked earlier\xa0provide a lot of info and examples on the large number of parameters you can tweak to your liking. \xa0Based on your comment, you want 'BarWidth' to be 1. \xa0I'd suggest setting EdgeColor to match the FaceColor as well.cars = thingSpeakRead(38629,'OutputFormat','table','NumMinutes',10);h = bar(datenum(cars.Timestamps),cars.NumberOfEastboundCars,'r',... 'BarWidth',1,'EdgeColor','r');hold onh2 = bar(datenum(cars.Timestamps),-cars.NumberOfWestboundCars,'b',... 'BarWidth',1,'EdgeColor','b');datetickhold off-Rob", 'num_user_post': u' 47', 'author': u'Rob Purser'}, {'date': u'August 25, 2016 - 11:42 pm', 'content': u"Rob/\xa0\xa0 Thanks for the info.\xa0One-day graph looks much better..https://thingspeak.com/apps/matlab_visualizations/89481\xa0however extending the time-frame to 3 days still leaves a little to be desiredhttps://thingspeak.com/apps/matlab_visualizations/89640% Draw a bar graph of Interconnector power% red for positive, blue for negativepower = unique(thingSpeakRead(148317,'OutputFormat','table','NumDays',3));pos=power(power.Interconnect > 0,:)neg=power(power.Interconnect <= 0,:)%bar(datenum(power.Timestamps),power.Interconnect,1.0)bar(datenum(neg.Timestamps),neg.Interconnect,'r','BarWidth',1,'EdgeColor','r')hold onbar(datenum(pos.Timestamps),pos.Interconnect,'b','BarWidth',1,'EdgeColor','b')hold offgrid ontitle 'South Australian Interconnector Load'ylabel 'Net Power (MW)'legend('Buying Power','Selling Power')datetick('x','dd/mm')", 'num_user_post': u' 271', 'author': u'rw950431'}, {'date': u'August 29, 2016 - 9:19 am', 'content': u"Given the amount of data that your looking to plot\xa0in a single chart, another option to consider is an area chart.\xa0Here is an example code snippet:\xa0power = unique(thingSpeakRead(148317,'OutputFormat','table','NumDays',3));% Make a copy of the data to manipulate for the area plotpos = power.Interconnect;% For the positive data define all points less than or equal to zero to be NaNpos(pos <= 0) = NaN;% Make a copy of the data to manipulate for the area plotneg=power.Interconnect;% For negative data define all points greater than zero to be NaNneg(neg > 0) = NaN;% Plot the negative dataarea(datenum(power.Timestamps),neg, 'FaceColor', 'r');hold on% Plot the positive dataarea(datenum(power.Timestamps),pos, 'FaceColor', 'b');% Additional settingshold offgrid ontitle 'South Australian Interconnector Load'ylabel 'Net Power (MW)'legend('Buying Power','Selling Power')datetick('x','dd/mm')", 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}, {'date': u'August 29, 2016 - 7:15 pm', 'content': u'Thanks Adarsh, that looks great.https://thingspeak.com/apps/matlab_visualizations/90293Is there an easy way to reduce the areas of unused space at the beginning and end of the plotted data?\xa0 Currently my plot has 3 days of data but a 4-day timescale.', 'num_user_post': u' 271', 'author': u'rw950431'}, {'date': u'August 31, 2016 - 10:04 am', 'content': u"axis('tight') should\xa0do the trick. Here is the full doc for the function if you want to set custom limits:http://www.mathworks.com/help/matlab/ref/axis.html\xa0", 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}, {'date': u'August 31, 2016 - 7:59 pm', 'content': u'Fabulous!\xa0 Thanks very much', 'num_user_post': u' 271', 'author': u'rw950431'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/limits-on-data-size-for-matlab-plots/', 'posts': [{'date': u'August 28, 2016 - 5:55 am', 'content': u"Attempted to plot 3 days worth of 5 minute data (https://thingspeak.com/apps/matlab_visualizations/89640) but the matlab visualisation gives the following error:-ThingSpeak cannot display the amount of data requested. Reduce the size of the output or suppress the output with a semicolon.\xa0I calculated that 5 min data for 3 days should only be 864 points.\xa0What is the limit?\xa0 Less than 1000 data points doesn't seem very generous.", 'num_user_post': u' 271', 'author': u'rw950431'}, {'date': u'August 29, 2016 - 10:06 am', 'content': u"There are two topics here:\xa01. Number of characters\xa0displayed in the 'Output' window of a MATLAB Analysis or Visualization App page2. Number of points to be visualized in a plotThe error message that is generated for your case is due to topic #1 - too many characters are being returned to the 'Output' window.\xa0Since I don't have your code, the general suggestion to resolve this error is to end your MATLAB commands with a semicolon ';'. This prevents the LHS arguments from being printed to the 'Output' window.\xa0For example:- Return characters to Output windowdata = thingSpeakRead(12397)- Do\xa0not return characters to Output windowdata = thingSpeakRead(12397);\xa0If this doesn't resolve the error, share your code and I might be able to find the cause of the error.-Adarsh", 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}, {'date': u'August 29, 2016 - 7:05 pm', 'content': u'Thanks Adarsh.. adding the trailing semi-colons fixed it.', 'num_user_post': u' 271', 'author': u'rw950431'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/create-a-channel-within-matlab/', 'posts': [{'date': u'July 18, 2016 - 3:34 pm', 'content': u"Is this possible? I'm able to do so outside of Matlab by sending a POST request to\xa0https://api.thingspeak.com/channels via the procedure outlined at http://www.mathworks.com/help/thingspeak/create-a-channel.htmlBut I'd like to do so within Matlab so I'm seeking another method.\xa0", 'num_user_post': u' 4', 'author': u'jemapel'}, {'date': u'July 18, 2016 - 4:56 pm', 'content': u"Hi ,\xa0You can use the following MATLAB code as a template to send a POST request to create a channel from within MATLAB,\xa0UserApiKey = 'xxxxxxxxx'; % This is your account API key found on the Account -> My Account Pageurl = 'https://api.thingspeak.com/channels.json';\xa0data = ['api_key=',UserApiKey, '&name=test channel']; % These are the parameters for the POST requestresponse = webwrite(url,data) % Using webwrite command to send a POST request\xa0You can visit the\xa0https://www.mathworks.com/help/thingspeak/queue-commands-using-the-talkback-app-from-matlab.html\xa0for an example as how to use MATLAB commands to send GET and POST requests.\xa0\xa0", 'num_user_post': u' 12', 'author': u'jvasudev'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/combine-3-private-channels-in-to-one-graph/', 'posts': [{'date': u'June 21, 2016 - 8:37 am', 'content': u"Hey,Im trying to get around the 15 sec update limit by having 3 channels that update depending on a few counters on the arduino.I was hoping the next part would be easy, but it isn't.The data I am sending to each channel is very basic. Its a door bell counter, so its either 0 or 1.If the bell is pressed a few times within 15 seconds, then it will send the three 1's to different channels. The rest of the presses are disregarded.I would like to show the combined presses with a 30sec timescale on another channel as a vertical line graph.Can anyone help?\xa0This is what I have so far:\xa0readChannelID1 = XXXXXX;readChannelID2 = XXXXXX;readChannelID3 = XXXXXX;readAPIKey1 = 'XXXXXXXXXXXXXXXXX';readAPIKey2 = 'XXXXXXXXXXXXXXXXX';readAPIKey3 = 'XXXXXXXXXXXXXXXXX';chan1 = thingSpeakRead(readChannelID1, 'Fields', 1, 'ReadKey', readAPIKey1, 'NumDays',2);chan2 = thingSpeakRead(readChannelID2, 'Fields', 1, 'ReadKey', readAPIKey2, 'NumDays',2);chan3 = thingSpeakRead(readChannelID3, 'Fields', 1, 'ReadKey', readAPIKey3, 'NumDays',2);thingSpeakPlot(chan1, chan2, chan3);", 'num_user_post': u' 2', 'author': u'jamin'}, {'date': u'June 21, 2016 - 8:39 pm', 'content': u'Suspect you need to read the timestamps as well as the data from the 3 channels .\xa0\xa0 I dont know enough Matlab to show exactly how to do this \xa0 maybe this will work, maybe not\xa0[data1,time1] = thingSpeakRead(..)[data2,time2] = thingSpeakRead(..)[data3,time3] = thingSpeakRead(..)plot(time1,data1,time2,data2,time3,data3)\xa0(Based off https://au.mathworks.com/help/matlab/ref/plot.html)', 'num_user_post': u' 271', 'author': u'rw950431'}, {'date': u'June 22, 2016 - 3:12 am', 'content': u'Hey rw950431,This is creating the errorError using horzcatDimensions of matrices being concatenated are not consistent.Will keep searching Google.Cheers', 'num_user_post': u' 2', 'author': u'jamin'}, {'date': u'June 22, 2016 - 9:52 pm', 'content': u'Guessing that its complaining because the arrays have different numbers of data points..\xa0 Does it work if you only plot one series at a time?plot(time1,data1)You may end having to figure out how to merge the 3 datasets together before plotting- please show me how to do it when you figure it out..', 'num_user_post': u' 271', 'author': u'rw950431'}]}]}, {'url': u'https://community.thingspeak.com/forum/matlab/page-6/', 'threads': [{'url': u'https://community.thingspeak.com/forum/matlab/displaying-an-analysis-result/', 'posts': [{'date': u'June 16, 2016 - 4:51 pm', 'content': u'Hello Everyone!I am trying to write a matlab analysis file to calculate the days of battery life remaining on a esp8266 based on the slope of the decreasing battery readings and extrapolate how many days of power are left. I have the code all written and tested (works great!), however displaying a single number or string result in my channel has proved to be a huge pain. Are any of the following possible to display the information?Use\xa0thingSpeakWrite to write (string or number) to the status field?Use\xa0thingSpeakWrite to write to a field, but have the raw text displayed, not interpreted as a number and be graphed?Channel the matlab analysis text output to a channel or visualization?A visualization that only displays one number? or string?Does anyone have any example code to do any of these things, as of now im not sure any are possible based on the documentation I have read.Thanks For your help!Briscoe', 'num_user_post': u' 1', 'author': u'briscoe'}, {'date': u'June 16, 2016 - 11:43 pm', 'content': u"Hi\xa0Briscoe,If this is of any help ... I hope it is near your last question1- Apps / MATLAB Visualizations + Green button 'New' \xa0(create a new visualization) (no analysis no plugin)2- Custom (no starter code) + Green button 'Create' (near page bottom) (so you get a blank box without templates/examples)3- MATLAB Code box (copy/paste the blue code below) \xa0+ \xa0Green button 'Save and Run'\xa0\xa0 \xa0See results in below MATLAB Plot Output box &\xa0Output box. I hope you have your results in a field(s) of your channel(s).\xa0 \xa0Maybe this can be a start point% ---------------------------------------------% ---------------------------------------------% http://www.mathworks.com/help/matlab/ref/annotationtextbox-properties.html% ---------------------------------------------currentTemp = thingSpeakRead(58826,'Field',1) % 58826 my public channelcurrentHume = thingSpeakRead(58826,'Field',2) % 58826str={[num2str(currentHume) '%'],[num2str(currentTemp) '\xb0C']};% --------------------------------------------- izquierannotation('textbox',[0.0 0.01 0.35 0.99],...'BackgroundColor','0 1 0',...'FaceAlpha',0.15,...'Color','0 1 1',...'LineWidth',2,...'HorizontalAlignment','center',...'VerticalAlignment','bottom',...'LineStyle',':',...'String',str,...'FontSize',38); \xa0 \xa0%45% --------------------------------------------- medioannotation('textbox',[0.36 0.01 0.19 0.99],...'BackgroundColor','1 0 1',...'FaceAlpha',0.15,...'Color','0 0 1',...'LineWidth',2,...'HorizontalAlignment','center',...'VerticalAlignment','bottom',...'LineStyle',':',...'String',[num2str(currentHume) '%'],...'FontSize',20); \xa0 \xa0%25% --------------------------------------------- ajobadereannotation('textbox',[0.56 0.01 0.43 0.65],...'FontName','FixedWidth',...'BackgroundColor','.2 .3 .5',... % 0 1 1'FaceAlpha',0.95,...'LineWidth',2,...'HorizontalAlignment','right',...'VerticalAlignment','top',...'LineStyle',':',...'Color','.51 .50 1',...'String',[num2str(currentTemp) '\xb0C'],...'FontSize',43); \xa0 \xa0%30% --------------------------------------------- arridereannotation('textbox',[0.56 0.67 0.43 0.33],...'FontName','FixedWidth',...'BackgroundColor','1 1 0',...'FaceAlpha',0.35,...'LineWidth',2,...'HorizontalAlignment','left',...'VerticalAlignment','middle',...'LineStyle',':',...'Color','1 0 1',...'String',['Otra Cosa'],...'FontSize',20); \xa0%15% ---------------------------------------------% ---------------------------------------------Good luck\xa0", 'num_user_post': u' 91', 'author': u'piajola'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/increase-graph-size/', 'posts': [{'date': u'January 20, 2016 - 7:43 am', 'content': u"Hello,I would like to know if its possible to increase graph size, so that when you load the page graph is already bigger than the default 240x100. I know this is possible with with normal Plugins but is the same possible with MATLAB apps?If so can you please tell he how to do it.All I would like to do is display my data publicly (can't with normal plugins, can with MATLAB), and have ability to customize graph size (can with normal Plugin, don't know if possible with MATLAB graph).This is my graph that i would like to resize.https://thingspeak.com/apps/matlab_visualizations/45521Cheers, Fanest", 'num_user_post': u' 4', 'author': u'fanest'}, {'date': u'May 31, 2016 - 7:22 am', 'content': u"Hi Fanest,I had the same 'problem'... And here is my solution.1. Create an plugin: Chart with multiple series, also if you only need 1 \U0001f6422. In the CSS you change 425px to 100% and 235px to 100%3. In the java script you put in channelID, field number etcIf you only need ONE plot then delete the following lines:// variables for the second series var series_2_channel_id = 9; var series_2_field_number = 2; var series_2_read_api_key = ''; var series_2_results = 10; var series_2_color = '#00aaff';// add the second series addSeries(series_2_channel_id, series_2_field_number, series_2_read_api_key, series_2_results, series_2_color);Save and now push the view buttonRegards,Jan", 'num_user_post': u' 1', 'author': u'stofakiller'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/matlab-visualization-with-more-than-8000-data-points/', 'posts': [{'date': u'March 31, 2016 - 9:19 am', 'content': u"I'm trying to visualize temperature logging data over a time span of days, which corresponds to more than 8000 data points at a 15 sec POST rate.Since 'thingSpeakRead' won't get more than 8000 data points, I figured I can use more than one call and fetch one day worth of data per call, all in one Visualisation script. Unfortunately, the scripts times out when i try to gather more than 3 days of data at a time. Is there any way of getting data over longer periods of time? I don't even need all consecutive data points. Some kind of low-pass filtering would also be fine for me!My example code:readChannelID = [93093]; fieldID = [1 2 3 4 5 6];% Compile 1 week of data % Read last day. First day out of seven days t0 = datetime('now'); noofdays = 3; t = cell(noofdays,1); for i=1:noofdays % Set t(i) to represent exatly 'now' but i days ago t{noofdays-i+1} = t0; t{noofdays-i+1}.Day = t{noofdays-i+1}.Day-i+1; end% Fetch all data from TS alldata = 0; alltime = 0; for i=1:(noofdays-1) [data,time] = thingSpeakRead(readChannelID,'Fields',fieldID,'DateRange',[t{i},t{i+1}]);% Merge data if i==1 alldata = data; alltime = time; else alldata = cat( 1, alldata, data ); alltime = cat( 1, alltime, time ); end end% Downsample data with 1/100 y = alldata(1:10:end,:); x = alltime(1:10:end);%% Visualize Data %% figure(1) plot(x, y); xlabel('Time'); ylabel('Temperature \xb0C'); title('Sensor values last week'); legend('A','B','C','D','E','F');", 'num_user_post': u' 1', 'author': u'skoogs'}, {'date': u'April 4, 2016 - 3:11 am', 'content': u"You can use the 'average' or 'median' modifiers to reduce the number of data points although thingspeak only supports a limited number of intervals see https://au.mathworks.com/help/thingspeak/get-a-channel-feed.html", 'num_user_post': u' 271', 'author': u'rw950431'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/matlabsimulink-code-generation-from-models/', 'posts': [{'date': u'March 29, 2016 - 7:06 am', 'content': u'Hi there,We are using Embedded Coder to create executable C code from Matlab/Simulink Models for our controllers. It works quite well, so I wonder if it would be possible to use same approach  for Thingspeak analysis/actions. E.g. it would be nice, if I could generate code from my Simulink models and upload them to Thingspeak, to be executed periodically or on events. The input data for model would be fed by channels, and outputs would be connected to some actions in Thingspeak.That would be a great cloud controller.', 'num_user_post': u' 3', 'author': u'lingvo'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/download-problem/', 'posts': [{'date': u'March 22, 2016 - 4:53 am', 'content': u"Hi everyone!I made a setup with an LDR connected to the ADC of an ESP12E. The ESP12E sends every 20 seconds data to my Thingspeak channel. The data is shown very neat in a graph so it works! But here is my problem. When I try to download the data in a CSV file I only get the latest 101 data points. But somehow the other data points are not dumped, because I still see them in my graph. Can anybody tell me if I'm doing somtething wrong or that I need to change something in the settings?Thanks in advance for your reply!Thijs", 'num_user_post': u' 1', 'author': u'ThijsFeenstra'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/recommendations-on-parsing-data-once-a-day/', 'posts': [{'date': u'June 18, 2015 - 9:06 pm', 'content': u"Hello (and thanks for reading),I have two fields of data in a channel and I need to find the easiest way to parse the data, once a day (at the end of the day), from the two fields and output it's result into a third field. Basically what I'm doing is calculating the area under the curve of the two data fields, comparing them, and then outputting the percent difference result to the third field. My initial thoughts were to write a Python script that runs on a computer and set it to run once a day. However, that means that the computer must always be on and the data must be pulled from ThingSpeak (what if it doesn't work that day?). Any other ideas?", 'num_user_post': u' 11', 'author': u'fishmastaflex'}, {'date': u'June 19, 2015 - 8:50 am', 'content': u"Hi,You can look at TimeControl for executing a ThingHTTP once a day ( https://thingspeak.com/docs/timecontrol#timecontrol ).  Your ThingHTTP would have to access a webserver that performs the actual calculation and POSTs it back to another channel. We realize that this isn't an ideal solution, and will work towards allowing calculations to be performed using ThingSpeak in the future.lee", 'num_user_post': u' 457', 'author': u'lee'}, {'date': u'June 20, 2015 - 3:41 pm', 'content': u"Thank you, lee!Having a webserver may be even more work than my initial idea of a python script running everyday on a computer. Probably because I know nothing about running webservers. Allowing calculations through ThingSpeak sounds like the perfect solution. That's probably pretty far away on your road-map. Any ideas of when that may happen?", 'num_user_post': u' 11', 'author': u'fishmastaflex'}, {'date': u'June 22, 2015 - 8:44 am', 'content': u"Hi,I'm not sure of an exact date, but it is a feature that has been requested often so it's high on our list of priorities.lee", 'num_user_post': u' 457', 'author': u'lee'}, {'date': u'March 17, 2016 - 11:40 am', 'content': u'We have added MATLAB Analysis as an app on ThingSpeak. You can use MATLAB Analysis in combination with TimeControl to run scheduled code. The MATLAB code can script a lot of possible interactions.', 'num_user_post': u' 402', 'author': u'Hans'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/bar3-function/', 'posts': [{'date': u'February 27, 2016 - 4:27 pm', 'content': u'Hi - Is it possible to do the bar3 function on ThingSpeak?http://www.mathworks.com/help/matlab/ref/bar3.htmlHas anyone done it on ThingSpeak, and can share their code?Thanks!', 'num_user_post': u' 1', 'author': u'kayakpete'}, {'date': u'February 29, 2016 - 9:50 am', 'content': u'Hi kayakpeteYou can create a bar3 plot on ThingSpeak. Here is a sample code snippet:X = randi(100, 24, 3);bar3(X)Thanks', 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/urlfilter/', 'posts': [{'date': u'February 1, 2016 - 12:06 pm', 'content': u'Hi everyone:I\xb4m suffering fails on URLFILTER command, I\xb4ve used an analysis to calculate some variables that uses URLFILTER to get data from a webpage, It worked fine for last 3 months, but now, from three weeks ago, it\xb4s failing at random.Sometimes work fine, sometimes fails, by the way, I don\xb4t receive email informing failed.https://thingspeak.com/channels/56115In private view I have mora data and graphics, but as seen in other topics, can\xb4t make them public.Does anybody realized this behaviour?Thanks in advance.B.R.', 'num_user_post': u' 4', 'author': u'mircasam'}, {'date': u'February 1, 2016 - 1:24 pm', 'content': u'We will look into the issue with URLFILTER. We have not had any complaints wider than yours, but we will investigate.What kind of analysis are you doing?Thanks for joining the ThingSpeak Community!Hans', 'num_user_post': u' 402', 'author': u'Hans'}, {'date': u'February 2, 2016 - 8:21 am', 'content': u"Dear Hans:I have a Matlab Analisys that makes a request through a ThingHTTP that consults Openweather page to retrieve Wind Speed (I have an authorised Acces to Openweather through my API).The rest of the analisys calculates Dew Point, Wind chill, cloud base level and some other params.As I said before, It worked fine since three months ago, but now (from three weeks ago) I notice that the charts were no updating the calculated parameters, so go to the Analisys page and found:'Error using urlfilterTarget string speed does not appear'I tried the ThingHTTP request pasting the URL directly on Chrome and works fine.Thanks a Lot.", 'num_user_post': u' 4', 'author': u'mircasam'}, {'date': u'February 3, 2016 - 11:55 am', 'content': u"Hi, Thanks for the additional information. URLfilter function parses through the http response to find the target string 'speed'. Once it finds the word 'speed' it finds the first number occurring after. We haven't changed the URLfilter function since we introduced it. Therefore, my suspicion is that the response from Openweather might sometimes not contain the word 'speed' in it and therefore URLfilter generates an error. If this doesn't resolve the issue, tell me more about how you are using URLfilter function with ThingHttp in your MATLAB Analysis App.Thanks,Adarsh", 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}, {'date': u'February 3, 2016 - 3:58 pm', 'content': u"Hi,I\xb4ve been making some test, and I think you\xb4re right.I make a call to Openweather.org throgh ThingHTTP:https://api.thingspeak.com/apps/thinghttp/send_request?api_key=6EBVWEE0FCM6TXU9If you paste literally in your browser you would receive a text (maybe JSON) with the response, but I found that sometimes, fails, so URLFILTER cannot find the string.More or less, every two or three times you request from Openweather fails.Example of right response:{'coord':{'lon':-3.86,'lat':40.73},'weather':[{'id':800,'main':'Clear','description':'Sky is Clear','icon':'01n'}],'base':'cmc stations','main':{'temp':274.17,'pressure':932.87,'humidity':82,'temp_min':274.17,'temp_max':274.17,'sea_level':1051.18,'grnd_level':932.87},'wind':{'speed':3.02,'deg':9.0007},'clouds':{'all':0},'dt':1454530522,'sys':{'message':0.0025,'country':'ES','sunrise':1454484198,'sunset':1454520947},'id':3117503,'name':'Manzanares el Real','cod':200}Example of wrong response:{'cod':401, 'message': 'Invalid API key. Please see http://openweathermap.org/faq#error401 for more info.'}Obviously in this response,URLFILTER cannot find string 'speed'so fails...I\xb4ll try to contact to Openweather.org. anyway if matlab analisys could not stop trying to parse, probably on second try it will work.Maybe it would be a good evolution for URLFILTER function, or maybe a max number of errors before failing.And I\xb4m still waiting for the email informing the fail... I used to receive it.Thank you very, very much!I\xb4ll try to inform you about Openweather issue.B.R.Miro", 'num_user_post': u' 4', 'author': u'mircasam'}, {'date': u'February 4, 2016 - 10:57 am', 'content': u"One option to avoid errors in MATLAB for known conditions is to use the Try-Catch construct:http://www.mathworks.com/help/matlab/ref/try.htmlIf you want the code to do nothing when URLfilter does not find 'speed', leave the Catch portion empty:try   urlfilter()catchendThis will keep the MATLAB code running. You can also nest try-catch constructs, i.e., try  % First attempt   urlfilter()catch   try      % Second attempt       urlfilter()   catch   endendThis allows you to call urlfilter twice and it also prevents your MATLAB Analysis app from erroring even  if on both attempts 'speed' data is missing. We are looking into the email issue and will get back soon.Thanks,Adarsh", 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}, {'date': u'February 7, 2016 - 5:04 pm', 'content': u'Dear Adarsh:If you leave thingspeak alone, don\xb4t mind if matlab says that code contains an error, everything works fine!As we spoke, error only happens once every two or three times, so sometimes when you find the error message in the matlab analisys, maybe next time the analisys runs, it works. And that\xb4s it right.It\xb4s working correctly since Thursday, maybe some updates are not correct, but doesn\xb4t mind, at the end it\xb4s no so important if you miss a data in hundreds.Thank you very much.Best Regards.Miro.', 'num_user_post': u' 4', 'author': u'mircasam'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/trigger-analysis-when-specific-field-is-updated/', 'posts': [{'date': u'January 6, 2016 - 5:15 pm', 'content': u"I have sensors that wake up at specific intervals ( ie 15 minutes), take a measurement and send it to Thingspeak.I also have a Matlab Analysis script that examines the data in the stored fields and derives different values and then writes it to a different Field in the same channel.My specific question is 'Is there a way to trigger an Matlab script by watching for an update on a Channel field?' So for example, when Field1 gets updated, the Matlab analysis triggers and updates Field2.The other option is just triggering on fixed intervals, but that feels inefficient and inaccurate.", 'num_user_post': u' 5', 'author': u'edcasati'}, {'date': u'January 6, 2016 - 5:25 pm', 'content': u"Found my own answer.Create a trigger that 'on insertion' of data into a specific field, checks for 'Not equal to' a value and triggers if true.If I give it a nonsense value to check for, like a Humidity reading of -500, it will never meet the condition, and trigger the Matlab analysis every time.", 'num_user_post': u' 5', 'author': u'edcasati'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/matlab-visualization-two-channels-with-no-same-time-distribution/', 'posts': [{'date': u'December 18, 2015 - 8:19 am', 'content': u'Bonjour ,I have two devices so two channelswhen plote data , one error that say datetime not synchro.no date time merge between two data serieshow to for merge ?easy ?thanks for help', 'num_user_post': u' 7', 'author': u'picpic020960'}, {'date': u'December 18, 2015 - 11:38 am', 'content': u"Hi, When visualizing data from two channels with different time stamps, you can plot them individually with the hold command. For example, I am plotting data from two channels below:% Read data from channel 9 and 12397[data1, time1] = thingSpeakRead(12397, 'NumPoints', 20, 'Fields', [3,4]);[data2, time2] = thingSpeakRead(9, 'NumPoints', 20);% Plot data corresponding to channel 12397plot(time1, data1);% Hold the previous plothold;% Plot data corresponding to channel 9plot(time2, data2);", 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}, {'date': u'December 19, 2015 - 7:03 am', 'content': u"Thanks Manwork fine !(with 'thingspeakplot' draw legend but with 'plot' good time stamp result)edit : title , legend added ... too fun !", 'num_user_post': u' 7', 'author': u'picpic020960'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/matlab-visualization-update-issue/', 'posts': [{'date': u'December 8, 2015 - 5:13 am', 'content': u'Bonjour ,i have a MTALAB Visualization with tree fields , works fine.but when when i want update the source code , not possible at each time ; some time wait , wait .....other issue : when more than 3 days  , stucks at 3 days.but Thingspeak is fun(more easy to write on the Cloud than on SD Card !)Thanks', 'num_user_post': u' 7', 'author': u'picpic020960'}, {'date': u'December 17, 2015 - 4:40 am', 'content': u'Bonjour ,still blocked !is it possible to export the source of my MATLAB Visualization.so can use it to update and save in new version.information : with Android browse can see the source but not edit and not copy.on Windows 10 on MPMAN tablet  ... always waiting !(source write on VISTA)This is irritating', 'num_user_post': u' 7', 'author': u'picpic020960'}, {'date': u'December 17, 2015 - 9:03 am', 'content': u'Hi, Thank you for letting us know about the issue on MPMAN tablet. We will look into this. The source code for all your MATLAB Visualization and MATLAB Analysis Apps should be available for edit and copy, you do not need to export it. If you use a laptop, or any computer to access your MATLAB Visualization page you will have full access to your code.Thanks,Adarsh', 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}, {'date': u'December 17, 2015 - 2:53 pm', 'content': u"@Adarsh,Same here, but 'second repetition' now. Please see http://community.thingspeak.com/forum/matlab/matlab-analysis-and-visualizations-forbidden-to-me/ see reply 13 there Hans solved my EX-issue that time but now it returned, to me the same issue.I upgraded to W10 in the same machine and I could work well and test well my Thingspeak adventures in W7 and later in W10 until 2-3 weeks ago this 'trouble' returned. I am working in my hardware (all sensors I would use) so I am not pressed to work in Matlab in thingspeak for now. That is why I have not reported this 'again'.So if you work in thingspeak (I think), please check with Hans as he already solved this issue I think ...(Same behavior in Android 4 phone & tablet).Thank you in advanceHS", 'num_user_post': u' 91', 'author': u'piajola'}, {'date': u'December 18, 2015 - 7:59 am', 'content': u'Bonjour ,OKall is fineprobably no signout on other PC.Thanks', 'num_user_post': u' 7', 'author': u'picpic020960'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/thermostat-monitoring/', 'posts': [{'date': u'November 9, 2015 - 6:03 pm', 'content': u"Hi,I am trying to analyse the heating in my house, in which I have 12 thermostats.  I am keen to understand better the relationship of heating in each room between the set point and how often and how long the thermostat has to call for heat to get the room to a specific temperature, or heat the room by 1 degreeTo start off, I was hoping to be able to plot the temperature of a thermostat in degrees as a line, vs the setpoint of the thermostats as a step line, vs whether the stat is calling for heat, as a bar chart of either zero or one.  My first issue is getting the temp and set point on the same graph with the set point being a stepped line, ie not a sloping line between points.  Is this possible, or do I need to generate the missing values, as the channel only records values when it changes.  Then, how would I change the 'On' or 'Off' values on the heating field to a 0 or 1 to then plot, and can I do line vs column on the same chart?I am hoping this would be a useful example for others once I can get this working, and then I keen to learn from others what they do.  ie I would love to calculate the number of hours per day that each room is calling for heat (and the total) and plot vs outside temperature / humidity / wind etc.  Thanks,", 'num_user_post': u' 3', 'author': u'siclark'}, {'date': u'November 10, 2015 - 11:10 am', 'content': u"siclark,'I was hoping to be able to plot the temperature of a thermostat in degrees as a line, vs the setpoint of the thermostats as a step line'Yes it is possible to create a step line type visualization using the MATLAB Visualizations app and the MATLAB visualization function 'stairs'. For more information and examples, please see the following documentation page: http://www.mathworks.com/help/matlab/ref/stairs.html'how would I change the 'On' or 'Off' values on the heating field to a 0 or 1'One method of achieving this task is writing to the Channel's 'status' field ('on' or 'off') or to one of the other 7 channel fields (0 or 1). For more information on how to update a Channel feed, see the following documentation page: https://thingspeak.com/docs/channels#update_feed'can I do line vs column on the same chart'Yes it is possible to overlay different forms of visualizations on the same plot or figure. Again, using the MATLAB Visualization app, the following MATLAB Code will produce a bar chart with a line chart overlaid on top.bar(1:10);% Retain current plot when adding new plots.hold;plot(10:-1:1) ;Note that the '%' symbol is used to add comments to MATLAB code (http://www.mathworks.com/help/matlab/matlab_prog/comments.html)Documentation:1. bar: http://www.mathworks.com/help/matlab/ref/bar.html2. hold: http://www.mathworks.com/help/matlab/ref/hold.html3. plot: http://www.mathworks.com/help/matlab/ref/plot.html", 'num_user_post': u' 4', 'author': u'hans'}, {'date': u'November 11, 2015 - 6:00 pm', 'content': u"Hi,Thanks for all this.  It took  me a while to realise I could just enter the matlab code as I would the thingspeak functions, as thats not clear in the documentation.  However I get an error when using the stairs function  of Input arguments must be numeric.  I guess it doesnt like the date values?This is the code. readChannelID = 64586;fieldID1 = 1;fieldID2 = 2;[data1, time1] = thingSpeakRead(readChannelID, 'Field', fieldID1, 'NumDays',5);[data2, time2] = thingSpeakRead(readChannelID, 'Field', fieldID2, 'NumDays',5);plot(time1, data1);hold;stairs(time2, data2);Also, if I use thingSpeakPlot(time2, data2) I get a proper chart, but it doesnt plot the values if I use plot(time2, data2).   Is there a known reason for this, do the functions behave differently??Thanks", 'num_user_post': u' 3', 'author': u'siclark'}, {'date': u'November 12, 2015 - 8:54 am', 'content': u"siclark,'However I get an error when using the stairs function of Input arguments must be numeric. I guess it doesnt like the date values?'Yes, that is correct. According to the 'stairs' documentation, the X and Y input arguments must be numeric values of type 'Data Types: single | double | int8 | int16 | int32 | int64 | uint8 | uint16 | uint32 | uint64 | logical' (http://www.mathworks.com/help/matlab/ref/stairs.html?searchHighlight=stairs#inputarg_X)With additional MATLAB Code, it is possible to convert the MATLAB DateTime object returned by the MATLAB function 'thingSpeakRead' to a numeric value, and have the X or Y Axes label formatted to display a date string. It is possible to convert a DateTime object to a numeric value using the MATLAB Function 'datenum'http://www.mathworks.com/help/matlab/ref/datenum.htmlOnce the figure is plotted, it is possible to change the formatting of the X or Y Axes label using the MATLAB Function 'datetick'http://www.mathworks.com/help/matlab/ref/datetick.htmNote that the MATLAB function accepts a 'dateformat' string as the second argument. Please refer to the the documentation section for more information:http://www.mathworks.com/help/matlab/ref/datetick.html?searchHighlight=stairs%20xtick#inputarg_dateFormatFor example:[data, time] = thingSpeakRead(id, 'Field', field, 'NumPoints', 5);stairs(datenum(time), data);datetick('x', 'mm/dd/yy');'I use thingSpeakPlot(time2, data2) I get a proper chart, but it doesnt plot the values if I use plot(time2, data2)'The interactive ThingSpeak plotting functions such as 'thingSpeakPlot' are incompatible with the static MATLAB plots such as 'plot' or 'stairs' and cannot be combined. Please refer to the 'Troubleshooting' section of the documentation: https://thingspeak.com/docs/troubleshooting", 'num_user_post': u' 4', 'author': u'hans'}, {'date': u'November 12, 2015 - 5:51 pm', 'content': u'Thanks.  Its taken a while, as using datenum on the time argument for my first data set worked, but it was the second I wanted to plot as stairs and this still didnt work.The first has many more data points than the second, hence wanting to plot the second as stairs, and I assumed that this would work.However in the end I had to read the original 2nd series, use the matlab analysis to clean up and remove all the nulls from that series and write to a new channel.  Reading that channel in to the visualisation for the step line on top of the line plot from the original channel works well.  Now to work out how to do the On/Off conversion which I think I will also have to clean up and then write to a new channel as well as converting to 0,1', 'num_user_post': u' 3', 'author': u'siclark'}]}]}, {'url': u'https://community.thingspeak.com/forum/matlab/page-7/', 'threads': [{'url': u'https://community.thingspeak.com/forum/matlab/how-to-call-matlab-function-in-thingspeak-matlab-analysis/', 'posts': [{'date': u'October 15, 2015 - 2:40 am', 'content': u"Hi Helper,I am a total green hand on Matlab stuff and I have a question about how I can call a MATLAB function in Thingspeak Matlab Analysis? For example, I have a Matlab function as below:  Function  [ data1, data2, parameter1, parameter2] = calculate_something(parameter1, parameter2, parameter3).......Is there a way that I can call this function in Thingspeak Matlab Analysis's Matlab code?This is very similar to call 'ThingspeakRead' function in the current Matlab Analysis panel window. I am wondering if I can call a customized function in the panel window.Thanks a lot for any comments in community.Regards", 'num_user_post': u' 5', 'author': u'jimmyjiangyq'}, {'date': u'October 21, 2015 - 2:34 pm', 'content': u"Hi jimmyjiangyq,At present, you will not be able to call custom functions from either the MATLAB Analysis App or the MATLAB Visualization App. Both the Apps only allow a MATLAB script to be written and this script can only call functions already defined in MATLAB. We will consider this capability for a future release.As a workaround, you can move the logic in the 'calculate_something' function into each MATLAB Analysis/Visualization App that requires it, as a script.Thanks,Adarsh", 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}, {'date': u'October 22, 2015 - 1:34 pm', 'content': u"If you have your function publicly hosted somewhere, then you can try urlwrite as follows -urlwrite('http://pastebin.com/raw.php?i=FYQbPHWH','total.m');total(23,10)Hope that helps.", 'num_user_post': u' 4', 'author': u'gamerji'}, {'date': u'October 22, 2015 - 7:45 pm', 'content': u'Hi Adarsh and gamerji,Thanks a lot for your comments. It seems like I may need to use standalone Matlab platform to do such task.Jimmyjiangyq', 'num_user_post': u' 5', 'author': u'jimmyjiangyq'}, {'date': u'October 31, 2015 - 8:46 pm', 'content': u'I am also facing problem using if function. I am getting current time using clock function. Then I want to do some check on time and based on the time I want to feed data to new channel. It appears if function does not work at all.Update: I did not write end statement. It works.', 'num_user_post': u' 8', 'author': u'rkgarg'}, {'date': u'November 2, 2015 - 8:10 pm', 'content': u'@Adarsh_Murthy - if you are considering feature requests for future releases can I suggest passing URL parameters through to the matlab environment?   This would allow more generic and re-usable  code since you could specify a channel or field number in the URL and have matlab process it rather than have to hard-wire it into each block.', 'num_user_post': u' 271', 'author': u'rw950431'}, {'date': u'November 3, 2015 - 10:21 am', 'content': u'This is a good idea for enhancing our MATLAB functionality. We will take a closer look at it. Thanks!', 'num_user_post': u' 402', 'author': u'Hans'}, {'date': u'November 3, 2015 - 10:54 am', 'content': u'Thanks for sharing your idea rw950431!', 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/how-to-plot-line-with-different-line-style-part-way-through/', 'posts': [{'date': u'October 18, 2015 - 1:46 pm', 'content': u"Hello,I have a few devices sending 3 variables to thingspeak every 30 minutes... device id, temperature, and mode.  I need some help making one graph to display the following:1) a separate line plotted on the same graph for each deviceID2) for each line plotted, I would like the line style to change from a solid linestyle when mode is 1 to a dashed linestyle when mode is 0?3) y axis should represent temperature and x axis should represent the timestampI'm new to thingspeak and matlab...the best I have been able to achieve so far is one line on a graph but it has all temperatures and mode from all devices...I haven't been able to separate the lines by deviceID and have no clue if matlab can plot a line using different linestyles *partway* through the line.Any gurus out there that can point me in the right direction?Thanks,Marco", 'num_user_post': u' 4', 'author': u'moballa'}, {'date': u'October 19, 2015 - 8:38 am', 'content': u"moballa,It is possible to plot multiple lines on a single graph in MATLAB using the 'plot' function:http://www.mathworks.com/help/matlab/ref/plot.htmlAccording to the documentation, you would provide your data to the function as a column vector, or matrix, depending on the number of lines to plot. Lines can be assigned a line style or LineSpec. At this time, it does not appear possible for segments between points to be different LineSpecs. However, it is possible to break the data down into more line segments and assign LineSpecs to each line segment. See the following example in the documentation:http://www.mathworks.com/help/matlab/ref/plot.html?searchHighlight=plot#btzpndl-1", 'num_user_post': u' 4', 'author': u'hans'}, {'date': u'October 19, 2015 - 10:29 am', 'content': u"Hi,Plotting is a huge subject in MATLAB:  See the doc for the plot command here:http://www.mathworks.com/help/matlab/ref/plot.htmlThere are lots of ways to do this, but here's something to get you started:% Generate some datad = table;d.timestamp = (datetime('now') - minutes(240):minutes(30):datetime('now'))';d.temperature = [23;45;56;24;44;56;23;43;55];d.id = [1;2;3;1;2;3;1;2;3];d.mode = [1;1;1;1;1;1;0;0;0];d% Plot by sensor IDplot(d.timestamp(d.id == 1),d.temperature(d.id == 1),...    d.timestamp(d.id == 2),d.temperature(d.id == 2),...    d.timestamp(d.id == 3),d.temperature(d.id == 3))However, it doesn't solve your 'dotted when mode is 1' request.  You can do this, but it'll take some more work.  You'll need to plot the non dotted and dotted separately.  So, you'll have 6 lines in your plot.-Rob", 'num_user_post': u' 47', 'author': u'Rob Purser'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/are-all-matlab-functions-available-in-thingspeak-matlab-apps/', 'posts': [{'date': u'October 16, 2015 - 4:58 am', 'content': u"I'm new to MATLAB but have found a MATLAB function stairs() that appears to be able to plot the step line graph that is the form in which I'd like to visualize my data.Is the stairs() function available to me in the MATLAB visualisation app?If the answer is 'yes', I'm happy to have a go at finding out for myself how to do so but I don't want to waste time if it's not possible \U0001f642Looking forward to becoming another happy ThingSpeak (and MATLAB) user!", 'num_user_post': u' 1', 'author': u'ALikelyLad1942'}, {'date': u'October 16, 2015 - 9:15 am', 'content': u"Yes. It is possible to use the MATLAB plotting function 'stairs' in ThingSpeak.", 'num_user_post': u' 4', 'author': u'hans'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/matlab-analysis-and-visualizations-forbidden-to-me/', 'posts': [{'date': u'October 12, 2015 - 4:20 pm', 'content': u"Hi Thingspeak,I think this is a 'problem' for an administrator that knows who can answer.Next thank you in advance to who can help me.Also english is not my mother language so I hope you can understand me (and please, do not laugh a lot \U0001f642I will use the ESP8266 everywhere in my house and send data to Thingspeak and see there some processeddata visualizations.After sign in, in My Channels I can click and pick one of the channelsIn the channel picked I can use the 5 tabs and click the 5 buttons (3 green).The trouble begins in the APPS window https://thingspeak.com/appsI tried succefully Chart With Multiple Series and Google Gauge in the Plugins link/boxWhen clicking MATLAB Analysis or Visualizations I get the NEW button and then the choices and examplesWhen clicking the CREATE button I get the next window BUT the MATLAB Code box is empty with a little rotatingcircle indicating to wait for something that NEVER happens. I can not write anything there either.Also in React the same behaviorThe only thing I can do is to Delete this windowI have this problem since the early days of OctoberWhat am I doing wrong?HS", 'num_user_post': u' 91', 'author': u'piajola'}, {'date': u'October 13, 2015 - 1:31 am', 'content': u'Did you try to clear your browser history, restart your browser and try again?  Sometimes this helps..', 'num_user_post': u' 271', 'author': u'rw950431'}, {'date': u'October 13, 2015 - 4:03 am', 'content': u"Hi everybody,I am facing exactly the same problem as piajola : unable to start Matlab with the same symptom.@rw950431 : a chrome session with a crystal clear history doesn't change anything.Please, Thingspeak team, help us !Alain", 'num_user_post': u' 3', 'author': u'aby'}, {'date': u'October 13, 2015 - 8:48 am', 'content': u'aby and piajola,Thank you for reporting this issue. To further diagnose the problem, can you tell us which browser and version you are using? Older browsers like Internet Explorer 9 are not fully supported.', 'num_user_post': u' 4', 'author': u'hans'}, {'date': u'October 13, 2015 - 9:52 am', 'content': u"Thank you jklol for your quick answer,You're right, it is actually a question of browser in which the MatLab Editor can't open :For me :It doesnt work with the latest releases of Firefox (41.0.1) and Chrome (45.0.2454.101 m) running on Windows8It works with the latest one of IE 11(IE 11.0.9600.18036) running on the same computerI hope it will be useful", 'num_user_post': u' 3', 'author': u'aby'}, {'date': u'October 13, 2015 - 10:53 am', 'content': u'My tribulations:In w7-chrome Versi\xf3n 45.0.2454.101 m-ie            Versi\xf3n 11.0.8600.18015In my Android 4 smartphone via wifi same router so I think same IP to mathworks-CM Browser   cheetah mobile inc    5.20.10-UC Browser   ucweb inc                       10.7.0Also tried in W8Chrome and Ie but I am starting to use W8 so I do not know versions because I do not have that machine at handAll same odd behavior little waiting circle in MATLAB boxMy guess is that mathworks is blocking my IP ... I access Thingspeak server and I think the MATLAB box is resolved in Mathworks server who refuses my IP (if sent) ... just a wild and uninformed guess ...I have not tried to update my IE I do not use it but later I will try it for the cause@aby lucky you at least you can use IE @jklol Thank you very much from this lost and alone soul ... a ray of hope to me HSPS @jklol I will try anything you ask for', 'num_user_post': u' 91', 'author': u'piajola'}, {'date': u'October 13, 2015 - 11:13 am', 'content': u'To be exact, I have tested Chrome  on Vista Pro, not on W8Alain', 'num_user_post': u' 3', 'author': u'aby'}, {'date': u'October 13, 2015 - 6:00 pm', 'content': u"This might also happen if javascript cannot run on the page. Can you see if you have extensions that are blocking any javascript from running on the page such as NoScript? If you don't see any that might be causing the issue, can you list all the extensions that are installed on Chrome here?", 'num_user_post': u' 4', 'author': u'gamerji'}, {'date': u'October 13, 2015 - 7:12 pm', 'content': u'@gamerjiRemember we are 2 Aby and me. It seems NOT exactly same cause only the resultHe can use IE 11In chrome://extensions-Avast Online Security  10.2.0.190-Documentos de Google sin conexi\xf3n 0.5 -- Offline Google docs-Google Docs 0.9-Hojas de c\xe1lculo de Google 1.1  -- Google Spreadsheets-Presentaciones de Google 0.9 -- like Office PowerPointI think that I did not install these extensions (at least not on purpose)Also remember I use Chart With Multiple Series & Google Gauge in the Plugins link/boxThat is javascript, right?HS', 'num_user_post': u' 91', 'author': u'piajola'}, {'date': u'October 14, 2015 - 9:43 am', 'content': u'Extensions can block some javascript, but allow others. Not sure but in your case it looks like Avast Online Security could be the issue.Can you try accessing the MATLAB apps/visualizations in chrome without these extensions? You can try using incognito mode in Chrome or start chrome with the --disable-extensions flag.', 'num_user_post': u' 4', 'author': u'gamerji'}, {'date': u'October 14, 2015 - 5:32 pm', 'content': u'@gamerjiWell ... nothing newAll the same behavior ... little waiting circle every try. Normally I use Chrome in incognito mode.I think I had Avast extension always disabled because I tried it enabled and disabled.Enabled has some warnings about blocked things I did not saw before.Also tried disbling all Avast shields directly in Avast (with respective warnings and redsigns the world is ending!)HS', 'num_user_post': u' 91', 'author': u'piajola'}, {'date': u'October 15, 2015 - 2:58 pm', 'content': u'Hi... we made some updates to the editor window to reduce the file size and load time. Can you try again and see if you get better results?Thanks,Hans', 'num_user_post': u' 402', 'author': u'Hans'}, {'date': u'October 15, 2015 - 4:45 pm', 'content': u'@Hans,10:30 my time, about 4+ hours ago, checking with my smartphone via Chrome I get the little waiting circle and after some 10 seconds suddenly the box is filled with code!! Fantastic ... so I tried to edit the code and it worked So next ... try in the PC. When started I get a window saying to install Windows 10 free! so now I have W10 in my PC and working Chrome with MATLAB Analysis working now. A lot of changes at same time, so you have to guess what the problem was.I will try MATLAB Visualizations next and report here ... also I will report the results of my ventures in MATLAB in ThingspeakHans, say THANK YOU VERY MUCH to yourself and  all the persons involved in my happiness I hope this is permanent to continue and finish my project.HS', 'num_user_post': u' 91', 'author': u'piajola'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/retrieve-last-value-for-a-specific-field/', 'posts': [{'date': u'October 13, 2015 - 8:59 pm', 'content': u"I need to be able to retrieve the last value written to a specific field along with its timestamp.  I have no way of knowing if the field was written to a minute ago or 20 days ago.  It's entirely possible there are 8000 NaN values between now and that last write so I can't reliably read in an array and search for the data.  I was able to get the value using the URLfilter (url:https://thingspeak.com/channels/666/fields/2/last.json?api_key=BLECHIMTIREDOFFLAILING) but I can't see how I can retrieve the date/time.I don't suppose there's a simple name/value pair for 'last?'  Or perhaps a workaround?  I need to retrieve two or three values from the same channel and unfortunately it's not possible for me to split them up into their own dedicated channels.thanks,Brad", 'num_user_post': u' 9', 'author': u'AYAduino'}, {'date': u'October 13, 2015 - 10:19 pm', 'content': u"Brad, Try 'webread' instead of urlfilter. This will allow you to get all of the data fields inside of last.json Hans", 'num_user_post': u' 402', 'author': u'Hans'}, {'date': u'October 14, 2015 - 6:25 pm', 'content': u'Thanks, exactly what I needed. Brad', 'num_user_post': u' 9', 'author': u'AYAduino'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/fast-fourier-transform-and-moving-average-in-mat-lab/', 'posts': [{'date': u'October 11, 2015 - 1:06 am', 'content': u'Hey,I recently joined Thingspeak.com and I want to log voltage and current reading and measure up the 10th harmonic hence I am wondering if anyone knows how to perform the fast Fourier transform of data posted to Thingspeak.com. I am monitoring a like that expects Dc current only hence I would like to implement a moving average filter if it has any disturbances. Any help or suggestion will be highly appreciated', 'num_user_post': u' 2', 'author': u'muunduk@gmail.com'}, {'date': u'October 11, 2015 - 8:04 pm', 'content': u'hi, You could use MATLAB Analysis app in ThingSpeak to do the fast fourier transform of data. You would need to read the data from your ThingSpeak channel via ThingSpeakRead API. Here are links to relevant documentation: 1. MATLAB Analysis: https://thingspeak.com/docs/matlab_analysis#matlab_analysis2. ThingSpeakRead: https://thingspeak.com/docs/matlab_analysis#thingSpeakRead3. FFT using MATLAB: http://www.mathworks.com/help/matlab/ref/fft.htmlThanksAkhila', 'num_user_post': u' 21', 'author': u'akhila'}, {'date': u'October 13, 2015 - 7:40 pm', 'content': u'Hey akhilaThanks for this really helped, I managed to read my data and plot a graph of the data in thingspeak by usingthingSpeakPlot(data);  but i am not able to do the fft, if you know the syntax on how to perform the fft , please help.ThanksMuundu', 'num_user_post': u' 2', 'author': u'muunduk@gmail.com'}, {'date': u'October 14, 2015 - 9:41 am', 'content': u"Hi,Like Akhila commented earlier, there's a good discussion of how to use the FFT function in MATLAB.  See the link she posted.  There's also a good discussion here: http://www.mathworks.com/matlabcentral/newsreader/view_thread/27009Typically, people are really interested in the Power Spectral Density, rather than the true FFT -- the topic above discusses that, and wikipedia has a lot of good information.-Rob", 'num_user_post': u' 47', 'author': u'Rob Purser'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/annoucing-coursera-mooc-introduction-to-programming-with-matlab-starts-october-5th/', 'posts': [{'date': u'September 23, 2015 - 2:18 pm', 'content': u'If you are interested in getting a more in-depth introduction to MATLAB, this Vanderbilt MOOC is excellent.https://www.coursera.org/course/matlabThis is an introductory college-level course in computer science for engineering and science students. However, it is also suitable for high school students who are interested in programming. The material assumes no background in mathematics beyond the standard high school curriculum. Students taking the course will get a MATLAB license free of charge for a three-month period. Students who successfully complete this course will:* become familiar with general concepts in computer science* gain an understanding of the general concepts of programming* obtain a solid foundation in the use of MATLABHighly recommended!-Rob', 'num_user_post': u' 47', 'author': u'Rob Purser'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/send-info-to-a-different-field/', 'posts': [{'date': u'September 20, 2015 - 12:12 am', 'content': u"Hi all,My first post and am new to matlab and thingspeak so hope my code is easy to fix.Basically I need to read from fields 1 & 2 then send the difference to field 3.When I run my code below I keep getting this error messageError using thingSpeakWriteWait for 15 seconds since the last update was completed before requesting another.My code% Channel ID to read data fromChannelID = 48915;% Field index IDPortFieldID = 1;StbdFieldID = 2;ListFieldID = 3;% API keywriteKey = 'OQQMWYDW2J5WLAJQ';% Read Port and stbdPortVal = thingSpeakRead(ChannelID, 'Fields', PortFieldID);StbdVal = thingSpeakRead(ChannelID, 'Fields', StbdFieldID);% Calculate differenceList = PortVal - StbdVal;thingSpeakWrite(ChannelID, List, 'Fields', 3, 'WriteKey', writeKey)", 'num_user_post': u' 6', 'author': u'hmslouis'}, {'date': u'September 21, 2015 - 7:53 am', 'content': u"Hi hmslouis,ThingSpeak implements a 15 sec limit between consecutive updates to a channel. Therefore, if your fields 1 and 2 on channel 48915 are being updated once every 15 seconds, then the update to field 3 from your MATLAB code will be within 15 seconds of the last update to (fields 1 & 2 on) channel 48915. Therefore, thingSpeakWrite function generates an error. In such a case, I would create a new channel to store the difference between field 1 and field 2. This would avoid the update rate limit.Example code - I have renamed channelID to ReadChannelID and added WriteChannelID to store the ID of the new channel that the difference data needs to be written to. I have also set the difference data to be written to field 1 of the new channel instead of field 3:% Channel ID to read data fromReadChannelID = 48915;WriteChannelID =% Field index IDPortFieldID = 1;StbdFieldID = 2;ListFieldID = 3;% API keywriteKey = ;% Read Port and stbdPortVal = thingSpeakRead(ReadChannelID , 'Fields', PortFieldID);StbdVal = thingSpeakRead(ReadChannelID , 'Fields', StbdFieldID);% Calculate differenceList = PortVal - StbdVal;thingSpeakWrite(WriteChannelID , List, 'Fields', 1, 'WriteKey', writeKey)- Adarsh", 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}, {'date': u'September 21, 2015 - 10:51 pm', 'content': u'Hi Adarsh,Thanks so much for your explanation - that make perfect sense now.I set up a new channel and send the data there now and the error is gone, which is great.When I check the data in the new channel however there is nothing there.Do I need to do something for this code to loop so that the new data will show up in the new channel?Thanks heapsLouis', 'num_user_post': u' 6', 'author': u'hmslouis'}, {'date': u'September 21, 2015 - 11:00 pm', 'content': u'Hi Louis,The easiest way to do this would be to create a React ( https://thingspeak.com/docs/react ) which is connected to your MATLAB analysis.  Every time new data is written to your original channel, React will automatically run the MATLAB code and write to your derived channel via thingSpeakWrite.lee', 'num_user_post': u' 457', 'author': u'lee'}, {'date': u'September 22, 2015 - 1:22 am', 'content': u"Thanks Lee,I'll do some more reading and give it as go.If I'm right my process flows like this;1. Photon 1 reads pressure to field 1 on my data collection channel2. Photon 2 reads pressure to field 2 on the same data collection channel3. React senses a change in values of field 1 above and runs Matlab analysis4. Matlab analysis reads in the 2 values above and sends them to a new channel5. The new channel data is posted via a google gauge pluginDoes this make sense.Cheers - thanks again for your help.Louis", 'num_user_post': u' 6', 'author': u'hmslouis'}, {'date': u'September 22, 2015 - 2:33 am', 'content': u"Hi all,I think the whole loop works better for me by using separate channels as opposed to sending info to different fields within the same channel.I'll test further but for my application I need more frequent feeds and less storage of data.Is there a paid version or equivalent service that reads every 5 seconds but stores much less data ( maybe the previous 5 - 10 readings)?For my current application I only need to know what is happening right now and the past is not so relevant any more.Am loving the learning curve and the flexibility of thingspeak and can't wait to set my little project up.Cheers,Louis", 'num_user_post': u' 6', 'author': u'hmslouis'}, {'date': u'September 22, 2015 - 9:29 am', 'content': u"Hi Louis,Yes you've got the workflow correct, I'm glad that you seem to have things working!No, we don't have a paid version that would allow updates to a single channel at a more frequent rate, but it is something we're considering for the future.lee", 'num_user_post': u' 457', 'author': u'lee'}, {'date': u'September 22, 2015 - 5:25 pm', 'content': u"Thanks Lee,All working well now.The other way of achieving a more frequent output for my project would be to alter the React to include multiple parameters.For example having either of two conditions met (e.g. if channel X field>0 or if channel Y field>0).I tried to make 2 separate Reacts but it wouldn't allow it.Currently I can setup the 2 feed channels to update (every 15 seconds) but have them set up to alternate thereby sending a value every 7-8 seconds.This frequency of data would be ideal for me. But the React on only one channel gets me back to reading only every 15 seconds.Is my understanding correct and if so might there be another work around for me?Cheers,Louis", 'num_user_post': u' 6', 'author': u'hmslouis'}, {'date': u'September 22, 2015 - 10:25 pm', 'content': u"Hi Louis,An alternative could be to set React to update on every data insert, and run a MATLAB analyses each time.  You could check both conditions in MATLAB and then write to the derived channel if necessary.If you're ok with delayed data, you can also set a TimeControl to run every 5 minutes and perform the MATLAB analysis.lee", 'num_user_post': u' 457', 'author': u'lee'}, {'date': u'September 23, 2015 - 4:00 am', 'content': u"Thanks again Lee,Yes I've set it up to react on every data insert.All working well.Cheers,Louis", 'num_user_post': u' 6', 'author': u'hmslouis'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/solution-calculating-the-average-of-channel-with-uneven-timestamps-using-trapz/', 'posts': [{'date': u'September 15, 2015 - 1:55 pm', 'content': u"fishmastaflex asked a question about using the trapz function in MATLAB to calculate the average temperature on a channel where the samples come in irregularly.  There's no built in function to do this, but it's only a couple lines of code.I have a similar challenge with one of my temperature sensors.  It only sends data when there is a significant change:>> data = thingSpeakRead(32188,'NumPoints',5,'OutputFormat','table')data =          Timestamps         TempF    ____________________    ______    15-Sep-2015 13:28:33    68.584    15-Sep-2015 13:29:34    68.685    15-Sep-2015 13:30:34    68.861    15-Sep-2015 13:34:36    69.047    15-Sep-2015 13:36:36    69.188To use trapz, you need to convert the timestamps into X coordinates.  Do this by calculating the relative time for each timestamp in seconds:X = seconds(data.Timestamps - data.Timestamps(1))X =     0    61   121   363   483Calculate the area under the curve (approximate integral) using trapz, then divide by the number of elapsed seconds to get the mean average:>> avg = trapz(X,data.TempF) / X(end)avg =   68.9317More about trapz: http://www.mathworks.com/help/matlab/ref/trapz.html", 'num_user_post': u' 47', 'author': u'Rob Purser'}, {'date': u'September 15, 2015 - 3:30 pm', 'content': u"Thanks Rob. Glad to spark the conversation. My method works pretty good too using the posix time function. It's only one line of code:areaUnderCurve = trapz(posixtime(X),Y);X is my matrix of timestampsY is my dataWatch out for NaN values though as well. Even if you have just one, the trapz function will spit out NaN. I used isnan to delete values in the matrix.", 'num_user_post': u' 11', 'author': u'fishmastaflex'}, {'date': u'September 15, 2015 - 7:17 pm', 'content': u'I like it.', 'num_user_post': u' 47', 'author': u'Rob Purser'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/posix-number-of-days-since-not-working/', 'posts': [{'date': u'September 14, 2015 - 2:34 pm', 'content': u"Hey guys,I'm noticing a some strange things with a MATLAB function I am using. It seems to be missing the hour, minute, and seconds in the calculation.  posixtime(t) takes a datetime value t  and should output the 'number of seconds elapsed since 00:00:00 1-Jan-1970 UTChttp://www.mathworks.com/help/matlab/ref/posixtime.htmlI am reading in the correct datetime values using thingSpeakRead. If I print the string in the console for the first value, I get exactly:13-Sep-2015 18:20:58Sounds good. Okay, now I try to apply the MATLAB function posixtime(t) to get the number of seconds for the value above, and it outputs:1.4422e+09 (1442200000 seconds)Which is according to human readable format: GMT: Mon, 14 Sep 2015 03:06:40 GMTThe date seems to be fairly accurate (probably off by a timezone), but the hour/minutes/seconds don't make sense. I am thinking that the MATLAB function has thrown away the HH:MM:SS and not performing the calculation. I don't think this is me...I also tried a different function for calculating time and got some issues. I used datenum(t) and it also forgets to add hours, minutes, seconds. Further out, I used datenum(t, formatIn) to try to force the timestamp format and the console gave me this error:datenum(t,'dd-mmm-yyyy HH:MM:SS')Error using datetime/datenumToo many input arguments.Can someone look into this? Thanks!", 'num_user_post': u' 11', 'author': u'fishmastaflex'}, {'date': u'September 14, 2015 - 3:47 pm', 'content': u"Hi,We'll look into this, and try to understand what's going on.  That said, in general, I'd strongly recommend working with the (reasonably new) datetime object, which understands timezones and has a wide array of functions for manipulating dates and times.  This is what ThingSpeakRead retuns.  Many of the plot functions natively understand it as well, and 'do the right thing' when you pass them in.More on datetime: http://www.mathworks.com/help/matlab/ref/datetime.html  and http://www.mathworks.com/help/matlab/date-and-time-operations-1.html-Rob", 'num_user_post': u' 47', 'author': u'Rob Purser'}, {'date': u'September 14, 2015 - 3:53 pm', 'content': u"Thanks Rob,Going a little bit off-topic here for my specific project, but how would you recommend me using the MATLAB trapz(x,y) function to look at the area under the curve of my data over time? Where X is my data and Y would be my datetime object that thingSpeakRead outputs. Obviously the trapz function doesn't take datetime objects. I tried that first thing which is why I started looking into changing my datetime value to epoch seconds. That is an easy number for MATLAB to calculate which is why I went that route.trapz, integral, integral2, intelgra3 functions don't take datetime objects. Damn!", 'num_user_post': u' 11', 'author': u'fishmastaflex'}, {'date': u'September 14, 2015 - 3:58 pm', 'content': u"Hi fishmastaflex,I tried this:x = datetime('now')y = posixtime(x)z = datetime(y,'ConvertFrom','posixtime')And got:x =   14-Sep-2015 15:52:32y =   1.4422e+09z =   14-Sep-2015 15:52:32Which is what I would expect....If you're trying to calculate elapsed seconds between two datetimes, just subtract them, which will give you a duration object, and you can convert that to seconds:>> elapsedTimeInDay = datetime('now') - datetime('today')elapsedTimeInDay =   15:57:09>> seconds(elapsedTimeInDay)ans =   5.7429e+04>> hours(elapsedTimeInDay)ans =   15.9526>> days(elapsedTimeInDay)ans =    0.6647", 'num_user_post': u' 47', 'author': u'Rob Purser'}, {'date': u'September 14, 2015 - 4:19 pm', 'content': u"Thank you for your help, Rob. I think I see what is going on here and my spirits have been lifted! I was using the console to double-check my work and did not realize that it wasn't outputting the entire double number in the console screen. The console keeps outputting: 1.4422e+09And I am expecting more decimal places: 1442245952I never tried: z = datetime(y,'ConvertFrom','posixtime') to read back as a datetime object. Not sure if you can increase the number of decimal places in the console screen. I would assume that somebody might run into a similar situation as I did and just assume. My mistake - sorry!", 'num_user_post': u' 11', 'author': u'fishmastaflex'}, {'date': u'September 14, 2015 - 4:47 pm', 'content': u"Hi fishmastaflex,That is a good point. I use the 'format long g' command to display the a number in a non-exponential format, i.e.,dt = datetime('now')format long gposixtime(dt) ans = 1442248971.20384- Adarsh", 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}, {'date': u'September 15, 2015 - 1:56 pm', 'content': u'Glad you figured out the console display thing.  MATLAB is generally optimized to print out matrixes, so it tends to choose terse display formats by default.  As Adarsh says, you can set the display format.On trapz, I broke my answer into a seperate topic on the forum so other people might see it:http://community.thingspeak.com/forum/matlab/solution-calculating-the-average-of-channel-with-uneven-timestamps-using-trapz/', 'num_user_post': u' 47', 'author': u'Rob Purser'}, {'date': u'September 15, 2015 - 3:31 pm', 'content': u'Good call, cheers!', 'num_user_post': u' 11', 'author': u'fishmastaflex'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/changing-graph-properties-for-matlab-visualizations/', 'posts': [{'date': u'September 6, 2015 - 5:49 pm', 'content': u'Hello,I just made this channel: https://thingspeak.com/channels/51914All nice and everything is working nice, but I would like to be able to:Define Xmin, Xmax, Ymin, Ymax for both thingSpeakPlot and thingSpeakScatterDefine graph width, for both thingSpeakPlot, and thingSpeakScatter.I would also be able to lock the graph, so the pointer can not change things like scales.Defining size of iframe does not lead to a bigger or wider graph for both matlab or regular field plots.Best Regards,C.A.', 'num_user_post': u' 1', 'author': u'altineller'}, {'date': u'September 8, 2015 - 3:27 pm', 'content': u'Hi, The channel and the custom visualizations you have created look great, thank you for sharing your channel. Thank you also for sharing feedback on features you would like to see with thingSpeakPlot, thingSpeakScatter, and the interactivity of the graph. We will consider adding this for a future version of these functions. One option for you to control the x-axis and y-axis limits and for creating a static plot for now would be to use the non-interactive MATLAB plotting functions: plot and scatter. For these functions you will be able to use xlim() and ylim() functions to define the axis scaling. You will be able to find additional help for these functions at the links below:Plot: http://www.mathworks.com/help/matlab/ref/plot.html?Scatter: http://www.mathworks.com/help/matlab/ref/scatter.html?Xlim: http://www.mathworks.com/help/matlab/ref/xlim.html?Ylim: http://www.mathworks.com/help/matlab/ref/ylim.html? Thanks,Adarsh', 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/delay-function-thingspeakwrite-into-same-channel-based-on-data-insertion/', 'posts': [{'date': u'August 31, 2015 - 8:58 am', 'content': u"Hi,Is there a way how to write data into the field of the same channel I am doing calculations from? Example - I would like to calculate dew point from temperature and humidity based in field 1 and 2 and write it to field3. If I do it using React app it gives me error because it's trying to perform 2 field writes in 1 second. I suppose a delay function would do the trick but it seems it is not supported. I also tried to use TimeControl to do calculations but it isn't really something I am satisfied with as it writes blank values in case there are no new data in fields 1 and 2. Any idea for a usable workaround?", 'num_user_post': u' 1', 'author': u'Vojta1'}, {'date': u'August 31, 2015 - 10:31 am', 'content': u'One approach is to write to a new channel.  Your MATLAB code could be set up to read field 1 and 2, perform your dew point calculation, and write to a new channel.  You could optionally perform a calculation such as mean or median on your original data and write them to the new channel too.  Note that since a channel stores time series data, each time you write one or more fields, a date and time is associated with each of the eight fields like this:Date and Time Stamp  Field 1Field 2Field 3Field 4Field 5Field 6Field 7Field 8time 1               TempHumiditynull         nullnull        null        null        nulltime 2                null        null        Dew Pointnull        null        null        null  nullwhich may not be what you expect.If you write to a new channel you could get something like this:Date and Time Stamp  Field 1        Field 2        Field 3        Field 4Field 5Field 6Field 7Field 8time x               Avg. TempAvg. HumidityDew Point  null        null        null        null        nullwhich may be closer to what you are looking for.', 'num_user_post': u' 4', 'author': u'Robert Mawrey'}]}]}, {'url': u'https://community.thingspeak.com/forum/matlab/page-8/', 'threads': [{'url': u'https://community.thingspeak.com/forum/matlab/request-error-bars/', 'posts': [{'date': u'August 24, 2015 - 3:30 pm', 'content': u"Hi,Would it be possible to add error bars to the data in a chart? I'd like to be able to plot the mean value of some sample data +/- one standard deviation on each point represented by an error bar... something like this for example:http://3.bp.blogspot.com/-aiPECwSj0VE/Uep8hsQ0qtI/AAAAAAAABN0/Iwv5Sv9OJ1I/s1600/error_bars_both.pngThanks!", 'num_user_post': u' 4', 'author': u'BMcC'}, {'date': u'August 25, 2015 - 7:59 am', 'content': u"Yes -- you can using the MATLAB errorbar plot.I'll try to post an example later, but here's the documentation:http://www.mathworks.com/help/matlab/ref/errorbar.html-Rob", 'num_user_post': u' 47', 'author': u'Rob Purser'}, {'date': u'August 25, 2015 - 3:07 pm', 'content': u"Hi Rob,Thank you for your reply. I'll have a look at the MATLAB link and see if I can figure out what I need to do \U0001f642Thanks!", 'num_user_post': u' 4', 'author': u'BMcC'}, {'date': u'August 25, 2015 - 3:54 pm', 'content': u"Hi again,Is it possible to create an error bar plot using  MATLAB Visualizations? I can't see an option using thingsSpeakPlot. If I try to use MATLAB Analysis and the errorbar(x,y,e) function I get an error that states..'Cannot use MATLAB visualization code 'bar(x,y,e)' in the MATLAB Analysis app. You must create a MATLAB Visualization.'", 'num_user_post': u' 4', 'author': u'BMcC'}, {'date': u'August 25, 2015 - 5:40 pm', 'content': u"That is correct, you can create an error bar plot using MATLAB Visualizations App. You will not be able to create an error bar plot in a MATLAB Analysis App. Create a new MATLAB Visualization App and select 'Custom (no starter code)' option from the Templates. Paste the below MATLAB Code in the new MATLAB Visualizations App to generate an example 'errorbar' plot.x = 0:pi/10:pi;y = sin(x);e = std(y)*ones(size(x));errorbar(x,y,e)", 'num_user_post': u' 62', 'author': u'Adarsh_Murthy'}, {'date': u'August 25, 2015 - 7:53 pm', 'content': u"Hi,I have an arduino that is contantly writing to ThinkSpeak to monitor the system intake performance.  Here's some code that I use to visualize the data associated with that.  You should be able to copy/paste this into a MATLAB Visualization verbatim.numHours = 6;[data,ts] = thingSpeakRead(52622,'readkey','P3DEWWFW89DVMUIY','NumMinutes',numHours*60,'Fields',1);% Create hour of day categories to summarize byhourOfDay = floor(hours(timeofday(ts)));% Apply the function max, min, mean, and standard deviation to each of the% hours in the daysumStats = table;sumStats.hour = unique(hourOfDay);sumStats.max = arrayfun(@(x)(max(data(hourOfDay == x))),sumStats.hour);sumStats.min = arrayfun(@(x)(min(data(hourOfDay == x))),sumStats.hour);sumStats.mean = arrayfun(@(x)(mean(data(hourOfDay == x))),sumStats.hour);sumStats.std = arrayfun(@(x)(std(data(hourOfDay == x))),sumStats.hour);errorbar(sumStats.hour, sumStats.mean,sumStats.std,'d-')hold onplot(sumStats.hour, sumStats.max ,'+',...    sumStats.hour, sumStats.min ,'+')hold off", 'num_user_post': u' 47', 'author': u'Rob Purser'}, {'date': u'August 26, 2015 - 2:43 pm', 'content': u"Thanks Rob - that's got it all working well now \U0001f642 Thank you!Thanks also Adash - makes sense now \U0001f642Cheers!Mean CO2 with Errors:https://thingspeak.com/channels/51602", 'num_user_post': u' 4', 'author': u'BMcC'}, {'date': u'August 26, 2015 - 9:24 pm', 'content': u'Looks awesome!  Thanks for sharing!-Rob', 'num_user_post': u' 47', 'author': u'Rob Purser'}]}, {'url': u'https://community.thingspeak.com/forum/matlab/sum-query-with-non-periodic-data/', 'posts': [{'date': u'August 25, 2015 - 9:49 am', 'content': u"HiI'm posting energy measurements to a channel feed that are not periodic, I mean, one hour there may be 10 values, but the next one there may be 50 or 100. The problem comes when I want to calculate daily totals, because something like this:api.thingspeak.com?sum=dailyreturns meaningless values. The reason is that sum simply adds all the values inside each day, and so days with a lot of measurements have higher values than days with fewer. Is there's some way to calculate a sum taking into account the 'distance' between measurements? Graphically speaking, I would need the area under the line chart, not just the sum of the values.", 'num_user_post': u' 1', 'author': u'jesjimher'}, {'date': u'August 25, 2015 - 8:10 pm', 'content': u"I have a similar channel.  You can do this in a MATLAB Analysis function:% Get the data[data,ts] = thingSpeakRead(32188,'NumMinutes',60);% Calculate the number of minutes for each value (the weight)weights = minutes(diff(ts));% Discard the last data point (because you don't know its weight)data(end) = [];% Need to use 'dot product' operator (.*), since MATLAB default is% 'cross product' operator.sum(data .* weights)", 'num_user_post': u' 47', 'author': u'Rob Purser'}]}]}]