{"url": "https://community.thingspeak.com/forum/mobile-apps/page-1/", "threads": [{"url": "https://community.thingspeak.com/forum/mobile-apps/help-with-sending-json-via-java-android/", "posts": [{"date": "February 19, 2018 - 10:31 am", "content": " I need to send an entire JSON to my channel on thingspeak, but I do not know how to do that. Just make use of the POST method?", "num_user_post": " 1", "author": "nedsons"}, {"date": "February 20, 2018 - 10:32 am", "content": "You can update a channel with GET or POST.  Have a look at the documentation for Write Data. You can send a JSON object to a single field, or you can write it to multiple fields.  Each field has a 255 character limit.  You may have to reformat your JSON object to get it in the correct format if you are writing multiple fields at once using this method.You can also update with many entries at the same time using the bulk write method for JSON data.", "num_user_post": " 401", "author": "cstapels"}, {"date": "April 23, 2018 - 8:00 pm", "content": "Here is a sample JSON POST to the update endpoint.POST /update.json HTTP/1.1Host: api.thingspeak.comContent-Type: application/json{'api_key': 'CHANNEL_WRITE_API_KEY','created_at': '18-04-23 23:25:21 +0200','field1': 'avalue','field3': 61,'field4': 52,'field5': 43,'latitude': '-4','longitude': '2.2','status': 'Perfect'}", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/mobile-apps/getting-last-entry-in-android/", "posts": [{"date": "March 28, 2017 - 10:25 pm", "content": "Hi,is there any documentation on how I can get the last data entry in a field to use in an android app?", "num_user_post": " 1", "author": "fonzikun"}, {"date": "March 29, 2017 - 10:56 pm", "content": "Take a look here:https://www.mathworks.com/help/thingspeak/get-a-channel-feed.htmlYou can also do something like this if you only want the last point in a certain channel:https://thingspeak.com/channels/9/feeds/last.jsonOr, for the last point in a certain field of a channel, you can do:https://thingspeak.com/channels/9/fields/1/last.json", "num_user_post": " 225", "author": "Vinod"}, {"date": "March 20, 2018 - 4:45 am", "content": "Have a look here https://play.google.com/store/apps/details?id=com.alex93savari.Pulsy_Thingspeak", "num_user_post": " 2", "author": "hedwig"}]}, {"url": "https://community.thingspeak.com/forum/mobile-apps/ios-access-to-thingspeak-data/", "posts": [{"date": "January 10, 2017 - 7:24 am", "content": "I love my ThingView app on my Android phone and use it to remotely monitor data graphically - works like a charm.  But now my wife wants to see the same thing on her iPhone - what are my options?   Thanks for any help/insight you can provide.", "num_user_post": " 2", "author": "valid8r"}, {"date": "January 10, 2017 - 9:59 pm", "content": "You could always open http://www.ThingSpeak.com on your iOS device.Another option is to follow the instructions here: https://www.igeeksblog.com/how-to-add-website-shorcuts-on-iphone-and-ipad-in-safari-ios-7/ to create a shortcut to the ThingSpeak channel and add it to your homescreen.", "num_user_post": " 225", "author": "Vinod"}, {"date": "January 11, 2017 - 6:34 am", "content": "Thanks Vinod.  While those are good workarounds, they certainly are not as 'nice' as having a dedicated app like the beautifully executed Android app Thingview.   Any chance someone is working on such a project?  Seems strange to me that this hasn't already been done and that more people are not asking for this? (just curious). Thanks again.", "num_user_post": " 2", "author": "valid8r"}, {"date": "January 11, 2017 - 7:48 am", "content": "Hi valid8r - I'm not aware of anyone working on an iOS version of the ThingView app or something similar. If you're into developing iOS apps this might be an interesting project for you If you think about it, an native iOS app may not be more preferable than a web app that accesses ThingSpeak for a number of reasons. For example, a badly written app can run in the background and drain your battery. Presumably Apple has made as many optimizations as possible to Safari to ensure low battery drain. More importantly, any app can only provide a subset of the functionality of the ThingSpeak website and you can get the full experience using the website directly.", "num_user_post": " 225", "author": "Vinod"}, {"date": "October 5, 2017 - 8:05 am", "content": "Hello I just released Thingview in the app store, it's a simple version, I'll be adding more features in the next monthsHere is the link https://itunes.apple.com/uy/app/thingview/id1284878579?mt=8", "num_user_post": " 11", "author": "mprolo"}, {"date": "November 13, 2017 - 11:26 am", "content": "mprolo said Hello I just released Thingview in the app store, it's a simple version, I'll be adding more features in the next months Here is the link https://itunes.apple.com/uy/app/thingview/id1284878579?mt=8  This would be perfect... if it would be running on iOS9.3.5 as well...so I can use it on an IPhone 4s as well.Any chance to make it available for iOS < iOS 10 ?That would be really cool!! (I have no idea how complicated my request is, though)", "num_user_post": " 1", "author": "espolli"}, {"date": "November 25, 2017 - 6:27 pm", "content": "Sorry, the minimum I can do is 10. (required by some components Im using)", "num_user_post": " 11", "author": "mprolo"}]}, {"url": "https://community.thingspeak.com/forum/mobile-apps/how-ibeacon-is-changing-the-global-online-retail-markets/", "posts": [{"date": "November 4, 2017 - 7:31 am", "content": "Released by Apple back in 2013, iBeacon gained considerable fame by the online retail industry and has even continued to gain additional momentum over the years. A team of expert researchers has just found that companies interested in online retailing are considering iBeacon as the next big revolution in the global online retailing segment based on its value-added features. A team of professionals from an iPhone app development company said that Apple has launched a number of applications that have considerably eased the lives of their end users but iBeacon has proved to be the one of its kind application that has totally revolutionized the area of online retailing. Businesses are now considering to invest more in this area as they have realized the true potential of increasing their revenue generation capabilities backed by iBeacon. Industry experts conclude that it is just the beginning and there are a number of new developments expected in the near future when it comes to iOS application development all over the world.", "num_user_post": " 2", "author": "rachelhobbss2"}]}, {"url": "https://community.thingspeak.com/forum/mobile-apps/gallery-vault-hide-your-pictures-and-videos/", "posts": [{"date": "November 2, 2017 - 11:37 pm", "content": "GalleryVault is a fantastic privacy protection app to easily hide and encrypt your photos, videos and any other files that you do not want others to see.  GalleryVault can hide its app icon and keep your privacy absolutely safe. You can import your private images and videos in this secure vault, and nobody knows the existence of it.  What's more, GalleryVault has the beautiful design, it provides you the smooth and amazing media browse experience.Photo Vault – Hide Photos & Videos is a photo vault app to lock photos and videos using PIN pad. With this gallery vault app, you can secure your private photos & videos! No one can snoop them without password. Main features: -Use PIN pad to access gallery vault -View locked photos and videos in the vault -Lock 200 photos & videos in total for basic version Photo Vault – Hide Photos & Videos Premium version: -Unlimited privacy space to store personal photos and videos -No annoying ads   https://itunes.apple.com/us/app/gallery-vault/id1289531259?mt=8", "num_user_post": " 1", "author": "AnnLi"}]}, {"url": "https://community.thingspeak.com/forum/mobile-apps/new-android-widget-thingspeak-monitor/", "posts": [{"date": "February 5, 2016 - 3:30 pm", "content": "Hello!I have developed and uploaded new Android Widget to Google Play - ThingSpeak Monitor!Try it: https://play.google.com/store/apps/details?id=ua.livi.thingspeakmonitorThingSpeak Monitor Widget will help you to be always up to date with current state of your Things connected to ThingSpeak service.Every instance of the widget will display last actual Field value of your Channel.The values will be refreshed automatically every 30 mins. You can refresh them immediately tapping any time at a widget center .Your Channel and Field name will be got from ThingSpeak. Just set your channel's ID!It is possible to monitor several Fields from different Channels in one screen in any possible combinations. Just create several instances of the widget!You can monitor Private Channels using Read API Keys.For Public chanels just leave Read API Key input line emty during configuration.So, it is quite simple!And Free!Try it!I'll be really appreciated for your feedback here or in Google play!", "num_user_post": " 33", "author": "Wilice K"}, {"date": "February 5, 2016 - 4:45 pm", "content": "Awesome! Thanks for sharing.", "num_user_post": " 402", "author": "Hans"}, {"date": "February 7, 2016 - 12:49 am", "content": "Exelent", "num_user_post": " 19", "author": "kniazio"}, {"date": "February 11, 2016 - 5:04 am", "content": "Nice work, thanks !I have small issue with widget refresh. Every time, when I add new widget, 'tap to refresh' function doesn't work at first time.After phone reboot it works perfect.", "num_user_post": " 13", "author": "0xFF"}, {"date": "February 11, 2016 - 1:09 pm", "content": "0xFF said Nice work, thanks !I have small issue with widget refresh. Every time, when I add new widget, 'tap to refresh' function doesn't work at first time.After phone reboot it works perfect.It is not so good, I'll try fix this issue.Thanks for your feedback!", "num_user_post": " 33", "author": "Wilice K"}, {"date": "March 2, 2016 - 5:04 pm", "content": "0xFF said Nice work, thanks !I have small issue with widget refresh. Every time, when I add new widget, 'tap to refresh' function doesn't work at first time.After phone reboot it works perfect.It has been recently fixed and published in Google Play (alredy available).Wait for the widget update from Google Play soon 🙂Additionly some cosmetisc updates has been performed to increase usage convenience.Just try it!", "num_user_post": " 33", "author": "Wilice K"}, {"date": "March 3, 2016 - 6:26 am", "content": "Great, can I have some future requests ? 😉I would like to have a option (checkboxes ?) to select data visibility:- chanel name [Y/N]- chanel ID [Y/N]- field description  [Y/N]- field number  [Y/N]- chanel update date  [Y/N]In my opinion, old caption  'chanel name' looked better than  new  concatenating 'chanel name' - 'chanel ID' 😉There is small issue on my device.I don't  know how to  insert picture. Here's link :https://lh3.googleusercontent.com/oFFgENgTWbj6ssQ4z3e__JhhBqaAuM5MkXfT1tyscP-2_OPUXHx9QsLRrgR5KmLsePKS2lgar6UW=w480-h854-noAs you can, when widget is scaled down, main value is not visible. Is this fixable ?Thanks again .", "num_user_post": " 13", "author": "0xFF"}, {"date": "March 3, 2016 - 4:11 pm", "content": "0xFF said Great, can I have some future requests ? 😉I would like to have a option (checkboxes ?) to select data visibility:- chanel name [Y/N]- chanel ID [Y/N]- field description  [Y/N]- field number  [Y/N]- chanel update date  [Y/N]In my opinion, old caption  'chanel name' looked better than  new  concatenating 'chanel name' - 'chanel ID' 😉There is small issue on my device.I don't  know how to  insert picture. Here's link :https://lh3.googleusercontent.com/oFFgENgTWbj6ssQ4z3e__JhhBqaAuM5MkXfT1tyscP-2_OPUXHx9QsLRrgR5KmLsePKS2lgar6UW=w480-h854-noAs you can, when widget is scaled down, main value is not visible. Is this fixable ?Thanks again .Thanks for your opinion!A part of your wishes has been implemented and already published. Check the following update 🙂Regarding 'scaling issue', unfortunately in scope of Android widget it is impossible to automatically adapt font size for parent layer size.So, the only possible way is to create one more option in conf screen. It is font size option for manual taloring.I will try this apprach when have time.And sure, new options to swith off displaying of Channel Name and Last Update Date will be tryed too.Have a nice day!", "num_user_post": " 33", "author": "Wilice K"}, {"date": "March 3, 2016 - 5:07 pm", "content": "Wow, really fast update  😉Thanks for your effort .", "num_user_post": " 13", "author": "0xFF"}, {"date": "March 6, 2016 - 4:15 am", "content": "New version 1.1.0 of the widget has just been released.New features:1. Now it is possible to change every widget's configuration any time when you need. Just tap at the right top corner of a widget at special new icon.2. Font size of Item value can be changed in a widget configuration screen to avoid some possible displaying issues.Try it and have a nice day! 🙂P.S. Unfortunately, Android Ice Cream Sandwich (ver. 4.0 - 4.0.4) is not supported any more. The lowest supported version is Jelly Bean (ver. 4.1).", "num_user_post": " 33", "author": "Wilice K"}, {"date": "March 6, 2016 - 1:37 pm", "content": "Cool, editing widget's configuration was my next wish 😉Adjustable font size is also nice feature.I'm on Android 6 (Cyanogenmod),  I don't care if you drop support fot ancient versions 😉Of course I have another wish 😉Is it possible to hide edit icon for normal view?  Something like 'auto hide'?  Visible for few second after tap? Visible after long press ?Thank you for your contribution, I gave you  ' * * * * * ' 😉", "num_user_post": " 13", "author": "0xFF"}, {"date": "March 6, 2016 - 3:55 pm", "content": "0xFF said Cool, editing widget's configuration was my next wish 😉Adjustable font size is also nice feature.I'm on Android 6 (Cyanogenmod),  I don't care if you drop support fot ancient versions 😉Of course I have another wish 😉Is it possible to hide edit icon for normal view?  Something like 'auto hide'?  Visible for few second after tap? Visible after long press ?Thank you for your contribution, I gave you  ' * * * * * ' 😉Thank you for your 5 stars in Google Play!It is strange but almost anyone, who use the widget, has done it 🙁To be continued...", "num_user_post": " 33", "author": "Wilice K"}, {"date": "March 16, 2016 - 4:15 pm", "content": "New release has been published!Ver. 1.1.2,  new features:1. Set update timeout feature has been implemented. Set different update timeouts for different widget instances.2. Upper third of the widget is fully tappable. Tap there to open configuration window.3. Middle and lower thirds of the widget are fully tappable too. Tap there to update widget manually.Next release's features (Ver. 1.1.4):1. Add a possibility to hide configuration icon2. Add a possibility to center Channel name", "num_user_post": " 33", "author": "Wilice K"}, {"date": "March 19, 2016 - 6:38 pm", "content": "Really good job:) That is it I was looking for, to fast check temp. since some time.. I know that for free I can't expect that you will spend all of your time for this app:) , but will be nice to have possibility to get some history after tap temp value.  I am using 4 widgets on screen with 4 ID's, will be good to can have one smaller with a few ID's just to put on main screen ( on the phone). 5 stars from me.", "num_user_post": " 9", "author": "m-blue"}, {"date": "March 20, 2016 - 2:58 pm", "content": "Wik said 1. Add a possibility to hide configuration icon2. Add a possibility to center Channel nameHow to hide icon? How to center?", "num_user_post": " 13", "author": "0xFF"}, {"date": "March 21, 2016 - 3:38 pm", "content": "0xFF said Wik said 1. Add a possibility to hide configuration icon2. Add a possibility to center Channel nameHow to hide icon? How to center?Keep calm, my friend!There was a mistake with previous verion number.It was formally the bug fix and should be numbered as 1.1.3.BTW, new version 1.1.6 with a possibility to hide configuration icon including automatically Channel name alignment has been released.Please wait for a notification from Google Play!There is one more thing, oxFF.Could you please check  Polish language translation in configuration screen?I suppose, I feel it but it should be checked by a native speaker.Is it correct? ", "num_user_post": " 33", "author": "Wilice K"}, {"date": "March 22, 2016 - 12:30 am", "content": "m-blue said Really good job:) That is it I was looking for, to fast check temp. since some time.. I know that for free I can't expect that you will spend all of your time for this app:) , but will be nice to have possibility to get some history after tap temp value.  I am using 4 widgets on screen with 4 ID's, will be good to can have one smaller with a few ID's just to put on main screen ( on the phone). 5 stars from me.A few IDs and history (charts)...I'm thinking about them... ", "num_user_post": " 33", "author": "Wilice K"}, {"date": "March 22, 2016 - 5:14 am", "content": "Wik said 0xFF said Wik said 1. Add a possibility to hide configuration icon2. Add a possibility to center Channel nameHow to hide icon? How to center?Keep calm, my friend!There was a mistake with previous verion number.It was formally the bug fix and should be numbered as 1.1.3.BTW, new version 1.1.6 with a possibility to hide configuration icon including automatically Channel name alignment has been released.Please wait for a notification from Google Play!There is one more thing, oxFF.Could you please check  Polish language translation in configuration screen?I suppose, I feel it but it should be checked by a native speaker.Is it correct? Oh, I see. After today's update everything is clear.Your polish is very good 😉Only few remarks:'API klucz do czytania' better will be 'Klucz API do odczytu''Odnowienie, min. 30' better will be 'Odświeżanie, min. 30' or even better 'Odświeżanie co 30 min.'", "num_user_post": " 13", "author": "0xFF"}, {"date": "March 22, 2016 - 9:08 am", "content": "Wik said m-blue said Really good job:) That is it I was looking for, to fast check temp. since some time.. I know that for free I can't expect that you will spend all of your time for this app:) , but will be nice to have possibility to get some history after tap temp value.  I am using 4 widgets on screen with 4 ID's, will be good to can have one smaller with a few ID's just to put on main screen ( on the phone). 5 stars from me.A few IDs and history (charts)...I'm thinking about them... I am waiting for update 🙂 and I'm agree with oxFF at Polish remarks 🙂", "num_user_post": " 9", "author": "m-blue"}, {"date": "March 22, 2016 - 7:40 pm", "content": "Be patient!It is coming...", "num_user_post": " 33", "author": "Wilice K"}]}, {"url": "https://community.thingspeak.com/forum/mobile-apps/thingview-new-android-application/", "posts": [{"date": "September 15, 2015 - 9:13 am", "content": "Hello everyone,I just uploaded an application to view the ThingSpeak channels in the android platform, check it out here https://play.google.com/store/apps/details?id=com.cinetica_tech.thingview", "num_user_post": " 11", "author": "mprolo"}, {"date": "September 28, 2015 - 2:09 pm", "content": "Would it be possible to do so to date (last) temperature was displayed in large font at the center of the chart as half transparent.At the moment it is a bit difficult to read.Regards", "num_user_post": " 19", "author": "kniazio"}, {"date": "October 20, 2015 - 2:55 pm", "content": "Hi, nice app! Great! Congratulations!Maybe could be nice to have some historical data view.", "num_user_post": " 63", "author": "vespapierre"}, {"date": "October 24, 2015 - 3:13 pm", "content": "Yes, I totally agree with you, I will add this functionality as soon as I have some free time.", "num_user_post": " 11", "author": "mprolo"}, {"date": "November 5, 2015 - 1:14 am", "content": "Gave you a 5 star on play store. This is a great app and hasn't crashed on me once on either my samsung or acer devices.   ", "num_user_post": " 19", "author": "BSB"}, {"date": "December 21, 2015 - 7:01 am", "content": "Hi, nice app.Can you add auto refresh and gauage?", "num_user_post": " 2", "author": "skydesign"}, {"date": "April 18, 2016 - 7:45 pm", "content": "THINGVIEW is a quality Android app with excellent support from the author.  The current iteration of ThingView provides an accurate  visualization of you ThingSpeak channel's 'public view'. I have both views running on my Android device and have found one glitch with multi-day visualizations of my 'private channel'. The author has indicated he is working on an update to make 'private view' better.In my opinion, ThingView is a best-of-breed app for visualizing my public channel 90870. With a simple Arudino sketch (50+ instructions), a Ethernet Shield, a pulse output water meter (sub-meter in my case) and a hardware debounce circuit... my channel is updated every minute with a water flow count. Zero if no flow and a total flow month-to-date.No more $500 water bills for me!", "num_user_post": " 8", "author": "wheato22"}, {"date": "April 19, 2016 - 1:35 am", "content": "Wow. Nice. Good app.", "num_user_post": " 2", "author": "Ron24B"}, {"date": "June 23, 2016 - 8:20 am", "content": "This is a great app.I have both views running on my Android device and have found one glitch with multi-day visualizations of my 'private channel'. At the moment it is a bit difficult to read. maybe could be nice to have some historical data view", "num_user_post": " 3", "author": "jenifferhomes"}, {"date": "June 29, 2016 - 6:02 pm", "content": "Hi , if you want some help with your channel email me your channel ID and   a read API key to mprolo at gmail. What do you mean with one glitch ? if you can explain your problem a little more I'll be glad to help you out.If you are interested in historical data view, this functionality is available in the paid version, check it out herehttps://play.google.com/store/apps/details?id=com.cinetica_tech.thingview.full You can check any period of time and compare it with another given period.Cheers,Marcelo.", "num_user_post": " 11", "author": "mprolo"}, {"date": "November 15, 2016 - 1:58 pm", "content": "I found a small bug.  When the data being plotted is all negative numbers, the 'Max' displayed will always be 0.  [Image Can Not Be Found]", "num_user_post": " 4", "author": "lover50"}, {"date": "November 15, 2016 - 6:12 pm", "content": "Hi lover50, thanks for pointing out this bug, I've just discovered that Float.MIN_VALUE is a positive number in java, that was the cause.I've just uploaded the bug fix. It will be available in a few minutes.Thank you.", "num_user_post": " 11", "author": "mprolo"}, {"date": "November 17, 2016 - 12:11 pm", "content": "      Thank you! ", "num_user_post": " 4", "author": "lover50"}, {"date": "August 30, 2017 - 4:40 pm", "content": "A found a small bug when I moved to my new phone (a Galaxy S8).  The first picture is on my old phone (LG G4) and the 2nd is the S8. Basically, the negative number seems to overflow the field width and end up wrapping onto the next line: It does bring up another question: how do I change the color it uses for the graph?", "num_user_post": " 4", "author": "lover50"}, {"date": "October 11, 2017 - 9:34 pm", "content": "Hi, I'm not sure if I understand what is your problem, you mean the box with the : value, date etc is out of the screen?If the channel is public the color is taken from your configuration in thingspeak, if it's private it should use red.", "num_user_post": " 11", "author": "mprolo"}]}, {"url": "https://community.thingspeak.com/forum/mobile-apps/thingspeak-data-monitor-on-android-app/", "posts": [{"date": "June 8, 2015 - 8:13 pm", "content": "App on Google Play.https://play.google.com/store/apps/details?id=iot.sensor.data.monitorMore Info on Blog.http://androidcontrol.blogspot.com/2015/06/android-iot-thingspeak-data-monitor.html", "num_user_post": " 3", "author": "androidcontrol"}, {"date": "October 8, 2017 - 9:13 am", "content": "Works well, but limited functionality so far Pretty basic at the moment, I'm looking forward to what you come up with in the future.", "num_user_post": " 4", "author": "ellivna"}]}, {"url": "https://community.thingspeak.com/forum/mobile-apps/help-me-to-protect-my-kid/", "posts": [{"date": "September 19, 2017 - 11:38 pm", "content": "Hi all, I am desperately in need of help with my daughter. Recently she’s been very disobedient towards me and my husband, she would yell back at us if something we said upset her; sometimes she would even push or throw stuffs on the floor in front of our faces! The other day I was able to spy on her phone. She has been texting with some strange people and seems they’ve met several times too! I and my husband are very worried, we’d tried talking some sense into her but it was pointless and often ended with her storming out. I fear she might be hanging out with wrong types of people but there is no way for us to find out!My friend recommed me two spy apps name Mobiispy and spyapp247 and everyone pls help me to find out which one is better.Many thanks", "num_user_post": " 1", "author": "wayari"}]}, {"url": "https://community.thingspeak.com/forum/mobile-apps/login-with-app/", "posts": [{"date": "August 22, 2017 - 6:55 am", "content": "Hi everyone, i just started to code an app, which allows me to handle my channels and feeds with the thingspeak api. creating channels and feeds isnt that hard, but i also need my user api key, i know i can get it from my profile, but i want my app to get it.i looked up the code fromhttps://thingspeak.com/loginand tried to get all informations to login without original thingspeak site, i just got this:https://thingspeak.com/users/sign_in&utf8=%E2%9C%93&authenticity_token=ejO5hG4yjznTIPqLMnRVUdVQZ1GunMusmCH5I9EJLtw=&user[login]=myemail%40adress.com&user[password]=mypassword&commit=Sign+Inif you see the source code of the login site, there is given the authenticity_token from the TS site but always i try to login this way (by URL), it says 'Sorry, that user cannot be found.' -i dont realy get why -im not that approved in coding -> plz can someone give me a hint to get this run? greetings, hilgi", "num_user_post": " 3", "author": "hilgi"}, {"date": "August 22, 2017 - 2:21 pm", "content": "Hilgi,Can you describe more about your application?  Almost all the data you store in ThingSpeak can be obtained via MQTT broker or API calls.  There is no way to obtain the API key(s) without logging in.", "num_user_post": " 401", "author": "cstapels"}, {"date": "August 25, 2017 - 5:14 pm", "content": "hi cstapels this app can be used to control your electricity consumption, gas, water whatever.much people dont know much about iot or smth else, but want to use new technologies,so my app must be able to make the registration,login, create a channel, create a (multi)chartand so on automaticly. creating channel and chart isnt that hard, but to register and login is the prob.the web component saves the first cookie on thingspeak.com/login and i now know hot to get thetoken and how to send it and send the login data with post by ai2 web component, but by sending this datau will be redirected to /sign_in where u get a new cookie, which u need to hand it to next redirection /mwa_linking,but this cookie the web component doenst 'take' or 'get' or whatever after changing the code the 'Sorry, that user cannot be found.' thing is gone and i can see by Packet Capture, thatthe app follows the same way like the browser do, but as i can see too, the cookie isnt set at first redirection. so how to handle this?im just triying this extensoin: WebViewTools Extension, maybe i can MacGyver that problem 😉 greets and thanks for any ideahilgi", "num_user_post": " 3", "author": "hilgi"}, {"date": "August 28, 2017 - 9:51 am", "content": "Hi, i had success... 🙂 Maybe it is possible to do it as i wanted it to do, but i found another solution. 1) use the webviewer component to open site and to login2) use WebViewCookieTools - Extension to read the webviewer given cookie3) hand over the cookie to the web component and open site now i can open the sites i need and pick out the data i need by responsecontent it works in my case and so my problem got solved so far 😛 thanks for any idea,greetz hilgi", "num_user_post": " 3", "author": "hilgi"}]}, {"url": "https://community.thingspeak.com/forum/mobile-apps/widget-for-smart-watch-samsung-gear-s2/", "posts": [{"date": "April 30, 2016 - 1:33 pm", "content": "Hello community!As you, may be, know Samsung created absolutely new smart watch platform last year.The first representative of this new smart watch family is Gear S2.For now a lot of various apps have been created and available in Galaxy Apps store for Gear S2.The watch is really amazing but unfortunately there is no app for Thingspeak. It is sadness...So, is there at least one person here who really interested to have Thingspeak data representation on his wirst?Has someone got any thoughts about this suff?", "num_user_post": " 33", "author": "Wilice K"}, {"date": "July 4, 2017 - 7:17 pm", "content": "Hi, I just purchased a Gear S3 and would very much like to have data from Thingspeak on my wrist, have you made any progress with this or found any solution?", "num_user_post": " 1", "author": "Joel"}]}, {"url": "https://community.thingspeak.com/forum/mobile-apps/mobile-and-web-developer/", "posts": [{"date": "October 7, 2016 - 8:46 am", "content": "Hey there, we are small team of experts in web and mobile development who is focusing business to solve their problems in IT field like create service, website, mobile application, fix bugs on your current site/application, add new features and much more that we can do. Win-win is our main principle, you can try us risk free - we don’t take any upfront payment. Let’s have a quick talk about your needs - skype: dark_gf, or email me Ev@bigheadone.com", "num_user_post": " 1", "author": "evgeny_bigheadone"}, {"date": "June 4, 2017 - 8:23 am", "content": "I want to create a mobile recorder ( https://mobilerecorder24.com/ ), what i can do? ", "num_user_post": " 9", "author": "vondes"}, {"date": "June 5, 2017 - 6:41 am", "content": "", "num_user_post": " 1", "author": "josephlowry"}]}]}