{"url": "https://community.thingspeak.com/forum/mobile-apps/page-2/", "threads": [{"url": "https://community.thingspeak.com/forum/mobile-apps/mit-app-invetor-2/", "posts": [{"date": "February 20, 2017 - 3:51 am", "content": "Hello everyone,i have a question.Is it possible the last send Data from my channel to make it visible on my phone.I know there are many apps, but i want to make my own for my school project (simple).I send sensordata from my arduino + gsm to my channel.i hope you can help me!?THANK YOU!", "num_user_post": " 2", "author": "ic3m4n"}, {"date": "February 20, 2017 - 7:29 am", "content": "I'm not familiar with the MIT App Inventor, so I cannot comment on that specifically.In general, If you are building an app you can use ThingSpeak's RESTful API to query for points on the channels and display it on your app. For example, to get the most current data from channel 9 of ThingSpeak, you can do this:https://api.thingspeak.com/channels/9/feed/last.jsonYour app will need to make the RESTful call and parse the field value to display the current value.", "num_user_post": " 225", "author": "Vinod"}, {"date": "February 20, 2017 - 8:41 am", "content": "Thanks for the reply, what is a RESTful API ?", "num_user_post": " 2", "author": "ic3m4n"}, {"date": "February 20, 2017 - 9:19 am", "content": "When Web services use REST architecture, they are called RESTful APIs (Application Programming Interfaces). You can read up more about REST here:https://en.wikipedia.org/wiki/Representational_state_transfer", "num_user_post": " 225", "author": "Vinod"}, {"date": "February 21, 2017 - 1:37 pm", "content": "ic3m4n said Hello everyone, i have a question. Is it possible the last send Data from my channel to make it visible on my phone. I know there are many apps, but i want to make my own for my school project (simple). I send sensordata from my arduino + gsm to my channel. i hope you can help me!? THANK YOU!  It is actually quite easy to build an MIT App Inventor App to display ThingSpeak data.  Please see the following post on my blog for an example of how to do this: http://www.mawrey.com/simple-thingspeak-viewer-app-using-mit-app-inventor-2/", "num_user_post": " 4", "author": "Robert Mawrey"}]}, {"url": "https://community.thingspeak.com/forum/mobile-apps/eclipse-get-data-with-thingspeak/", "posts": [{"date": "September 7, 2016 - 2:54 am", "content": "I don't understand how to get data from thingspeak using the eclipse android? How to retrieve data with fire and channel are there?", "num_user_post": " 1", "author": "Dhan"}]}, {"url": "https://community.thingspeak.com/forum/mobile-apps/question-on-an-mobile-app/", "posts": [{"date": "August 31, 2016 - 11:41 am", "content": "Hi guys !I got a question , what i want to do is use and arduino board to send data to thinkspeak, but also i want to create a mobile app to see the latest data send and also givelike a link to the main page of thinkspeak and see all the historicall data. I was thinking on develop the app using processing but i dont know if is the best option, or if i will be able to do what i want to do ? Some advices ?", "num_user_post": " 1", "author": "azlardo"}]}, {"url": "https://community.thingspeak.com/forum/mobile-apps/new-android-aplication-domote/", "posts": [{"date": "May 31, 2016 - 6:22 am", "content": "Hi!!I just uploaded  in Google Play my Android app called Domote.https://play.google.com/store/apps/details?id=com.vicibadesign.micasapp This application allows manage the Thingspeak fields in diferent Rooms, for simpler way of viewing.But, Domote is not only a viewer, it is posible to create Alerts and Notifications with conditions, that will be thrown if the fields fullfil the conditions.Another feature of Domote is the Buttons creation, this feature in combination with ThingHTTP allows modify some parameters the system.Finally, the last feature is the Voice Commands, with it Domote can tell you the room state or press a button only with a few words. Nothing else, I am still developing this application, but here is the first version.I welcome your coments and wish you like it. Regards! ", "num_user_post": " 3", "author": "viciba"}, {"date": "June 10, 2016 - 5:24 pm", "content": "It looks nice, but why does it have some of these permissions?  I don't see what they are needed for.  Record audio?  Disconnect from wifi? Photos/Media/Filesread the contents of your USB storageStorageread the contents of your USB storageMicrophonerecord audioWi-Fi connection informationview Wi-Fi connections Other connect and disconnect from Wi-Fi", "num_user_post": " 4", "author": "lover50"}, {"date": "June 16, 2016 - 10:02 am", "content": "lover50 said It looks nice, but why does it have some of these permissions?  I don't see what they are needed for.  Record audio?  Disconnect from wifi?  Photos/Media/Filesread the contents of your USB storageStorageread the contents of your USB storageMicrophonerecord audioWi-Fi connection informationview Wi-Fi connections Other connect and disconnect from Wi-Fi    Thank you very much 🙂It's simple:Photo/Media files: Are requiered to choose a picture for the room, as you can see in the captures of the main menu, every room is shown with this photos.Wifi connection: in the alerts and alarms section, every alarm is defined as a condition and events combination. There are 3 types of condition, one of them is Conectivity. With this type, you can program, for example if your are connected or disconnected to a specified wifi network (For example your home network), following this, Domote can check if you are in you home not. That's why Domote requiered wifi connection information.The microphone is necessary to use the voice asistant. You can say for example 'Show me the temperature graph', and Domote will show it.And finally, storage is used to save the user configuration.That's all, again thank you very much for your interestRegards!", "num_user_post": " 3", "author": "viciba"}, {"date": "June 19, 2016 - 4:58 pm", "content": "It spent few minutes trying to login before I discovered my channel needs to be public...Why there is no information about channels settings requirements?Finally why do I have to publish my channel? ", "num_user_post": " 13", "author": "0xFF"}, {"date": "June 21, 2016 - 3:02 pm", "content": "0xFF said It spent few minutes trying to login before I discovered my channel needs to be public... Why there is no information about channels settings requirements? Finally why do I have to publish my channel?   Hi!Thank you very much for your coment.It's not necessary make your channels public. At the begining in the loggin screen, you only have to have to insert your UserName in Thingspeak, and your user apikey.To get this user apikey, you have to go to 'Account/My Account' section in Thingspeak website, once you are there, you only have to copy the apikey shown, and paste it in Domote. I attach a capture of 'Account/My Account' section. Captura 1With this information, Domote will get and show in the next screen your channels defined in your thingspeak account (public or not). If this channels are public, Domote will show every field defined in the channel. If it is not, domote will show a textbox to insert the Read apikey of the channel.I hope it could be helpfull.Thank you very much again for your comment, it makes me take note where improve the next version of the app.Regards!", "num_user_post": " 3", "author": "viciba"}, {"date": "June 22, 2016 - 3:06 pm", "content": "Thanks for explanation. That's clear now. I tried to put Channel Apikey instead of Account Apikey.So, there is my first suggestion - please put Account API Key hint in login form 😉Second thing: System Parameters form - lacks translation.Best regards 😉", "num_user_post": " 13", "author": "0xFF"}]}, {"url": "https://community.thingspeak.com/forum/mobile-apps/thingspeak-get-last-feed-entry-based-on-feed-id-android-app/", "posts": [{"date": "November 18, 2014 - 5:38 am", "content": "Hi Thingspeakers,here is a simple, really basic Android application to get the last entry of your feed ( will need to input your channel ID ). This comes from the JSON format of get feed, and will give back the datetime, and value of 8 fields.Feel free to use!https://www.dropbox.com/s/2swh2ozrfz4el3a/ThingspeakLastEntry.apk?dl=0", "num_user_post": " 63", "author": "vespapierre"}, {"date": "July 31, 2015 - 12:08 pm", "content": "its a good app. but see this one with alarm functionality and many other features....https://www.youtube.com/watch?v=PeeTdZXMWvA", "num_user_post": " 5", "author": "Infinity"}]}, {"url": "https://community.thingspeak.com/forum/mobile-apps/android-app-thinkspeak-with-alarm-functionality/", "posts": [{"date": "July 31, 2015 - 12:04 pm", "content": "This is one of the latest app. for Thingspeak channel with Alarm functionality. quite cool features. Eagerly waiting for its new version with more features..https://www.youtube.com/watch?v=PeeTdZXMWvA", "num_user_post": " 5", "author": "Infinity"}]}, {"url": "https://community.thingspeak.com/forum/mobile-apps/thingspeak-control-devices-android-app/", "posts": [{"date": "June 11, 2015 - 10:52 pm", "content": "App on Google Play https://play.google.com/store/apps/details?id=iot.arduino.controlHardwareArduino + ESP8266 WiFi ModuleWiring Diagram , Arduino Code http://androidcontrol.blogspot.com/2015/06/android-iot-control-thingspeak.html", "num_user_post": " 3", "author": "androidcontrol"}, {"date": "June 12, 2015 - 8:41 am", "content": "Hi,Nice project, thanks for providing the videos and diagrams!  Are you making frequent calls every 1 (or 5) seconds to the API to get the last data, and then reacting on that data?lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/mobile-apps/android-app-project-thingspeak-unofficial/", "posts": [{"date": "May 22, 2015 - 2:41 am", "content": "Hi!I'm an Android Developer and I'm using ThingSpeak some time now...I'm interested in making an Android App for the Play Store with many features including:* Material Design* Channels and Feeds monitoring (Last time values, List of old entries)* Graphs* Real-time notifications on your smartphone when a feed value meets a specific condition.I plan to sell the app on the Play Store sometime soon...Raise your hand if you're interested!Amedeo,https://play.google.com/store/apps/developer?id=Amedeo+Arch", "num_user_post": " 1", "author": "ingamedeo"}]}, {"url": "https://community.thingspeak.com/forum/mobile-apps/ios-app-to-thingspeak-talkback/", "posts": [{"date": "March 29, 2015 - 10:50 am", "content": "I am currently trying to develop an iPhone app which has buttons to update my talkback commands using nsurl in swift. Just wondering if  anyone else has done this and if they have would you mind sharing your code?", "num_user_post": " 1", "author": "burgchevap"}]}, {"url": "https://community.thingspeak.com/forum/mobile-apps/http-headers/", "posts": [{"date": "May 24, 2014 - 6:40 am", "content": "I notice you now have a new parameter to minimise the number of HTTP headers being sent. Could you please give me an idea of how much data this saves per get request. Just thinking mobile data plans? Thanks", "num_user_post": " 54", "author": "chrisjmears"}, {"date": "May 24, 2014 - 7:57 pm", "content": "Hi,I tested this with one of my Channels, and got the following results:For a Channel update request, the HTTP response went from 517 bytes to 293 bytes (43% less).For a Channel get last value request, the HTTP response went from 588 bytes to 364 bytes (38% less).lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/mobile-apps/offset-sometimes-being-ignored/", "posts": [{"date": "April 17, 2014 - 6:21 am", "content": "Ive noticed if I repeated use the same urlhttps://api.thingspeak.com/channels/5384/feed/last.json?&status=true&offset=1most of the time it will report the time with the offsett{'created_at':'2014-04-17T11:17:15+01:00',.....etcbut if you keep doing it, you often get times returned with no offset{'created_at':'2014-04-17T10:17:15Z',......etcThese are throwing my app as I am relying on having accurate times returned with the offsett.This seems to be recreatable. Just paste in the url above and fire it off. Arond every 9th or 10th call to it will drop the offset", "num_user_post": " 54", "author": "chrisjmears"}, {"date": "April 17, 2014 - 5:49 pm", "content": "Hi,We've just implemented a fix for this, can you verify that it's working properly for you now?lee", "num_user_post": " 457", "author": "lee"}, {"date": "April 18, 2014 - 4:21 am", "content": "I will test it. Previously utc was showing 1 hour behind GMAT (we are in British summertime now) so I was correcting for that with offset =1. Since your fix the raw utc feed now seems to match gmt. Is this intentional. I.e previously was utc wrong or is it now wrong?", "num_user_post": " 54", "author": "chrisjmears"}, {"date": "April 18, 2014 - 10:49 am", "content": "Yes that fix was intentionally added in too, so that the offset correctly matches the description: 'Offset of your timezone without daylight savings time'.lee", "num_user_post": " 457", "author": "lee"}, {"date": "April 23, 2014 - 3:31 am", "content": "Still a bit of a bug. just grabbing the last.json correctly gives the time as utc. i.e 7.29am however if I add offset=1 I'd expect to get back the utc + 1 hour. i.e 8.29. what I get is 9:29It seems to be treating an offset of 1 as an offset of 2Probably just a very minor bug somewhere in the code but a fix would be appreciated?", "num_user_post": " 54", "author": "chrisjmears"}, {"date": "April 23, 2014 - 11:16 am", "content": "Hi,If the offset is set to +1 (let's call it Berlin time), then daylight savings time is applied during part of the year (including now) to get an offset of +2 for the current time zone offset: http://www.timeanddate.com/worldclock/city.html?n=37lee", "num_user_post": " 457", "author": "lee"}, {"date": "April 23, 2014 - 1:21 pm", "content": "Hi lee. I still have the problem. Say it's 8:21am in the uk (British summertime) f I don't specify an offset it gives 7:21am if I apply offset=1 it gives. 9:29am. I can't figure how to get 8:21am", "num_user_post": " 54", "author": "chrisjmears"}, {"date": "April 23, 2014 - 7:17 pm", "content": "Hi Chris,We are currently working on this problem, as we're now noticing subtle inconsistencies in our implementation of the 'offset' parameter as you've pointed out.  I'll post back here when we have a final solution.lee", "num_user_post": " 457", "author": "lee"}, {"date": "April 25, 2014 - 2:57 pm", "content": "Hi Chris,We've made some changes to the way offset works.  Offset no longer has a direct correlation with time zones, and will output the results in whatever offset is specified.  For example, an offset of '-5' will always output feeds with a timestamp that includes '-5', regardless of daylight savings time.We introduced a new parameter called 'timezone' that ensures proper time zone transformation; you'll probably want to use this parameter since it's much more accurate and automatically handles any daylight savings time issues.Here's the changes to the parameters: https://thingspeak.com/docs/channels#get_feed , and here's the relevant time zone documentation: https://thingspeak.com/docs#timezones .lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/mobile-apps/request-for-change-to-talkback/", "posts": [{"date": "April 10, 2014 - 11:51 am", "content": "Hi,Im developing for iOS/Android using ajax.It seems iOS 6 & 7 still have a nasty bug called the long polling bug. basically when I use an $.delete ( I extend ajax to do this ) the UI spinner at the top of the screen never stops spinning.$.get works fineIs it possible to have all the talkback functions support standard get requests to work around this horrible iOS bug.", "num_user_post": " 54", "author": "chrisjmears"}, {"date": "April 11, 2014 - 2:10 am", "content": "Hi,Unfortunately we're unlikely to do this, since it would conflict with existing Rails routes and break the RESTful design of TalkBack.lee", "num_user_post": " 457", "author": "lee"}]}]}