{"url": "https://community.thingspeak.com/forum/other/page-2/", "threads": [{"url": "https://community.thingspeak.com/forum/other/wio-link-seeedstudio-integration-posible/", "posts": [{"date": "April 21, 2016 - 6:54 am", "content": "I recently received the Wio Link from a Kickstarter-backed project from SeeedStudio.The board is based on ESP8266 and has grove connectors. Can we integrate it on the  ThingSpeak platform?i have done it with initialstate+ifttt probably the same can happen with ThingSpeak.(probably by arduino+python method?) Please comment on that.Thanks!", "num_user_post": " 1", "author": "vagelis"}]}, {"url": "https://community.thingspeak.com/forum/other/cai-webcontrol-sending-temperature-data-to-thingspeak-channel-problem/", "posts": [{"date": "February 7, 2016 - 4:28 pm", "content": "I am trying to send temperature data from a CAI WebControl 8 to my channel on Thingspeak. I can manually send the data with an http command and it shows up on the graph but I can't get the processor to do it. Is anyone famaliar with this processor and can give me help with setting up the commands in the WC8. I have read all the examples I can find but am missing some key point.Thanks, for any help.", "num_user_post": " 1", "author": "smmaxxx"}]}, {"url": "https://community.thingspeak.com/forum/other/just-a-pc-and-serial-from-microcontroller-solved/", "posts": [{"date": "December 8, 2015 - 6:16 am", "content": "hello folks,here it is  : a no special hardware solution,any microcontroller with a serial port can be used, all you need is an online  windows PCrunning this little program:http://webx.dk/COMMAIL/index.htmif you want to see my little aquarium monitor page, made using this stuff have a look herehttp://webx.dk/ak/oh did I mention, this pc program commail can also send EMAILS !!very usefull for urgent alarm notifications,as far is a found out ThingSpeak do not support emails, only twitter, I do not know what that is.", "num_user_post": " 24", "author": "OZ2CPU"}, {"date": "December 9, 2015 - 6:17 pm", "content": "It is true that Thingspeak cannot send emails however you can now use ThingHTTP to send emails (or other notifications) via the IFTTT maker channel (https://ifttt.com/maker).  Its an option if you dont want to run your PC all day and all night.", "num_user_post": " 271", "author": "rw950431"}, {"date": "December 10, 2015 - 5:02 pm", "content": "I need my little tiny PC anyways on and online, for other stuff,else this way to push data to thingspeak would have been a silly way, due to power consumption.but now it is here, and on.. why not just use it and be happy 🙂it is by far the mosy easy way, I have seen so far.", "num_user_post": " 24", "author": "OZ2CPU"}]}, {"url": "https://community.thingspeak.com/forum/other/xig-settings-for-proxy-server/", "posts": [{"date": "August 27, 2013 - 2:49 am", "content": "Please help. I am using a Connectport x2 running xig as a gateway. On my Arduino I am using the API command as explain in the Thingspeak tutorial. On my home network it works. At work the problem is that we use a proxy server and dedicated port. What commands do I need to send to the Connectport or is there a setting which I need to change?", "num_user_post": " 1", "author": "ddevilliers"}]}, {"url": "https://community.thingspeak.com/forum/other/netduino-2-field-update/", "posts": [{"date": "January 7, 2013 - 9:46 am", "content": "Hi ,I am a newby having a problem.I try to update more than one field on a  channel  on Things peak.I am using this String 'field1=' + Temp1 &  'field2=' + Temp2);Visual C# does come up with the folowing error :  Operator & can not be applied to operands of type string .One field is working fine.Is there an other way of updating  more then one field?I could not find anything in the Netduino tutorials.Thanks.", "num_user_post": " 1", "author": "boomer55"}, {"date": "January 13, 2013 - 4:41 am", "content": "Hi! I do not have any experience with netduino, but i think the solution is: 'field1=' + Temp1 + '&field2=' + Temp2); Michael", "num_user_post": " 3", "author": "mik"}]}, {"url": "https://community.thingspeak.com/forum/other/%ce%bcplibrary-%e2%80%93-net-micro-framework-client/", "posts": [{"date": "November 26, 2012 - 12:25 pm", "content": ".NET Micro Framework Developer [paolopat] created a client for the ThingSpeak platform. This allows any device that supports the .NET Micro Framework to access ThingSpeak web services by using the μPLibrary 1.8. The library is available on NuGet Gallery and abstracts the ThingSpeak API. The library works with the popular Netduino Plus and other devices running .NET Micro Framework.", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/other/netduino-tutorial-giving-back-408-errors/", "posts": [{"date": "February 5, 2012 - 3:19 pm", "content": "I'm playing around with the Netduino tutorial, and I'm so close, but I can't see what I'm doing wrong.I form up the POST and then send it off:POST /update HTTP/1.1Host: api.thingspeak.comConnection: closeX-THINGSPEAKAPIKEY: <my write key>Content-Type: application/x-www-form-urlencodedContent-Length: 14field1=300.627 And I always get back:HTTP/1.0 408 Request Time-outCache-Control: no-cacheConnection: closeContent-Type: text/html<html><body><h1>408 Request Time-out</h1>Your browser didn't send a complete request in time.</body></html>I really can't see what's going wrong. I'm using the tutorial cut & paste and I get the response back from the API well before the timeout.What am I missing?", "num_user_post": " 8", "author": "H07R0D"}, {"date": "February 5, 2012 - 4:52 pm", "content": "Can you ping 'api.thingspeak.com' on the same network and let us know what IP address that you are getting back?We don't issue a 408 error code. I am wondering if you are pointing to a different IP address?", "num_user_post": " 402", "author": "Hans"}, {"date": "February 5, 2012 - 9:38 pm", "content": "Turns out I'm just a newb....I was using http://www.thingspeak.com as the DNS lookup instead of the API IP address, so I think I was sending an API POST header to the main web server, hence the weird responses.Sorry about that, I'm able to post data now.", "num_user_post": " 8", "author": "H07R0D"}]}, {"url": "https://community.thingspeak.com/forum/other/xig-v1-3-2-release/", "posts": [{"date": "December 15, 2011 - 12:00 pm", "content": "From master inventor, Jordan Husney:We just fixed a bug where URLs longer than 72 characters were getting mangled.Some folks were using the packetization timeout (RO) parameter as a work around but this is no longer necessary.Have a look at the XIG v1.3.2 release: http://code.google.com/p/xig/JordanThis fixes the issue that some users were reporting about using the ConnectPort with ThingSpeak, updating Twitter via ThingTweet, and inserting data into a ThingSpeak Channel. Thanks for the update!", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/other/create-your-own-web-of-things-using-the-netduino-plus-and-thingspeak/", "posts": [{"date": "February 25, 2011 - 2:20 am", "content": "Getting Started with the Netduino PlusThe Netduino Plus is an Atmel 32-bit microcontroller development board that includes on-board Ethernet and USB. You create firmware using the Microsoft .NET Micro Framework, Visual C#, and Microsoft Visual Studio IDE. The board also has the same header foot print as the Arduino, so the board makes use of the many Arduino Shields available.Setting up the Programming EnvironmentInstall Microsoft Visual C# Express 2010Install .NET Micro Framework SDK v4.1Install Netduino SDK v4.1.0 (32-bit) or Netduino SDK v4.1.0 (64-bit)Visit netduino.com for the most current downloads and support optionsSetting the IP Address of the Netduino PlusConnect the Netduino Plus with a micro-USB cableOpen the .NET Micro Framework Tools folder under Program Files: C:Program FilesMicrosoft .NET Micro Frameworkv4.1ToolsDouble-click on the file 'MFDeploy.exe'Under Device, select USB and NetduinoPlus_NetduinoPlusClick Ping - if you recieve 'TinyCLR', then the Netduino Plus is connected properly to the PCFrom the navigation menu, select Target, Configuration, and Network to open the network settings pageEnter a unique Static IP address, Subnet Mask, and Default Gateway that are valid for your networkEnter a DNS Address (4.4.4.4 is a public DNS server)Connect an Ethernet cable to the Netduino Plus Creating a New Netduino Plus ProjectStart Visual StudioSelect New ProjectSelect Micro Framework under the Visual C# sectionSelect Netduino Plus ApplicationClick OKSetting up the Netduino Plus in Visual StudioConnect the Netduino Plus with a micro-USB cableUnder your project, right-click on Properties and select OpenSelect the .NET Micro Framework panelUnder Transport, select USBUnder Device, select NetduinoPlus_NetduinoPlus NotesYour program will be contained in the 'Program.cs' project fileTo build your program, press F6 (or select Debug, Build Solution)To deploy your program to the Netduino Plus, press F5 (or select Debug, Start Debugging)Connecting to ThingSpeakThe interface with the ThingSpeak API is either HTTP GET or HTTP POST. When the Netduino Plus is getting data from the API, use HTTP GET. When the Netduino Plus is sending data to the API, use HTTP POST. Download the ThingSpeakClient application for reference code on how to connect the Netduino Plus to ThingSpeak. The ThingSpeak API documentation can be found here. The ThingSpeakClient application highlights the following features:Reading analog inputs with a Netduino PlusBlinking the on-board LEDSending HTTP POST requestsUpdating a ThingSpeak Channel with sensor dataSending ThingSpeak status updatesConnecting a Light Sensor to the WebHere's a project demonstrating how to connect a light sensor to the web using the Netduino Plus and the ThingSpeak web service. Parts:Netduino PlusPhoto Resistor1k Ohm ResistorHookup WireBreadboardCircuit Diagram for Light Sensor (Photo Resistor):Project Photo:ThingSpeak Chart of Light Levels:Netduino Plus Project File:Click here to download the 'ThingSpeakClient' application for the Netduino Plus.Web Front-endHere's how you can take this project further with a design from shadowlord. You can create a web front-end using HTML, CSS, and jQuery to visualize your status updates from the Netduino.", "num_user_post": " 402", "author": "Hans"}]}]}