{"url": "https://community.thingspeak.com/forum/thingspeak-api/page-6/", "threads": [{"url": "https://community.thingspeak.com/forum/thingspeak-api/getting-0-values-in-my-temperature-data-plots/", "posts": [{"date": "August 1, 2017 - 8:41 pm", "content": "I am using an Adafruit thermocouple breakout board and a Particle Photon to transmit temperature data to a plot on my channel. However, every once in awhile, I get zero values in my plot and I do not know why. The serial output from the thermocouple does not show any 0 values. So, it must be on the ThingSpeak side. Does anyone know why this happens, or how to fix it? Thanks!", "num_user_post": " 1", "author": "brenbry"}, {"date": "May 1, 2018 - 1:10 pm", "content": "If you are updating different fields of the same channel, you may see null or zero values in one field.  I have created this situation when I have a react that writes values back to a channel with a MATLAB analysis.  The analysis writes a status field based on the field values, but every time the status is written, all the other fields see a null result.It is also possible the extra characters are being written sometimes, based on how the variable you use for your sensor data in the photon are cleared.  If there are extra non-printable characters, it is possible that ThingSpeak would interpret those values as strings and you might see them as zeros on your channel view.  Do you see zero values  in the data or just on your ThingSpeak plots?", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/csv-import-on-react-thing-http/", "posts": [{"date": "August 22, 2017 - 7:17 am", "content": "Hi, I am in the middle of developing a commercial IoT Application with Thingspeak and in need of some help.I am connecting an ESP8266 to 4 sensors.ESP8266 is connected to a Channel.each Sensor to a Field.each Sensor will have 3 trigger leveleach Trigger need to Send HTTP Request to 2 Web services.with all of this trigger and request, i end up with 24 React and 8 ThingHTTP.the problem is, i'm planning to have thousands of ESP8266 and realize, it will be a pain to manage and maintain the React and Thing HTTP manually.does anyone have any experience with this kind of problem and have a solutions?a CSV Import for React and ThingHTTP is more than enough. but I can't seem to find those functions. any idea?", "num_user_post": " 2", "author": "cpram"}, {"date": "April 30, 2018 - 5:09 pm", "content": "You can use csv import in MATLAB, if you have a license.  If you file is on the web, you can import from google sheets and other data formats.In ThingSpeak, trybob=webread('https://thingspeak.com/channels//feed.csv?days=1')This will work for a public channel, add the read API key to read from a private channel.You may want to consider using a MATLAB visualization to manage the react.  You can use a react or time control to call the MATLAB analysis. You can have the visualization read channel data to determine the thresholds and even to determine which channels to read.  If you make the script reuasable and ambivalent to the device that triggered it, you will not have so much difficulty managing all the reacts.", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/channel-export-to-csv-limit/", "posts": [{"date": "May 18, 2017 - 5:01 am", "content": "Hi guys, new to this so please let me apologize in advance for my questions! I created a channel that is being updated every 15 min by a sensor array (that is working perfectly)https://thingspeak.com/channels/270574But when i try to download the csv it only downloads the last 100 data points, how do i download the whole data set to CSV? Thanks in advance for your help!", "num_user_post": " 1", "author": "femuruy"}, {"date": "April 30, 2018 - 4:36 pm", "content": "The data export on the private and public views of your channel will default to the last day of date.  Use the data export feature on the data export tab to retrieve the contents of the whole channel.  When you click the data export on the channel view, you will see the format for the rest call in your browser window.  You can add another parameter, such as ?days=5 if you want more data, but not all of it.see https://www.mathworks.com/help/thingspeak/readdata.html for the format and full list of parameters that you can add.If you use two parameters, use ampersand for the second parameter, for example: '?days=4&sum=10'", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/send-data-from-thingspeak-to-esp8266/", "posts": [{"date": "April 29, 2017 - 5:25 pm", "content": "HiI succeeded send data from a sensor (by Arduino Uno + esp8266) to my ThingSpeak channel.Now I want to send back data from my channel to Arduino Uno.Help?  tnx", "num_user_post": " 8", "author": "irproject"}, {"date": "April 30, 2018 - 4:26 pm", "content": "You can use ThingSpeak to modify channel data, perhaps include a flag that theree is new data.  Then when your device reads the channel, it will know there is new data.You can read channel data with read api calls.  https://www.mathworks.com/help/thingspeak/readdata.htmlIf you are using the thingspeak library, there are examples on reading a field.   If  you are not using the library, see the documentation examples for several examples for reading channel data. You can also use MQTT to subscribe to a channel which will send an update automatically every time the channel is updated.https://www.mathworks.com/help/thingspeak/mqtt-api.htmlIf you want thingspeak to queue commands for your device, you can use the TalkBack app.https://www.mathworks.com/help/thingspeak/talkback-app.html", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/thermocouple-into-thingspeak/", "posts": [{"date": "April 3, 2017 - 3:40 pm", "content": "Hello,I have 8 thermocouples and I wanna know if i can wire them in series, and so only take one pin in my Arduino UNO. And can I visualize all these thermocouples on the same field (on thingspeak), or not the same (it doesnt matter) ? Thanks", "num_user_post": " 1", "author": "Keaume"}, {"date": "April 30, 2018 - 2:50 pm", "content": "You will not be able to visualize all 8 thermocouples if you put them in the same field.  Assuming you have synchronous measurements from all thermocouples, you should put them all in different fields.  If they are asynchronous, you should consider putting each in its own channel.  You cannot wire them in series if you want to read the individual values.  You could use a multiplexing chip if you want to save Arduino pins.", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/406-adding-a-new-command-con-talkback-api-since-today-04052018/", "posts": [{"date": "April 25, 2018 - 10:08 am", "content": "Hi,I had a simple app built in Angular used to post command to my TalkBack App. This app was working as expected.Today I've found with an error 406 when execute the POST. I'm getting this error, but the command is correctly posted, I can find it in the TalkBack page.Why this is happening?", "num_user_post": " 1", "author": "rodrigomocca"}, {"date": "April 25, 2018 - 4:25 pm", "content": "Can you share the syntax of your POST command?", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/error-401-unauthorized-with-correct-api-key/", "posts": [{"date": "April 22, 2018 - 10:29 am", "content": "Hello forum,I'm just transferring from Ubidots and I'm trying to get my code to work (Arduino with GPRS Shield.) Currently I'm sitting with error code 401, like I'm using the wrong credentials. I have checked and rechecked the channel ID and write API several times, with the same effect.Can anyone see where my fault is? Updating the channel by putting this line into my browser window works fine. 'https://api.thingspeak.com/update?api_key=xxx&field1=123456'This way there seems to be no issues with my write API.Thanks,HeinCONNECT OKAT+CIPSEND=447POST /channels/xxx/bulk_update.json HTTP/1.1Host: api.thingspeak.comContent-Type: application/json{  'write_api_key': 'xxx',  'updates':  [     {      'created_at': '2018-04-22 16:26:20 +0200',      'field1': 'John Johnson',      'field3': 60,      'field4': 555,      'field5': 444,      'latitude': '-16.300580',      'longitude': '28.819500',      'status': 'Please check in!'     }  ]}SEND OKHTTP/1.1 401 UnauthorizedServer: nginx/1.7.5Date: Sun, 22 Apr 2018 14:28:15 GMTContent-Type: application/json; charset=utf-8Transfer-Encoding: chunkedConnection: keep-aliveStatus: 401 UnauthorizedX-Frame-Options: ALLOWALLAccess-Control-Allow-Origin: *Access-Control-Allow-Methods: GET, POST, PUT, OPTIONS, DELETE, PATCHAccess-Control-Allow-Headers: origin, content-type, X-Requested-WithAccess-Control-Max-Age: 1800Cache-Control: no-cacheX-Request-Id: d55c47ac-7940-459f-9918-24fde0b670169a{'status':'401','error':{'error_code':'error_auth_required','message':'Authorization Required','details':'Please provide proper authentication details.'}}0", "num_user_post": " 9", "author": "agrisensezm"}, {"date": "April 23, 2018 - 4:24 pm", "content": "It looks like you are sending only one update (though for multiple fields) . If this is true, you should use the regular update endpoint (https://www.mathworks.com/help/thingspeak/writedata.html), not the bulk update.The format should be:https://api.thingspeak.com/update.jsonFor bulk update you can send many updates in a single command to save battery power.The formatting for the regular data write is more simple, and the response time may be faster for a single update.Let us know if that works.", "num_user_post": " 401", "author": "cstapels"}, {"date": "April 23, 2018 - 4:29 pm", "content": "I don't think you have a format issue, by the way.I was able to post your JSON to my channel, just changing the channel ID and the api key.  I got 202 accepted in response.I would suggest creating a new channel and starting over.You could try using POSTMAN or something similar to make sure the POST works, since you already tried the GET in your browser.", "num_user_post": " 401", "author": "cstapels"}, {"date": "April 23, 2018 - 6:36 pm", "content": "I'm the same guy from this topic: https://community.thingspeak.com/forum/thingspeak-api/error-302/, and it's the same device. Can we stay on this topic? So on the format of sending a single update, and while using my profile api and not the write api for the channel I'm updating, it looks like I'm not specifying which channel to update anywhere in my request:POST /update.json HTTP/1.1Host: api.thingspeak.comContent-Type: application/json{  'api_key': 'xxx'     {      'created_at': '18-04-23 23:25:21 +0200',      'field1': 'John Johnson',      'field3': 66,      'field4': 555,      'field5': 444,      'latitude': '-16.300743',      'longitude': '28.819612',      'status': 'Please check in!'     }}", "num_user_post": " 9", "author": "agrisensezm"}, {"date": "April 23, 2018 - 7:04 pm", "content": "You are correct. The update endpoint does not require the channel ID.  I was having trouble keeping up with both threads, thanks for the relief.  You definitely need the channel write api key, not your profile api key to update a channel.  But the label is changed to 'api_key' for the single update endpoint.  My apologies for the confusion.Here is working syntax:POST /update.json HTTP/1.1Host: api.thingspeak.comContent-Type: application/json{'api_key': 'JNWIVP3CD54ZGI9X','created_at': '18-04-23 23:25:21 +0200','field1': 'Dr. John Johnson','field3': 611,'field4': 552,'field5': 443,'latitude': '-16.300743','longitude': '28.819612','status': 'Feeling great!'}", "num_user_post": " 401", "author": "cstapels"}, {"date": "April 24, 2018 - 2:34 am", "content": "Thanks cstapels. This is what I'm sending, sadly with the same result. I'm sending the write_api, and I tried with specifying both 'api_key' and 'write_api_key' labels - same result.Is there a way to see what actually reached the server? Maybe some of the last characters are not making it through?POST /update.json HTTP/1.1Host: api.thingspeak.comContent-Type: application/json{'api_key': 'xxx','created_at': '18-04-24 08:20:21 +0200','field1': 'John Johnson','field3': 66,'field4': 555,'field5': 444,'latitude': '-16.300660','longitude': '28.819400','status': 'Please check in!'}SEND OKHTTP/1.1 400 Bad RequestServer: nginx/1.7.5Date: Tue, 24 Apr 2018 06:32:49 GMTContent-Type: application/json; charset=utf-8Transfer-Encoding: chunkedConnection: keep-aliveStatus: 400 Bad RequestX-Frame-Options: ALLOWALLAccess-Control-Allow-Origin: *Access-Control-Allow-Methods: GET, POST, PUT, OPTIONS, DELETE, PATCHAccess-Control-Allow-Headers: origin, content-type, X-Requested-WithAccess-Control-Max-Age: 1800Cache-Control: no-cacheX-Request-Id: 8ded12e8-3d9a-4cf5-a810-99ccc0cae4d5Set-Cookie: request_method=POST; path=/100HTTP/1.1 400 Bad RequestServer: nginx/1.7.5Date: Tue, 24 Apr 2018 06:32:49 GMTContent-Type: text/htmlContent-Length: 172Connection: close400 Bad Request400 Bad Requestnginx/1.7.5", "num_user_post": " 9", "author": "agrisensezm"}, {"date": "April 24, 2018 - 9:23 am", "content": "I have run into issues in Arduino with the buffer size on a POST.  Depending on the library you are using, there is a tiny 256 character limit for the wifi client, so it is possible all your characters aren't getting sent.  You can get around this by sending one line at a time, but I think a better option for you is to use the GET request to update.https://api.thingspeak.com/update.json?api_key=XXXXXXXXXXXXXXXX&field1=joy&field2=22&field3=77&status=awesomeThe GET format is also shown here:https://www.mathworks.com/help/thingspeak/writedata.html", "num_user_post": " 401", "author": "cstapels"}, {"date": "April 24, 2018 - 4:53 pm", "content": "Joy indeed! GET is shorter and quicker, fits my bill perfectly. This is what the GET request looks like when sending using AT+CIPSEND on the GPRS shield:GET https://api.thingspeak.com/update.json?api_key=xxx&status=John Johnson 04:47:22Host: api.thingspeak.comOne more question on this, when I enter the first line into my browser it accepts the whole status update, with spaces and all 'John Johnson 04:47:22'. But when I use it in the format above, it only updates the first word 'John.' Everything after the first space dissapears. It would not be ideal to switch the spaces with underscores, do you know of another way to get the spaces to go through?", "num_user_post": " 9", "author": "agrisensezm"}, {"date": "April 24, 2018 - 6:06 pm", "content": "If you have spaces in your content, they need to be URL encoded with a %20 (ASCII code of space, in hexadecimal).Your GET request will be something likehttps://api.thingspeak.com/update.json?api_key=XXXXXXXXXXXXXXXX&field1=John%20Johnson&field2=22&field3=77&status=awesome", "num_user_post": " 225", "author": "Vinod"}, {"date": "April 25, 2018 - 3:01 am", "content": "Thanks.What are the limitations to the content of the status field? It seems like it only likes one word, when using the GET request from my Arduino. When sending the request through my browser address bar it seems to accept a longer string with spaces.When I send this: 'status=UNREGISTERED' it updates ok, but if I send 'status=Emilio_Violet_14:54:3' I get 400 Bad Request. Are the ':' also a problem in the URL?", "num_user_post": " 9", "author": "agrisensezm"}, {"date": "April 25, 2018 - 10:13 am", "content": "Your web browser may do some URL encoding where the Arduino will not.'status=Emilio_Violet_14:54:3' worked in my chrome browser, but you can encode it to be safe from your Arduino.':' encodes to %3A.Have a look at this resource: https://www.w3schools.com/tags/ref_urlencode.aspThe status field is limited to 256 characters.", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/mqtt-connection-to-thingspeak-from-local-mosquitto-broker-not-authorized/", "posts": [{"date": "August 11, 2017 - 3:31 pm", "content": "I'm trying to set up a connection from my local mosquitto mqtt broker to thingspeak, so I can run everything through my local broker and still log some of the data to thingspeak by creating a topic subtree starting with remote/thingspeak.I have Mosquitto up and running and can pub and sub as expected, but when I try to configure the thingspeak connection things start to get weird.Having read the mqtt documentation on thingspeaks api pages, I have come up with this mosquitto.conf file (I put in the cleansession true, everything I found about will-something appears to be 0 by default):thingspeak.conf:-----------------------------connection thingspeakaddress mqtt.thingspeak.com:1883cleansession truetopic # out 0 remote/thingspeak/ channels/-----------------------------When I start my server, it tries to connect, but the connection gets refused:1502479267: Connecting bridge thingspeak (mqtt.thingspeak.com:1883)1502479267: Bridge raspberrypi.thingspeak sending CONNECT1502479267: Received CONNACK on connection raspberrypi.thingspeak.1502479267: Connection Refused: not authorised1502479267: Socket error on client raspberrypi.thingspeak, disconnecting.This is before I even try to publish a message through the connection.What I was hoping this configuration would allow me to do, was publish a message with values to remote/thingspeak/<channelid>/publish/<write key> and make Mosquitto forward it to thingspeak on the topic channels/<channelid>/publish/<write key> Does anyone out there has a working thingspeak configuration for Mosquitto they can share? 🙂", "num_user_post": " 4", "author": "Boggie"}, {"date": "August 14, 2017 - 3:39 pm", "content": "Just to answer my own question, in case anyone else with the same challenge finds it.After a lot of trial, error and looking at other bridge configurations on the internet, I found out that I needed to turn off notifications. The following bridge configuration will allow you to bridge messages from a local mosquitto server to thingspeak 🙂-----connection thingspeakaddress mqtt.thingspeak.comnotifications falsecleansession truetopic # out 0 remote/thingspeak/ channels/-----Happy MQTT'ing", "num_user_post": " 4", "author": "Boggie"}, {"date": "August 16, 2017 - 2:35 am", "content": "This may be related to an issue I am having.   I am running HomeAssistant on a RaspberryPI.  It uses Paho, or Mosquitto or some sort of MQTT broker.  Any way, I am sending & logging some weather data from an ESP8266 to HomeAssistant, through the MQTT broker.  I read the data, send it mqtt to home assistant, then post it to thingspeak.  I noticed that when I 'ThingSpeak.writeFields(myChannelNumber, myWriteAPIKey);' , it drops my MQTT connection to HomeAssistant and must reconnect.I use the lastwill feature and when they drop 'OFFLINE', then I get a notification.  The weird thing is that the keep alive time is about 5 minutes.  I was getting a offline and reconnected notifications about every 30 seconds or so.  I edited out the thingspeak.writefields line and the issue went away.   Then I searched and your post came up.   I am thinking its the two different MQTT services causing my problem. So, do you think there is a workaround for this issue?  Can I somehow separate the two mqtt messages being sent to two different mqtt services on the same device? I am pretty new to mqtt & these little microcontrollers.  I have been curious if there was a way to send the same data to two different HomeAssistant installations from the same device, but I dont have enough knowledge about it.  After looking at the code, it looks like two different mqtt servers could be declared in the variables, but the thingspeak server is already declared as something different so I am still confused.Anyway, if you could offer some suggestions I would greatly appreciate it.   Right now my setup is working, just for some reason it is dropping my mqtt connection to home assistant every time I send a post to my thingspeak channel.  I have to turn off the notifications for the dropped connections or I constantly get them.  Rob", "num_user_post": " 2", "author": "RobO"}, {"date": "August 16, 2017 - 10:38 am", "content": "RobO,I don't think your problem is related to Boggie's post.  He is referring to publishing messages to the mqtt interface of ThingSpeak.  As far as I know, the ThingSpeak HomeAssistant component is using the HTTP REST interface.It sounds like there is a problem with your ThingSpeak configuration.  If the ThingSpeak call errors out, it may be causing your HomeAssistant process to restart and in the process booting your ESP8266 mqtt client.", "num_user_post": " 34", "author": "JasonW"}, {"date": "August 20, 2017 - 11:25 pm", "content": "JasonW,You may be correct. I probably didnt explain my setup well enough. I use an Adafruit Huzzah ESP8266 to send the mqtt messages to home assistant.   Which sends fine.   Then when I call the ThingSpeak.writeFields(myChannelNumber, myWriteAPIKey); function within my program, it kills the mqtt connection to my home assistant broker.   I do not use the ThingSpeak component of home assistant.   I tried that first and could not get it to work.  So, I saw that there is an arduino library and went that route.  When I tried to add the ThingSpeak component, I kept getting errors and I couldnt figure it out. I figured this out because I get notifications when it drops the connection to the mqtt broker at the home assistant address.  It should not fall off for at least 5 minutes because that is the keep alive time.  If I comment out that line ThingSpeak.writeFields(myChannelNumber, myWriteAPIKey);...  the program works fine and does not drop the mqtt connection.    If I leave it in there and compile it and upload the program, it works fine, it just drops the mqtt connection to home assistant and reconnects at the top of the program again.  So, based on my trial and error, when I call the ThingSpeak.writeFields function, it apparently forces the lastwill message to be sent to home assistant broker.   I immediately get an 'OFFLINE' message, which is what I have it set to do.   Then right away I get an 'ONLINE' reconnect message.  It wont do it if I comment out that ThingSpeak.writeFields function or remove it.When I read that it was a mqtt connection to thingspeak, I figured this was some sort of conflict between the mqtt client setup to send messages to home assistant and the mqtt client setup to send messages to thingspeak.   I dont know enough about it other than there is something going on when I try doing them both.I kind of figured there was a way to declare two different mqtt setups on the same micro and it work.   I may try to set one up and do some tests. Thanks for Replying......", "num_user_post": " 2", "author": "RobO"}, {"date": "March 16, 2018 - 6:01 pm", "content": "I am posting to Mosquitto and syncing to Thingspeak just as in the startingpost. I post to Mosquitto from an ESP-board. I also had to set retain=false in my code:pubsubclient.publish(thingspeak_topic, msgTS.c_str(), false);With 'mosquitto_pub' from command line retain is false by default. Enabling it also blocks the message from being synced to Thingspeak.Maybe this helps somebody. btw I can only sync when I post values in the form of 'field1=5&field2=10' to a specific topic. Does anybody know a way to sync a topic with 'normal' values, like topic 'home/temp' that contains temperature-values to a Thingspeak-channel?", "num_user_post": " 1", "author": "robvk"}, {"date": "April 5, 2018 - 1:53 pm", "content": "Hi I am new to mqtt and thingspeak. I try to do the bridge from my raspberry pi to thingspeak through mqtt. i setup everything like it is said here and my topic istopic # out 0 home/temperatura/ channels/<chnumber>/publish/fields/field1/<mymqttapi>the bridge config:onnection thingspeak address mqtt.thingspeak.com:1883 notifications false cleansession true #remote_clientid thing start_type automatic log_type all remote_username   remote_passwordthe log shows :Bridge raspberrypi.thingspeak sending CONNECT 1522950371: Received CONNACK on connection local.raspberrypi.thingspeak. 1522950371: Bridge local.raspberrypi.thingspeak sending UNSUBSCRIBE (Mid: 1, Topic: channels/<mychnumber>/publish/fields/field1/<mywritekey>/#) 1522950371: Received UNSUBACK from local.raspberrypi.thingspeakSending PUBLISH to local.raspberrypi.thingspeak (d0, q0, r1, m0, 'channels/<mychnumber>/publish/fields/field1/<mymqttapi>/home/temperatura',so it adds local topic to my remote topicso I don't see anything in thingspeak in my channel  What am i doing wrong?how to change so remote broker won't change to topic with local topic?Thanks for help", "num_user_post": " 1", "author": "marcinnap"}, {"date": "April 24, 2018 - 9:46 am", "content": "I'm not clear which topics are on your pi and which you are sending to thingspeak, but this topic name is not right for ThingSpeak MQTT'channels//publish/fields/field1//home/temperatura'The api key should be the write api key.  You would use the mqttapi key for connecting, not for publish.  The channel write api key is at the end of the topic and then the field information goes in the message body.Have a look at the publish and subscribe pages at the top of the MQTT API page for the correct structure.https://www.mathworks.com/help/thingspeak/mqtt-api.html", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/error-302/", "posts": [{"date": "April 21, 2018 - 3:38 pm", "content": "Hello forum,I'm using Arduino with Sim808 shield to send data to Thingspeak, just starting my project now. I got the Arduino to send the data, but something is wrong with the content or format since I'm getting error 302 (redirect??) Thinking this has something to do with my API credentials I tried the user API key, but with same effect. Currently I'm using the write API key, and this is what is sent and the response. Any ideas on where I'm going wrong would be much appreciated. channel id and API key replaced by xxx for this post.CONNECT OKAT+CIPSEND=352POST /channels/xxx/bulk_update.json HTTP/1.1Host: api.thingspeak.comContent-Type: application/jsonContent-Length: 223{  'write_api_key': 'xxx',  'updates': [{      'created_at': '2018-04-21 19:26:20 +0200',      'field1': 'John Johnson',      'field3': 73,      'field4': 22,      'field5': 33,     }  ]}SEND OKHTTP/1.1 302 FoundCache-Control: no-cacheContent-length: 0Location: https://api.thingspeak.com/channels/xxx/bulk_update.jsonConnection: closeCLOSED", "num_user_post": " 9", "author": "agrisensezm"}, {"date": "April 21, 2018 - 4:26 pm", "content": "Apologies... I'm busy transferring from Ubidots to Thingspeak, and I was still connecting to ubidots, I never changed to 184.106.153.149. Now that I am connected the the right server however, I'm hit with error 400. Can anyone see anything obvious that's wrong with my syntax?AT+CIPSEND=351POST /channels/xxx/bulk_update.json HTTP/1.1Host: api.thingspeak.comContent-Type: application/jsonContent-Length: 221{  'write_api_key': 'xxx',  'updates': [{      'created_at': '2018-04-21 19:26:20 +0200',      'field1': 'John Johnson',      'field3': 70,      'field4': 22,      'field5': 33,     }  ]}SEND OKHTTP/1.1 400 Bad RequestServer: nginx/1.7.5Date: Sat, 21 Apr 2018 20:24:15 GMTContent-Type: text/html; charset=utf-8Content-Length: 0Connection: keep-aliveStatus: 400 Bad RequestX-Request-Id: d2490a7b-b110-451c-81e9-b7ff7a86d41d", "num_user_post": " 9", "author": "agrisensezm"}, {"date": "April 23, 2018 - 1:59 pm", "content": "It looks like you are sending only one update.  If this is true, you should use the regular update endpoint (https://www.mathworks.com/help/thingspeak/writedata.html), not the bulk update.The format should be:https://api.thingspeak.com/update.jsonFor bulk update you can send many updates in a single command.  Let us know if that works.", "num_user_post": " 401", "author": "cstapels"}, {"date": "April 23, 2018 - 4:22 pm", "content": "Thanks for the response, @cstapels.I changed to the regular endpoint, as you suggested. Also content type as per the document you shared above. Now it's 400, BAD REQUEST. On the Bulk Write document (https://uk.mathworks.com/help/thingspeak/bulkwritejsondata.html) at teh bottom it has an example of the full POST, this helps me to put together the whole message. On the help doc you sent there is no example, so it's hard to know where I'm going wrong.I'm using a GPRS Shield since my project will be deployed remotely, so I cannot use the Thingspeak Arduino library. This means I have to do the request manually. But what you see on the Serial screen is not always exactly the same as what ends up being sent to the GPRS shield.Is there a way to check the POST request as it was received on the Thingspeak server side?This is what I have now (not entirely sure of the syntax of sending a single update)POST  https://api.thingspeak.com/update.json HTTP/1.1              (I tried this line with only '/update.json HTTP/1.1', same result.)Host: https://api.thingspeak.comContent-Type: application/x-www-form-urlencoded{  'write_api_key': 'xxx'       {      'created_at': '2018-04-23 21:36:20 +0200',      'field1': 'John Johnson',      'field3': 56,      'field4': 555,      'field5': 444,      'latitude': '',      'longitude': '',      'status': 'Please check in!'     }  }SEND OKHTTP/1.1 400 Bad RequestServer: nginx/1.7.5Date: Mon, 23 Apr 2018 20:19:09 GMTContent-Type: text/htmlContent-Length: 172Connection: close400 Bad Request400 Bad Requestnginx/1.7.5", "num_user_post": " 9", "author": "agrisensezm"}, {"date": "April 23, 2018 - 4:36 pm", "content": "Make your content typeapplication/jsonAnd for the regular update, you need api_key, not write_api_key.  Sorry about that, but I assure you there was an important reason for that change.Thanks for the feedback about a JSON encoded example on the write data page.", "num_user_post": " 401", "author": "cstapels"}, {"date": "April 23, 2018 - 6:04 pm", "content": "I'm trying all combinations of possible variations, still 400. I get two different responses when changing the URL and Host - in the second option the response seems a bit more lively. The 3rd response is as verbose as the 2nd. 4th response less verbose. Which suggests to me that Host must remain api.thingspeak.com. This is as far as I'm getting, but unless there is a clear example on exactly how all the brackets need to be, I don't know what else to try.POST /update.json HTTP/1.1Host: https://api.thingspeak.comContent-Type: application/json{  'api_key': 'xxx'     {      'created_at': '18-04-23 23:25:21 +0200',      'field1': 'John Johnson',      'field3': 66,      'field4': 555,      'field5': 444,      'latitude': '',      'longitude': '',      'status': 'Please check in!'     }}SEND OKHTTP/1.1 400 Bad RequestServer: nginx/1.7.5Date: Mon, 23 Apr 2018 21:46:44 GMTContent-Type: text/htmlContent-Length: 172Connection: close400 Bad Request400 Bad Requestnginx/1.7.5=========================POST /update.json HTTP/1.1Host: api.thingspeak.comContent-Type: application/json{  'api_key': 'xxx'     {      'created_at': '18-04-23 23:25:21 +0200',      'field1': 'John Johnson',      'field3': 66,      'field4': 555,      'field5': 444,      'latitude': '',      'longitude': '',      'status': 'Please check in!'     }}SEND OKHTTP/1.1 400 Bad RequestServer: nginx/1.7.5Date: Mon, 23 Apr 2018 21:51:02 GMTContent-Type: application/json; charset=utf-8Transfer-Encoding: chunkedConnection: keep-aliveStatus: 400 Bad RequestX-Frame-Options: ALLOWALLAccess-Control-Allow-Origin: *Access-Control-Allow-Methods: GET, POST, PUT, OPTIONS, DELETE, PATCHAccess-Control-Allow-Headers: origin, content-type, X-Requested-WithAccess-Control-Max-Age: 1800Cache-Control: no-cacheX-Request-Id: 5549b316-fa3e-484d-80b5-3cc33da2c296Set-Cookie: request_method=POST; path=/100=====================POST  https://api.thingspeak.com/update.json HTTP/1.1Host: api.thingspeak.comContent-Type: application/json{  'api_key': 'xxx'     {      'created_at': '18-04-23 23:25:21 +0200',      'field1': 'John Johnson',      'field3': 66,      'field4': 555,      'field5': 444,      'latitude': '',      'longitude': '',      'status': 'Please check in!'     }}SEND OKHTTP/1.1 400 Bad RequestServer: nginx/1.7.5Date: Mon, 23 Apr 2018 21:55:50 GMTContent-Type: application/json; charset=utf-8Transfer-Encoding: chunkedConnection: keep-aliveStatus: 400 Bad RequestX-Frame-Options: ALLOWALLAccess-Control-Allow-Origin: *Access-Control-Allow-Methods: GET, POST, PUT, OPTIONS, DELETE, PATCHAccess-Control-Allow-Headers: origin, content-type, X-Requested-WithAccess-Control-Max-Age: 1800Cache-Control: no-cacheX-Request-Id: 19887308-f15d-4c53-83be-ce0236f390b3Set-Cookie: request_method=POST; path=/100=======================POST  https://api.thingspeak.com/update.json HTTP/1.1Host: https://api.thingspeak.comContent-Type: application/json{  'api_key': 'xxx'     {      'created_at': '18-04-23 23:25:21 +0200',      'field1': 'John Johnson',      'field3': 66,      'field4': 555,      'field5': 444,      'latitude': '',      'longitude': '',      'status': 'Please check in!'     }}SEND OKHTTP/1.1 400 Bad RequestServer: nginx/1.7.5Date: Mon, 23 Apr 2018 22:00:39 GMTContent-Type: text/htmlContent-Length: 172Connection: close400 Bad Request400 Bad Requestnginx/1.7.5", "num_user_post": " 9", "author": "agrisensezm"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/you-have-run-out-of-messages/", "posts": [{"date": "December 6, 2017 - 4:38 am", "content": "Hi,I ran out of messages and waited until the year was over. Shouldn't I be able to write again values to my channel? It still shows 'You have run out of messages as of: October 26, 2017.  But under 'my account' free messages start date 2017-12-05 is shown. Thanks in advanceHenning ", "num_user_post": " 3", "author": "hkuehn"}, {"date": "December 6, 2017 - 5:20 pm", "content": "If your free messages start date is 2017-12-05, unless you have used up 3 million messages in two days (very very unlikely), you should be able to update your channel. Can you log out of ThingSpeak, log back in and confirm that the message about having run out of messages is gone? Can you try updating a test channel with a single GET using your browser - does that update your channel?If the answer to either of the above two questions is 'no', please send me an email vcherian(.at)mathworks (.com) and we can set something up to investigate this.", "num_user_post": " 225", "author": "Vinod"}, {"date": "December 7, 2017 - 7:44 am", "content": "Hi,thank you very much for your reply. I have logged out and in again and tried updating with my arduino device as well as by using the brouwser but without success. It still says 3000000 messages remaining and 'You have run out of messages as of: October 26, 2017' I will write a mail with the screenshot to that email.", "num_user_post": " 3", "author": "hkuehn"}, {"date": "December 7, 2017 - 12:33 pm", "content": "Vinod has cleared the cache. Now everything works well! You are doing a great job, thank you very much!!!", "num_user_post": " 3", "author": "hkuehn"}, {"date": "April 21, 2018 - 6:13 pm", "content": "Vinod said If your free messages start date is 2017-12-05, unless you have used up 3 million messages in two days (very very unlikely), you should be able to update your channel. Can you log out of ThingSpeak, log back in and confirm that the message about having run out of messages is gone? Can you try updating a test channel with a single GET using your browser - does that update your channel?If the answer to either of the above two questions is 'no', please send me an email vcherian(.at)mathworks (.com) and we can set something up to investigate this.  looks like the same issue here, could someone help ? Thanks!", "num_user_post": " 1", "author": "hugo11dom@gmail.com"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/save-and-read-data-within-a-channel-googlesheets/", "posts": [{"date": "April 18, 2018 - 1:23 pm", "content": "Hello,I am trying to download data from a google sheet and that works great on MATLAB and at least runs on ThingSpeak. I use websave('somedata.csv','URLOFSHEET')Using websave returns an extension.I want ThingSpeak to read these values and run code on them, but the normal csvread does not work. I tried to find this saved value in my Data Imports and Exports and cannot find it.Is there any way for ThingSpeak to read and work on what it has downloaded from google sheets? And if not, how can I get data from google sheets onto my channel?", "num_user_post": " 1", "author": "Nisreen"}, {"date": "April 20, 2018 - 4:58 pm", "content": "I looked at this fileexchange  (https://www.mathworks.com/matlabcentral/fileexchange/39915-getgooglespreadsheet)  to  see that you can export a google doc to MATLAB.  I was able to import my document in ThingSpeak using the formatoutfile=webread('https://docs.google.com/spreadsheet/ccc?key=DOCID&output=csv&pref=2');where DOCID is the google doc id, which you can see in theURL when you open the doc.  You may have to adjust to doc's sharing settings.Thingspeak has some tight limitations on the size of the file you can display, but I think you can still load in a larger file and then manipulate it.  Can you clarify  what you mean by 'Is there any way for ThingSpeak to read and work on what it has downloaded from google sheets'  Where is the file downloaded - in MATLAB?", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/response-code-400-since-april-12th-2018/", "posts": [{"date": "April 19, 2018 - 8:42 am", "content": "Maybe the forum can help me out.I started receiving a Response Code 400 about weeks ago.  I am using the example API code for bulk data transfer posted below.I have checked my account and it is way under the limit of messages.Here is my channel, it has been operational for months. https://thingspeak.com/channels/357730Anyone have recommendations .Thank you for comments.// Update the ThingSpeakchannel with datavoid httpRequest(char* csvBuffer) {     /* CSV format to bulk update      * This function posts the data to ThingSpeak server   */    // Compute the data buffer length    String data_length = String(strlen(csvBuffer)+1);    // Close any connection before sending a new request    client.stop();    // POST data to ThingSpeak    if (client.connect(server, 80)) {        client.println('POST /channels/'+ChannelID+'/bulk_update HTTP/1.1');        client.println('Host: '+server);        client.println('User-Agent: mw.doc.bulk-update (Particle Photon)');        client.println('Connection: close');        client.println('Content-Type: application/x-www-form-urlencoded');        client.println('Content-Length: '+data_length);        client.println();        client.println(csvBuffer);    }    else {        Particle.publish('Failure','Failed to update ThingSpeak channel');    }    delay(1000); // Wait to receive the response    client.parseFloat();    String resp = String(client.parseInt());    Particle.publish('Response code',resp); // Print the response code. 202 indicates that the server has accepted the response    lastConnectionTime = millis(); // Update the last conenction time}", "num_user_post": " 2", "author": "tkomar"}, {"date": "April 19, 2018 - 9:21 am", "content": "What hardware are you using?Some restrictions on format for bulk updates that weren't enforced before are now being enforced.  If you are using relative time format, please make sure you are using integer time values. You may have to round them if you used the example code from ThingSpeak documentation.  If that is not the issue, consider removing the extra character in this lineString data_length = String(strlen(csvBuffer)+1);Instead useString data_length = String(strlen(csvBuffer);Please let us know if that fixes your 400 error.", "num_user_post": " 401", "author": "cstapels"}, {"date": "April 19, 2018 - 10:13 am", "content": "The extra '+1' added to data_length was the culprit. I removed it per your suggestion and I am back to posting data. Here is the source of my code with hope it can be updated.https://www.mathworks.com/help/thingspeak/bulk-update-a-thingspeak-channel-using-particle-photon-board.htmlFYI, I am using a Particle Photon.  Many thanks for quick response.", "num_user_post": " 2", "author": "tkomar"}]}]}