{"url": "https://community.thingspeak.com/forum/thingspeak-apps/page-4/", "threads": [{"url": "https://community.thingspeak.com/forum/thingspeak-apps/javascript-help-w-thingspeak-api-field-data-as-dependency/", "posts": [{"date": "July 31, 2017 - 10:41 am", "content": "In my JavaScript I have a number of variables as shown: stop = new google.maps.LatLng(59.093914487013, -122.71569423377514)waypts.push({location: stop,stopover: true The line in Bold is what I need help with. I have data transmitted to Thingspeak. I have an API that allows me to select the exact value to query; what I need to know is how to use a GET statement (Or anything that would work) to have that Stopover line be True or False based on the result. So IF the result queried by the API is over 8, it's TRUE, if it's under it is false. The API line looks like this:  GET https://api.thingspeak.com/channels/****/fields/1.json?results=2So How do I set that Bold field to query this and either be TRUE or FALSE based upon the result of this query? If you need any more info please reply and I can fill in any blanks, but I'm reallllly needing some help here. Thank you! ", "num_user_post": " 8", "author": "jteindl"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/how-to-connect-loriot-server-with-thingspeak/", "posts": [{"date": "July 25, 2017 - 1:27 pm", "content": "Hello,I would be really gratefull if anyone knows how to connect loriot network server with thingspeak.For the gateway connected to loriot i am using rpi 3 and ic880a concentrator.Thank you in advance. ", "num_user_post": " 1", "author": "kots"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/calculating-and-dispalying-sum-for-a-day/", "posts": [{"date": "July 18, 2017 - 7:12 pm", "content": "Hello Guys, I am getting data from flow sensor and I want to calculate and display total liquid recorded for a day and for a specific hour. How can I do that using MATLAB Visualizations or Analysis or any thingSpeak apps? Thank you and I look forward to some great suggestions.Best RegardsRushan", "num_user_post": " 8", "author": "rushanarshad"}, {"date": "July 20, 2017 - 4:25 pm", "content": "added some suggestions here.", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/prowl-thinghttp-and-react/", "posts": [{"date": "July 17, 2017 - 12:59 pm", "content": "Hi, we are students that are quite new to this. So pls feel free to correct us. We have connected React to ThingTweet and Prowl via ThingHTTP, here are the problems we face: 1. For ThingTweet, we want to trigger a status update On Data Insetion on twitter if our data meets a certain criteria, however it only triggers once even after putting %%trigger%% at the action2. I have followed the instruction for Push Updates using Prowl and ThingHTTP, but i do not get any notification from Prowl on my phone whenever the data meets the criteria.  I do not know whats wrong why I do not get repititve notification, pls help", "num_user_post": " 1", "author": "Proj_A"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/thinghttp/", "posts": [{"date": "July 10, 2017 - 10:54 am", "content": "I want to use ThingHTTP with React to monitor my sensors, when a value is exceeded, what I need to figure out is a way to integrate it into my mapping application which is Java and HTML. I have sensor locations in my HTML which lets you select them and run a mapping function so it uses waypoints to give the most efficient route, but I want to add a condition on the sensor locations so that it is automatic. When a threshold is exceeded, it will automatically add the waypoints, skipping any that haven't.  Below is the HTML, I'm a bit new to all of this, is it the HTML where I would add the dependency? Or is it the Java? On all of the listed waypoints, I need something to tell it to only give the options that meet the value defined. ****Starting Location:**WM Head Office***Waypoints:**(Ctrl+Click or Cmd+Click for multiple selection)***Bin1*Bin2*Bin3*Bin4*Bin5*Bin6***End:**WM Head Office******</div>*<!-- Replace the value of the key parameter with your own API key. -->*https://maps.googleapis.com/maps/api/js?key=AIzaSyCkUOdZ5y7hMm0yrcCQoCvLwzdM6M8s5qk&callback=initMap", "num_user_post": " 8", "author": "jteindl"}, {"date": "July 11, 2017 - 10:40 pm", "content": "ThingHTTP has a very limited ablitity to customise whats sent to the other webservice so your application may require additional code to translate properly. How do you expect to map sensor values to waypoints?  It seems there is a layer of logic there that thingHTTP alone may not be able to do on its own.", "num_user_post": " 271", "author": "rw950431"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/cannot-update-some-channels-anymore/", "posts": [{"date": "July 8, 2017 - 12:37 pm", "content": "using 10 x esp8266, everything went well to update 10 channelssuddenly channels 4 , 5 and 6 refuse to update, other channels keep working,  anybody any idea?any help is appreciated// replace with your channel's thingspeak API key, //String apiKey = 'KEQHBL3FSHLMUHKX'; // De Krook demo by ArdLab //String apiKey = 'SIN3WR18MW3BHJHO'; // kanaal 1 //String apiKey = 'M6NSJ2GXHJM4IG2B'; // kanaal 2 //String apiKey = 'KATJXFEH3EY3YU5F'; // kanaal 3 String apiKey = 'NVQOS01DRDP9A1B4'; // kanaal 4 DOES NOT WORK //String apiKey = 'HF55ASAXRYXJOLDW'; // kanaal 5 DOES NOT WORK //String apiKey = 'Z2APOHPDTOEI9AIP'; // kanaal 6 DOES NOT NIET //String apiKey = 'W2PQLMPL739N516C'; // kanaal 7 //String apiKey = 'HURINR4DRXGVIL1T'; // kanaal 8 //String apiKey = 'GXJROHT3819DYTSS'; // kanaal 9 //String apiKey = 'TI3NPOABSDIYIZUF'; // kanaal 10 //String apiKey = 'L6KPQ7F069305E23'; // kanaal 11 //String apiKey = '8NECZLS4VM90XQ12'; // kanaal 12", "num_user_post": " 2", "author": "ardlab"}, {"date": "July 9, 2017 - 8:37 am", "content": "So you are using 10 seperate ESP8266 boards to update 10 seperate channels? Are you able to update the problem channels from your web browser? (Theres a sample URL on the data import/export tab you can copy)  If not what error codes are returned?", "num_user_post": " 271", "author": "rw950431"}, {"date": "July 10, 2017 - 3:26 am", "content": "I successfully uploaded a csv formatted file, so the channel still works.But now I realise I messed up! I deleted channels and created new ones and I think I used the Read API and not the Write API to upload data. Not at home right now so I cannot test but I think the problem is solved.I do use 10 times esp8266, I will be giving a workshop on IoT and each participant will use its own esp8266.For testing purposes it's a cluster attacthed to 10 port USBhub.", "num_user_post": " 2", "author": "ardlab"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/react-to-a-change-on-more-than-one-field-help/", "posts": [{"date": "July 5, 2017 - 9:02 am", "content": "I have a channel with 3 fields. Each field will either store a 1 or a 0, so true or false effectively.Field 3 is a logical AND of field 1 and field 2 using the Matlab Analysis app.What I want to do is update field 3 everytime either field 1 OR field 2 gets a new value, but I can only seem to set up one 'React' that reacts to either field 1 data insert or field 2 data insert but not both.Any work arounds or advice would be greatly appreciated!! Thanks", "num_user_post": " 1", "author": "nimdixon@gmail.com"}, {"date": "July 5, 2017 - 3:26 pm", "content": "You could use a fourth field. Put data in field 4 each time you update field 1 or field 2.  Then trigger your react on field 4 with new data and have your matlab analysis check for data in field 1 or 2 and update field 3 based on the data check in your analysis app.You could do something similar to thisdata=thingSpeakRead(YOURCHANN#,'Fields',[1,2]); %add read api key if necessaryif isnan(data(1))data(1)=0;endif isnan(data(2))data(2)=0;endvalue=data(1) & data(2);thingSpeakWrite(YOURCHANNEL,value,'fields',3,'WriteKey','WRITEAPIKEY'));", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/hpa-bme280-change-1/", "posts": [{"date": "May 27, 2017 - 9:08 pm", "content": "somebody know how i change for hPA  http://www.instructables.com/id/Solar-Powered-WiFi-Weather-Station/ hPa is more used in aviation for QNH My channelhttps://thingspeak.com/channels/266412", "num_user_post": " 2", "author": "py2alc"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/inactivity-alert/", "posts": [{"date": "May 19, 2017 - 10:05 am", "content": "HiDoes anyone know if it's possible to send a HTTP request or alert of some form if a data point is *not* recorded within a certain period? I'd like to receive an alert if my device fails to log a data point.Thanks", "num_user_post": " 7", "author": "mun"}, {"date": "May 19, 2017 - 10:50 am", "content": "Yes. We have an app called React. React has an option to check your channel for no data inserted within a selected time frame. This will execute a ThingHTTP request when the condition is true. ", "num_user_post": " 402", "author": "Hans"}, {"date": "May 20, 2017 - 11:41 pm", "content": "Great! I'll give it a try. Thanks.", "num_user_post": " 7", "author": "mun"}, {"date": "May 21, 2017 - 7:20 am", "content": "I've given REACT a try, but it doesn't seem to make the HTTP request as expected. Here are my settings: The channel has no data submitted at all, but shouldn't the HTTP request still be made? I've already tested the Thing HTTP app which works fine. Thanks", "num_user_post": " 7", "author": "mun"}, {"date": "May 22, 2017 - 6:31 am", "content": "Just opened forum to check if anyone has issue with no data check, and here you go. For me it stopped working about a week ago. Tried to recreate react, but no success so far. Maybe there is some issue on thingspeak.Edit: I tried to change timings a bit and react worked now.", "num_user_post": " 4", "author": "paul"}, {"date": "May 23, 2017 - 9:16 am", "content": "Mine still refuses to make the HTTP request, so I'm not sure what's happening.", "num_user_post": " 7", "author": "mun"}, {"date": "May 23, 2017 - 4:54 pm", "content": "Hi Mun,Are you able to trigger the thingHTTP from a browser or POSTMAN?The syntax is GET https://api.thingspeak.com/apps/thinghttp/send_request?api_key=THINGHTTP_APIKEYThe react settings look appropriate, you could try increasing the test frequency, or decreasing the update time just to see if it goes.", "num_user_post": " 401", "author": "cstapels"}, {"date": "May 24, 2017 - 1:37 am", "content": "cstapels said Hi Mun, Are you able to trigger the thingHTTP from a browser or POSTMAN? The syntax is GET https://api.thingspeak.com/apps/thinghttp/send_request?api_key=THINGHTTP_APIKEYThe react settings look appropriate, you could try increasing the test frequency, or decreasing the update time just to see if it goes.  Hi Yes, I can trigger the thingHTTP perfectly. I've tried various test frequencies already though. Is REACT meant to be stable?", "num_user_post": " 7", "author": "mun"}, {"date": "May 25, 2017 - 2:55 pm", "content": "Mun,I was able to reproduce the problem and the team is looking into it.  Thanks.", "num_user_post": " 401", "author": "cstapels"}, {"date": "May 26, 2017 - 11:06 am", "content": "The problem with react on no data has been fixed. I have tested the condition, and it now works again for me. Can you go ahead and test it and let me know if your thingHTTP is called by the react when there is no data?  ", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/thinghttp-is-not-calling-on-meeting-certain-condition-in-react/", "posts": [{"date": "May 20, 2017 - 3:50 pm", "content": "Hi I have created one channel in which I am sending ADC value from ESP8266 and logging it to thingspeak. Alright! it is working well. I have created one react http://imgur.com/a/gTOea where I mentioned to trigger a ThingHTTP on meeting one condition. If ADC value is greater than 20 then action is ThingHTTP and perform this action http://imgur.com/a/OhoevIf you see my channel http://imgur.com/a/WqtOZ , ADC value is always greater than 20, that means it should react everytime. As according to this, it should perform an action which I defined in ThingHTTP. So, I am not sure if it is hitting ThingHTTP action GET https://api.thingspeak.com/apps/thinghttp/send_request?api_key=MY_KEYCan anyone suggest how I can check this ? if react is hitting an action or not ? I have this understanding that on meeting a condition it should call this URL https://api.thingspeak.com/apps/thinghttp/send_request?api_key=MY_KEY automatically. Please correct me If I am wrong ?", "num_user_post": " 1", "author": "ajaysaini"}, {"date": "May 22, 2017 - 4:41 pm", "content": "You could test your react by using your thingHTTP to write to a ThingSpeak channel.  Use the instructions https://www.mathworks.com/help/thingspeak/update-channel-feed.html to set your thingHTTP to publish to your channel (be careful with the two different API keys).  Have the thingHTTP post a unique value to your channel:URL https://api.thingspeak.com/updateMethod: POSTHeaders: Name: Content-TypeValue: application/x-www-form-urlencodedBody: api_key=THE_WRITE_API_KEY&field1=12345 Be sure to include the ampersand.Then use your browser to trigger it:https://api.thingspeak.com/apps/thinghttp/send_request?api_key=THING_HTTP_API_KEYOnce you see it worked, change the value 12345, and see if it gets triggered from the react. (you might have to wait ten minutes)", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/how-to-get-data-from-another-thingspeak-channel/", "posts": [{"date": "May 16, 2017 - 7:06 pm", "content": "'You can get data into a channel from a device, website, or another ThingsSpeak channel.'i'm newbie and i need help, sentence above written on thingspeak, how you can get data from other channel from thingspeak?", "num_user_post": " 3", "author": "daniliwar"}, {"date": "May 16, 2017 - 9:06 pm", "content": "You can fetch it using the web API see docs at https://au.mathworks.com/help/thingspeak/get-a-channel-feed.html  (the complete URL with all keys filled in is on the data import/export tab of your channel) or use the thingspeakread() function in a Matlab analysis.", "num_user_post": " 271", "author": "rw950431"}, {"date": "May 17, 2017 - 8:52 pm", "content": "Thank you. i will try that. hmm..and one more problem can I download channel in thingspeak with my localtime ? cause i always get UTC time, and i'm getting tired of change to my localtime every feed that i downloaded. ", "num_user_post": " 3", "author": "daniliwar"}, {"date": "May 18, 2017 - 3:11 am", "content": "From this docco link I sent to you earlier timezone (string) Identifier from Time Zones Reference for this request (optional) As shown in the example you have to URL-encode the timezone name", "num_user_post": " 271", "author": "rw950431"}, {"date": "May 18, 2017 - 11:06 pm", "content": "thank you for your help. now i can get 100 data with my timezone. and i get new problem is how to specify data based date and time that i need with my timezone.i try : https://api.thingspeak.com/channels/129650/feeds.csv?start=2017-01-10%2005:47:39&end=2017-01-10%2011:00:02?timezone=Asia%2FKuala_Lumpurcan i combine 2 parameter : timezone(), start() and end().", "num_user_post": " 3", "author": "daniliwar"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/thinghttp-post-notification-to-facebook/", "posts": [{"date": "May 3, 2017 - 4:37 am", "content": "Hi all,I want to use ThingHTTP to notification on facebook, I find this https://developers.facebook.com/docs/games/services/appnotificationsAnd I configured my ThingHTTPURL: https://graph.facebook.com/v2.9/{recipient_userid}/notifications?access_token={appaccess_token}&template=Hello, World!Method: POSTRemove HeadersOthers is default.When, I request this, responsed is -1 => request failedBut, When I try it on Postman same, it work and notification on my facebook. Help me. PleaseThank you.DuongThanh", "num_user_post": " 2", "author": "duongthanh3327"}, {"date": "May 3, 2017 - 9:26 am", "content": "Did you try GET instead of POST for the method?  You may also need to urlencode some of the characters in your string (such as the comma, space and exclamation mark)- perhaps just try with template=Hello for a start.", "num_user_post": " 271", "author": "rw950431"}, {"date": "May 3, 2017 - 12:42 pm", "content": "rw950431 said  Did you try GET instead of POST for the method?  You may also need to urlencode some of the characters in your string (such as the comma, space and exclamation mark)- perhaps just try with template=Hello for a start. Thanks rw950431!access_token certain '|', it's reason.I try '%7C' instead of '|' and it work.", "num_user_post": " 2", "author": "duongthanh3327"}]}]}