{"url": "https://community.thingspeak.com/forum/thingspeak-apps/page-2/", "threads": [{"url": "https://community.thingspeak.com/forum/thingspeak-apps/not-able-to-get-data-from-website-using-thinghttp-app/", "posts": [{"date": "May 3, 2018 - 11:31 am", "content": "Hello, i am new in thingspeak.I am working on a project in which wanted to get data from this website http://www.isstracker.com/ and the data I want is Longitude value from the website.I copied Xpath of the value and paste it inside the Parse String .After creating the api link , and opening link shows blank value as -000.000Please help me with this", "num_user_post": " 1", "author": "chetan"}, {"date": "May 4, 2018 - 10:11 am", "content": "The data you are trying to parse is updated by code that runs after the page is loaded.  That's why you see it update in real time.  When the page is first loaded, the value is -0.0.  ThingSpeak can retrieve the page, but it does not run all the code for you as well.  Here is a rest api you can use, and parse the JSON.https://wheretheiss.at/w/developerMake your thinghttp urlhttps://api.wheretheiss.at/v1/satellites/25544and then see the parse JSON example at the end of the thingHTTP page in the doc: https://www.mathworks.com/help/thingspeak/thinghttp-app.htmlLet us know if you get it working.", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/is-react-working-properly/", "posts": [{"date": "March 15, 2018 - 3:50 am", "content": "Hi First of all I'm very impressed with what Thingspeak came up with. It makes me wonder what would make sense to 'IoT' in my house and in my life.I have a problem though.I set up a channel (447365 - private) where I log temperatures of my boiler every 3 minutes with an ESP2866. I also set up a React that is supposed to tweet me (On Data Insertion) when a temperature raises above a certain level. I want it to only tweet once when the condition is met, therefore I set 'Run action only the first time the condition is met'.The twitter part works well, it tweets whenever the condition is met. The problem is that it tweets every time it's met, not only the first time. Even thoudh it's set to 'Run action only the first time the condition is met'.The data has no noise in it that would result the condition to go False and back to True.Thanks for your support! Condition TypeString Status Numeric Geo No Data CheckTest FrequencyOn Data Insertion Every 10 minutes Every 30 minutes Every 60 minutesConditionIf channelHeRo test (400669) Kotel_Heves (447365)field1 (Zpatecka) 2 (TUV) 3 (Topeni_Radiator) 4 (Okolni_teplota) 5 (TUV_Ohrev) 6 (Teplotni_Zisk_Kotle) 7 8is greater than is greater than or equal to is less than is less than or equal to is equal to is not equal toActionThingHTTP MATLAB Analysis ThingTweetthen tweetusing Twitter accountHeRo_IoTOptionsRun action only the first time the condition is metRun action each time condition is met", "num_user_post": " 6", "author": "hroobert"}, {"date": "March 15, 2018 - 3:56 am", "content": "Sorry for the listing above. (For some reason i can't edit the post)Here is the setup: Condition TypeNumericTest FrequencyOn Data InsertionConditionIf channel447365field5is greater than45ActionThingTweetthen tweet%%datetime%% ..message..using Twitter account[twitter account]Options Run action only the first time the condition is met", "num_user_post": " 6", "author": "hroobert"}, {"date": "March 15, 2018 - 3:25 pm", "content": "My single fire reacts worked once only as recently as a week or two ago. I just tried one out now with similar conditions as yours and I saw only one tweet for three channel updates with conditions that should have triggered the react.  Over how long did you see the behavior persist?", "num_user_post": " 401", "author": "cstapels"}, {"date": "March 16, 2018 - 4:31 am", "content": "I set this channel and it's triggers up about 3 days ago.The last set of triggers I got as shown in the screenshot below. I got 3 tweets when I should only have gotten the first one.https://photos.app.goo.gl/w0ZR1mGQSxrnuVBO2", "num_user_post": " 6", "author": "hroobert"}, {"date": "March 27, 2018 - 4:43 am", "content": "Any suggestion?", "num_user_post": " 6", "author": "hroobert"}, {"date": "March 27, 2018 - 8:51 am", "content": "I'm sorry to hear that your react is misbehaving.  Is the behavior still persisting?  I just repeated my test, and got one trigger from a react on four posts from an ESP8266-01.  Can you try erasing the react and setting up a new one?  The only differences I see are that you are posting to field 5 on a private channel and I am using field 1 of a public channel. If the behavior you see is still happening with a new react, then I will try it with the same conditions as yours.Are there regular updates to other fields of that channel? ", "num_user_post": " 401", "author": "cstapels"}, {"date": "April 6, 2018 - 12:30 am", "content": "I tried deleting and setting up a new one but the behavior is the same..https://photos.app.goo.gl/rCrZfR3TFPn88URj2https://photos.app.goo.gl/WNL8u9meP2k0KlPH3The other fields are getting regular updates, but I only have this one with a react that is supposed to run once when the condition is met.Thanks", "num_user_post": " 6", "author": "hroobert"}, {"date": "April 11, 2018 - 8:26 am", "content": "Thanks for giving a new react a try.  Do you have any other processes that are writing to the channel?  Perhaps if there were simultaneous writes to the channel it could cause the react to trigger multiple times.  Can you try removing the react again and then causing the original trigger condition to be true again?  Then see what happens with the channel values and the tweets.  I will attempt to replicate the process for a react to field 5, so it matches your conditions exactly.", "num_user_post": " 401", "author": "cstapels"}, {"date": "May 1, 2018 - 5:36 am", "content": "There is an analysis running on the channel but that is writing to a different field.The trigger keeps tweeting on every one of the instances when the condition is met, not only the first time the condition is met after the condition was not met.I believe i have it set up properly and that there is a bug in the system.", "num_user_post": " 6", "author": "hroobert"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/thingspeak-sampling-time/", "posts": [{"date": "April 30, 2018 - 12:56 am", "content": "hello everyone !currently i', doing the monitoring energy project. so i'm use the thingspeak database to record all the measured value of current, power and energy.can i know what is interval time for the data will stored in the tingspeak channel?", "num_user_post": " 3", "author": "alweerahman"}, {"date": "April 30, 2018 - 4:30 pm", "content": "Have a look at information for paid users https://www.mathworks.com/help/thingspeak/information-for-paid-users.htmland the faq page https://thingspeak.com/pages/license_faqAt present, free users can update channels every 15 seconds.  Most of the advanced licenses allow an update frequency of once per second.A comparison of available licenses is at https://thingspeak.com/prices/", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/help-please-trouble-integrating-thinghttp-react-app-ifttt-webhooks-maker-to-send-me-an-sms/", "posts": [{"date": "April 30, 2018 - 11:15 am", "content": "Hi all,I am new on ThingSpeak and need help for integrating ThingHTTP, React app and IFTTT Maker Webhooks.I want to send myself an SMS whenever the set condition on the ThingSpeak React app is met (and is plotted on the ThingSpeak channel). I am using the IFTTT Maker Webhooks to achieve this.This is the flow of my project, and my set parameters for ThingHTTP, react app, and IFTTT Maker Webhooks:1. Data from my device (digital vernier calliper) is sent via ESP8266 and is collected onto my ThingSpeak channel.2. I then created ThingHTTP with the set parameters:Name: BearingOverlimitURL: https://maker.ifttt.com/trigger/(__Enter event name here__)/with/key/(__ENTER key from IFTTT Webhooks Maker here__)Method: POSTContent type: application/jsonHTTP version: 1.1Host: ifttt.com/maker_webhooksBody: {'value1' : '%%channel_(ENTER CHANNEL ID)_field_1%%'}3. Next I created a React app with the set parameters:Name: BearingOverlimitCondition Type: NumericTest frequency: On data insertionCondition: if channel (set channel), field 1 is greater than 42Action: ThingHTTPThen performs: (select event name from drop down)Options: Run each time condition is met4. I created an applet on the IFTTT Maker Webhooks with the following parameters:If maker Event '(Enter event name)', then send me an SMS at 00(__ENTERCOUNTRYCODE__)(__ENTER PHONE NUMBER__)(update phone number)Send me an SMS with message: The event named '{{EventName}}' has a bearing diameter of {{Value1}}This does not work as I do not receive an SMS although the set condition is met.I have a feeling that my ThingHTTP is not communicating with the IFTTT Maker Webhooks.Could someone please kindly help me out? Are my parameters correct?photos are uploaded for reference.Thank you in advance!!!", "num_user_post": " 2", "author": "tiaratan"}, {"date": "April 30, 2018 - 4:18 pm", "content": "We have an example at https://www.mathworks.com/help/thingspeak/use-ifttt-to-send-text-message-notification.html if you haven't seet it already.  There is another similar example with a different workflow as well at https://www.mathworks.com/help/thingspeak/analyze-channel-data-to-send-email-notification-from-ifttt.htmlI would first try pasting the webhooks URL into your browser.  They also offer a testing page at IFTTT for the request when you set it up.  If you dont get a message when you manually trigger the webhooks event with a browser, there is a problem with the IFTTT setup.If the webhooks URL works, then you can try triggering the thingHTTP.  ThingHTTP can also be triggered by pasting the url with the thingHTTP api key.  See the settings page for the thingHTTP to find this URL.Reacts now show you the last time they were triggered.  You can see in the table if the react is being triggered.  In the settings you described above, I didn't see that you chose the name of the thingHTTP for your react, this may cause a disconnect. Unfortunately, I wasn't able to see the images you uploaded.  You can also cause the react to trigger manually but writing a field value that satisfies the react conditions.  See https://www.mathworks.com/help/thingspeak/writedata.html or your channel API keys page for the correct format to update your channel manually.", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/help-how-can-i-send-my-channel-data-to-xampp-server-database/", "posts": [{"date": "April 11, 2018 - 12:20 pm", "content": "I have an esp8266 connected to arduino and I am collecting data that I managed to store in a channel correctly. I want to connect that data in realtime automatically to my database on an xampp server and I cannot find a php code to do so.PLEASE HELP !!! ", "num_user_post": " 1", "author": "u14121001"}, {"date": "April 23, 2018 - 2:43 pm", "content": "This may be a roundabout method, but if you install a REST API  on your XAMPP server as described here (http://www.phpzag.com/create-simple-rest-api-with-slim-framework/)You can use the REST API to take data in to the server.  You can use the React app in ThingSpeak to run a MATLAB analysis every time the ESP8266 posts data to your channel.  In the MATLAB analysis, you can use webwrite() to generate the REST calls to your XAMPP server.A side note: have  a look at the examples in the documentation(https://www.mathworks.com/help/thingspeak/examples.html) .  Depending on the complexity of your sensors and the type of ESP8266 you have, you may be able to remove the Arduino and just use the ESP8266.", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/measuring-time-when-light-intensity-is-lowest/", "posts": [{"date": "April 2, 2018 - 8:54 pm", "content": "I'm having trouble trying to develop a function for comparing the data points I have collected from my light intensity sensor in order to see the period of  time when there is the lowest activity of light. I'm not familiar with programming so I appreciate all the help I can get.  Essentially, I have a light intensity sensor measuring the quality of light in a room which will be uploaded onto the ThingSpeaks server. So far I have been able to retrieve data points in a table format using under the Matlab Analysis App,readings = thingSpeakRead(ChannelID, 'Fields', 1,'NumPoints', 60, 'OutputFormat', 'table')However, I want to create a function that can see when the light quality value is low for a few occurrences, mark that time and then subtract it from the next time the light quality is at a higher value to figure out the longest time that the light level stays low. I am unsure about how to do this using the above function to retrieve the data thus far. My general idea is to find the first low value with the corresponding time, search through the rest of the data until a high value is present again with the corresponding time and then subtract both times under a table format. Ultimately, I want to use this data  as a proxy to see how much light impacts me when I sleep by using light quality as a factor.Does anyone have an idea of how this can be implemented or is there an easier way for me to obtain the results I want?", "num_user_post": " 1", "author": "applepie80"}, {"date": "April 3, 2018 - 9:24 am", "content": "Neat project.  I wonder what you are using to measure light level.  In phase II of the experiment you could measure the spectrum too.I would set up a timeControl that runs a MATLAB analysis daily, then writes your new values to another channel.There is presently a code template called 'Replace missing values in data' that will show you some of these techniques.Use thingSpeakRead() to get the data, you can use 'numDays', 1 or 'NumMinutes', 600 depending on when you set up the TimeControl and how long you sleep. data=thingSpeakRead(ChID,'fields',1,'NumMinutes',600,'OutputFormat','timetable');If you know the threshold for high and low data, you can use the find() function to separate the data.threshold=YY;lowIndex=find(data<threshold);highIndex=find(data>=threshold);If your channel writes occur at regular intervals, then the length of each index array will be proportional to the relative light and dark times.Then you can write the data to your other channel for later study.thingSpeakWrite(otherChID,'writeKey','XXXXXXXXXXXXXXXX','fields',[1 2], 'values',[length(lowIndex) length(highIndex)]); If you want to calculate each duration separately, you can loop through the timetable that you read in the analysis and add to the duration until the index array is non continuous. ... if(lowIndex(i)+1==lowIndex(i+1))..add duration...", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/android-app-development-codes/", "posts": [{"date": "March 17, 2018 - 2:57 am", "content": "I am new to ThingSpeak Iam trying create a android app.I need to read from a field and also write to another field.Please help me with java code for writing.Reading is ok. I will give url as the needed one and do GET request. But writing dont know..please help", "num_user_post": " 1", "author": "vichu95"}, {"date": "March 18, 2018 - 11:40 am", "content": "You can also write to a field using a GET request.  See the write data documentation for the correct format.  You can also see the format for writing to a channel when you click the API keys tab on your channel view.Welcome to ThingSpeak! Can you share what the app will do?", "num_user_post": " 401", "author": "cstapels"}, {"date": "March 20, 2018 - 4:43 am", "content": "Try My APP 🙂https://play.google.com/store/apps/details?id=com.alex93savari.Pulsy_Thingspeak", "num_user_post": " 2", "author": "hedwig"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/does-react-works-with-2-fields-from-the-same-channel/", "posts": [{"date": "March 16, 2018 - 2:45 pm", "content": "I'm trying to set 2 Reacts, one for each field of my channel (temperature and humidity), but, apparently, only 1 is fully working (the React for the temperature) while the other only work randomly, even if the condition it's achieved , some times the reaction (a tweet) doest not work.Can somebody help me? ", "num_user_post": " 2", "author": "dnsr03"}, {"date": "March 18, 2018 - 1:32 pm", "content": "Can you post some sample field values and the condition you have set?  I just set up a pair of reacts to trigger on field1 and field 2 of my test channel.My Reacts were set to trigger each time the condition is met.  It has a numeric condition to trigger a tweet when field1 is greater than 100 and another that triggers a tweet when field 2 is greater than 30.  I used the REST api to write to the channel with a GEThttps://api.thingspeak.com/update?api_key=XXXXXXXXXXXXXXXX&field1=110&field2=333and both tweets were posted within the same second. Are you posting from a device or from a web server?  It may also help to show us the format you are using to post values to your channel.", "num_user_post": " 401", "author": "cstapels"}, {"date": "March 19, 2018 - 5:01 pm", "content": "cstapels said  Can you post some sample field values and the condition you have set?  I just set up a pair of reacts to trigger on field1 and field 2 of my test channel. My Reacts were set to trigger each time the condition is met.  It has a numeric condition to trigger a tweet when field1 is greater than 100 and another that triggers a tweet when field 2 is greater than 30.  I used the REST api to write to the channel with a GET https://api.thingspeak.com/update?api_key=XXXXXXXXXXXXXXXX&field1=110&field2=333 and both tweets were posted within the same second.  Are you posting from a device or from a web server?  It may also help to show us the format you are using to post values to your channel.  I was getting the data from a sensor on an Arduino board, doing pretty much the same thing you described, with one react to tweet when field1 was greater than 28 and the other react to tweet when field2 was greater than 50. But for some reason, sometimes only the react for the field1 was tweeting and the second one not, even when the condition for the react of field2 was reached.But your answer solved my doubt. I will do more tests and see whats happen. thanks", "num_user_post": " 2", "author": "dnsr03"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/thinghttp-and-twilio/", "posts": [{"date": "February 16, 2018 - 4:05 pm", "content": "In ThingHTTP I'm attempting to send a single SMS through Twilio to two numbers. In the Body I usedFrom=+12345678910&To=+12345678910,+12345678910&Body=SMS Messagebut did not work. Can I send to two numbers if so what is the correct format or do I need separate REACT and THingsHTTP for each? Thanks", "num_user_post": " 1", "author": "RPAWx"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/integrating-thingspeak-with-zapier/", "posts": [{"date": "January 2, 2018 - 12:19 pm", "content": "I have an existing Arduino project implemented with Xively (originally pachube and then Cosm).  The free version of Xively is going away, so I'm reimplementing in thinggspeak.  I have the data uploading successfully to a channel, but I am having a devil of a time getting the react to post successfully from thinghttp to Zapier (which I use for generating asynchronous email updates).Has anyone successfully created a thingHttp that will trigger a zapier webhook?  I've tried eliminating the react, and just triggering the thingHttp using TimeControl, and I still don't get the PUT to Zapier successfully.", "num_user_post": " 2", "author": "martinknutson"}, {"date": "January 2, 2018 - 1:16 pm", "content": "martinknutson said  I have an existing Arduino project implemented with Xively (originally pachube and then Cosm).  The free version of Xively is going away, so I'm reimplementing in thinggspeak.  I have the data uploading successfully to a channel, but I am having a devil of a time getting the react to post successfully from thinghttp to Zapier (which I use for generating asynchronous email updates). Has anyone successfully created a thingHttp that will trigger a zapier webhook?  I've tried eliminating the react, and just triggering the thingHttp using TimeControl, and I still don't get the PUT to Zapier successfully.  And, of course, 15 minutes later, it starts working.  I spent some time debugging with curl, but in the end, I'm not sure what made it work.", "num_user_post": " 2", "author": "martinknutson"}, {"date": "January 2, 2018 - 1:38 pm", "content": "The best kind of problem to fix. I am happy that it is working now. Welcome to ThingSpeak!", "num_user_post": " 402", "author": "Hans"}, {"date": "January 17, 2018 - 7:42 am", "content": "Could you explain how you fixed this because i'm having the same problem??", "num_user_post": " 1", "author": "joe13varsamis"}, {"date": "February 14, 2018 - 5:46 pm", "content": "Must be in a parallel universe - Also a former Pachube,Cosm,Xively user trying to pass web hook to Rapier....This thread will be used countless time if you document what you did to fix it...", "num_user_post": " 2", "author": "Metawatch"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/how-to-get-json-data-from-thinghttp-api/", "posts": [{"date": "January 29, 2018 - 12:44 pm", "content": "Hi, I am new to Thingspeak and I am now struggling with the ThingHTTP. I am sending a http get request to receive data for my ESP8266. So far, everything is working perfectly well. My problem is that I need the data in the json format. Where can I specify, that thingspeak gives me a json format back to my get request? What do I have to type into the 'Content Type:' field?Thanks for your help", "num_user_post": " 1", "author": "lelopa"}, {"date": "January 31, 2018 - 9:38 am", "content": "Generally the HTTP requests end in the format you need (before the parameters).  Thingspeak supports JSON and XML for most endpoints.  Some of them also support TXT and CSV.For examplehttps://api.thingspeak.com/channels/12345678910/feeds.json?api_key=XXXXXXXXXXXXXXXX&results=2 will return 2 results from a private channel in JSON format.https://api.thingspeak.com/channels/987654321/fields/6.xml?days=2&location=truewill return 2 days of results from field 6 of channel 987654321 (up to 8000 entries) and include location information, as long as the channel is public.For GET requests, you do not need content type.  If you need to include that header, you can usually specify application/x-www-form-urlencoded unless you are using Bulk Update.Have a look at the REST API documentation for more info.", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/editing-json-output/", "posts": [{"date": "January 22, 2018 - 2:11 pm", "content": "Is it any way to edit my json channel feed output in ThingSpeak?", "num_user_post": " 1", "author": "buhh1231"}, {"date": "January 23, 2018 - 3:35 pm", "content": "Can you describe what you see and that you would like to see?  There are many parameters available, have a look at the get a channel feed doc.", "num_user_post": " 401", "author": "cstapels"}]}]}