{"url": "https://community.thingspeak.com/forum/thingspeak-api/page-39/", "threads": [{"url": "https://community.thingspeak.com/forum/thingspeak-api/feedback-wanted-changes-to-the-charts/", "posts": [{"date": "February 17, 2013 - 7:28 am", "content": "Based on the previous discussions about the charts, we're going to modify those to allow the 'dynamic' refreshes even if a 'grouping' parameter is added to the query.  I've got a couple ideas and wanted to mention them here to get some feedback on what our users think.1.  When an 'average' data series refreshes, the last data point will float as the average changes.  Every 15 seconds, the server will be queried.  If the average for that timeslice has changed, the chart will be updated to reflect the new value; otherwise, it won't change.  When sufficient time has gone by a new data point will be added to reflect the new timeslice and that point will begin to reflect the average.2.  Create Plugin Templates so multiple charts can be added for each data point.  A field could have two charts, one with the average and one with individual points.  This way dynamic data would be displayed every time your hardware sends an update, but the average chart would update more slowly to show accumulated data only.", "num_user_post": " 9", "author": "akinsgre"}, {"date": "February 20, 2013 - 8:24 am", "content": "hi,sound great!Number 1. is how the charts worked before? (We discussed it before in another topic.)At number 2. private and public view will stayed the same, and there will be possibility to create new plugin?Thanks!Pierre", "num_user_post": " 63", "author": "vespapierre"}, {"date": "February 24, 2013 - 9:05 am", "content": "1) Is not how it worked before.  What happened before was that the averages populated the initial chart, then individual points came in.  So the final points on a chart weren't averages, they were actual datapoints from the device being monitored.    My proposal is to update the last datapoint with a new average rather than just adding new 'non-averaged' points.2)  Private and public will stay the same.  You'll be able to add additional charts for a view so that there could be  public 'average' and a public with no calculations for the same feed.", "num_user_post": " 9", "author": "akinsgre"}, {"date": "February 26, 2013 - 8:10 am", "content": "I think number 2) would be great!", "num_user_post": " 63", "author": "vespapierre"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/what-happened-after-your-update-charts/", "posts": [{"date": "February 1, 2013 - 3:46 am", "content": "Hi Guys,after your new update the charts are getting smaller when next datapoint arrives. What happened? There are 'print the chart' and 'export' icons on all charts, thats great, but displaying is not ok! Thanks!", "num_user_post": " 63", "author": "vespapierre"}, {"date": "February 2, 2013 - 3:41 pm", "content": "Thanks for letting us know about the dynamic chart issues. We have discovered a bug in the chart library and will have a fix soon.", "num_user_post": " 402", "author": "Hans"}, {"date": "February 3, 2013 - 2:36 am", "content": "Hi, Many of the default graph options suddenly seem to be working less or not at all. When I for instance set the days option to 1 (nice addition !) and leave the results part empty I do get the data of the last day. If I however want to see the same data using an average, median or sum for each hour I only get one datapoint in the graph. For a oneday graph this is off course not an issue. But when I want to look at a longer dataspan and use for instance the 1440-average this would give me a nice graph that shows daily average electricity-usage. Unfortunately that type of graph seems to be non-functional currently. kind regardsCorBee", "num_user_post": " 37", "author": "CorBee"}, {"date": "February 5, 2013 - 7:43 am", "content": "Thanks Hans,please let us know, If you managed to fix the bug!At this moment it seems the dynamic functions is not working,in private and public view I can see only the datapoint in every half an hour. Before this it was working like let's say every half an hour, and when opening the http page new datapoints came when they have to ( let's say in arduino sketch in every 2 minutes for example ).And there is no time values on timeline.  Best regards, Pierre", "num_user_post": " 63", "author": "vespapierre"}, {"date": "February 6, 2013 - 3:59 am", "content": "Pierre,Can you let me know if the issue is still the same? We made some changes to when dynamic charts get initiated and this may be the cause. Let me know if you see something else that you do not expect.Thanks,Hans", "num_user_post": " 402", "author": "Hans"}, {"date": "February 6, 2013 - 7:49 am", "content": "Hi Hans, It seems that chart are not refreshing. (Dynamic function is lost). Maybe other users should check this too.There is too much space on the left side of the chart (Internet explorer) since you made changes.Thanks! Pierre", "num_user_post": " 63", "author": "vespapierre"}, {"date": "February 6, 2013 - 10:44 am", "content": "Update: in your homepage ( main) light level is updating dynamically, but there is too much space on the left side of the graph.On my channel (3426): no dynamic update, and only can see datapoints from every 30 minutes. That's totally different than before. It is the same in public and private view too... ", "num_user_post": " 63", "author": "vespapierre"}, {"date": "February 6, 2013 - 2:34 pm", "content": "Hi Pierre 1)  I'm not seeing the 'too much space on the left side' problem.  So you mean that the inside of the chart area isn't populated with data, or that the chart doesn't take up as much space on the homepage?  2)  What selections have you made on chart options?", "num_user_post": " 9", "author": "akinsgre"}, {"date": "February 7, 2013 - 3:19 am", "content": "Hi,1. Yes, I mean the chart doesn't take up much space as It was before. On Y axis my chart called Temperature celsius, and beside the Y axis name it has more space.2.Setting for the charts:type: lineDynamic: trueResults : 2000Timescale : 30With this settings it was fine before and it was dynamic…Because of dynamic functions for me Thingspeak was(is) the best! Hope it will be fixed***Update: removed the timescale 30 and datapoint are arriving. ( before this it was working with timescale 30 like: in the past datapoint were in every 30 minutes, and at the point of opening the page datapoints came in every X minutes, what the hardware did…)If you set a Timescale value, the graph lost its dynamic option, next point will be on the grahps just after refreshing the browserSpace problem at Y axis is still alive.", "num_user_post": " 63", "author": "vespapierre"}, {"date": "February 7, 2013 - 8:39 am", "content": "Thanks Pierre.  You can blame me for dropping the Dynamic when any of the 'Timeslice' functions are set (ie., Timescale, avg, median, etc..). I thought if a user was looking for accumulated values, then the dynamic feature isn't useful (because of the delay waiting for accumulated values). The way it worked before was slightly broken.  A chart would be initially populated with averaged values, for example.  But as dynamic updates came in, they would be raw data points without the average applied. Give me some feedback.  I'd love to make that more useful to you and all our users. Secondly, regarding the chart space.  I'm still not seeing that; maybe I don't remember the way it was before the update.  Is there any chance you have some screenshots from before that you could share with me?  If not, I'll try to put up an old version on my dev environment to compare. Thanks for your input.  It's great to hear from active users. Greg", "num_user_post": " 9", "author": "akinsgre"}, {"date": "February 7, 2013 - 10:19 am", "content": "Greg,I'm really happy that there are peoples who take care about the functions! So the way it was worked was really great for me, I don't know about other users. That was nice past values until displaying time and dynamic after displaying time even if it was brokenAbout the spaces:this is with timescale option,no dynamicand this is dynamic: Dynamic has more bigger space beside Y axis.because of spaces, qraphs aren't look so niceUnfortunately I do not have picture how looked like before,but I hope you'll see the problem.Before your updates it was heaven", "num_user_post": " 63", "author": "vespapierre"}, {"date": "February 7, 2013 - 2:03 pm", "content": "Important update: The problem what can be seen on the printscreen appears only if using IE8. With Firefox and Chrome it is working perfectly! I have realised it, because of using different PC-s and laptops.( regarding the space beside Y axis )", "num_user_post": " 63", "author": "vespapierre"}, {"date": "February 8, 2013 - 10:44 am", "content": "Thanks very much Pierre We tend to not use IE much around here.. so that slipped through the cracks.  Thanks for the heads up.  I'm a Mac user.. so I guess I'll have to fire up a VM and take a look at that. Regarding the updates of Dynamic, we'll see if we can get something back into an upcoming release to deal with that.   Thanks for your time and patience!", "num_user_post": " 9", "author": "akinsgre"}, {"date": "February 12, 2013 - 3:56 am", "content": "Thanks for the answer, I'm waiting to hear about upcoming release! You are great guys, just go on!:)", "num_user_post": " 63", "author": "vespapierre"}, {"date": "February 13, 2013 - 1:42 am", "content": "Just one more important notice: after your last release update browser needs more memory and cpu to draw the graph!so on the same machine the same graph is slower to daw.", "num_user_post": " 63", "author": "vespapierre"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/update-data-with-date-and-time/", "posts": [{"date": "January 28, 2013 - 5:30 pm", "content": "Just new (2 weeks) and had a look and tested the API.Everything seems to work as documented.However how can an application (microcontroller) update missing data if a crash has happend (on the microcontroller) but the data is available on the microcontroller side?I can upload CSV (history) data myself and that works, but looking at the API and parameters there are no parameters/datafields for date and time.I hope this is possible via the Updating a Channel “Get” method. I hope the problem is clear.", "num_user_post": " 2", "author": "EnergyViewPV"}, {"date": "January 30, 2013 - 11:24 am", "content": "Hi! You can specify a timestamp with a query parameter likecreated_at=2013-01-12T12:14:03Z  this works for me and the opensource api, honestly i don't know if i have patched that in or if it works out of the box... Is your username a description of your project? Could you share some details? Michael", "num_user_post": " 3", "author": "mik"}, {"date": "January 31, 2013 - 3:06 pm", "content": "Michael thanks for the info.I will try this weekend and see if it works. Why is this parameter not mentioned in the API? username is indeed a description of the project.First step is to upload every parameter that my inverter can measure. At the moment nothing is logged in any way. Next step will be to combine the info of an inverter with logging with this one an create the total picture. WORKS!! (more or less)adding the 'created_at=2013-02-05T21:49:00+01:00' adds points at a time but in this example local time is 21:49 and the timezone is Amsterdam (+1) the points get added at  22:49:00 which i don't want.I'm trying to avoid summer/winter time problems (gaps + doubles in time) but i'm not sure how to do this.", "num_user_post": " 2", "author": "EnergyViewPV"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/updating-using-python/", "posts": [{"date": "January 25, 2013 - 3:40 am", "content": "", "num_user_post": " 1", "author": "naesk"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/posting-channel-status-updates/", "posts": [{"date": "January 20, 2013 - 2:05 pm", "content": "When I post a status update using 'status':'text' it posts ok but disappears after about an hour. Can this be changed or is there another way so that it displays, for example, 'about 5 hours ago'?", "num_user_post": " 1", "author": "petethespark"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/65535-and-0-instead-of-field-values/", "posts": [{"date": "January 15, 2013 - 9:12 am", "content": "Hi,Yesterday i had to clear one of my 7 channels. As my Zibase was posting temperatures values I was only receiving 65535 or 0 values in my chart. It sounds like a interger overflow but why ?I haven't change anything, my other channels are still working properly. Pierre", "num_user_post": " 9", "author": "kulgan"}, {"date": "January 15, 2013 - 3:12 pm", "content": "I am not familiar with the Zibase. We would not insert those values into the channel, so it must be hardware related.If you want to filter odd values from your charts, you can add min=1 and max=65534 - this would not display the 0 and the 65535 values.", "num_user_post": " 402", "author": "Hans"}, {"date": "January 17, 2013 - 6:15 pm", "content": "Hi, Sorry it's my fault !!! It seems my Zibase doesn't understand négatives values, and it's under zero now in Paris !I was certain to manage this case but I have to correct my script … So thingspeak is OK ! Regards, Pierre", "num_user_post": " 9", "author": "kulgan"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/what-is-the-development-status-of-thingspeak/", "posts": [{"date": "November 23, 2012 - 10:36 am", "content": "It seems development on the project has pretty much stalled out and has been dead for a couple of years. Why is this?  Have the developers lost interest?  Is there a better platform that they have moved on to?  Or something else? While I read the occasional promise for an API 'update', there hasn't been any in a long time.  What's up? Thanks", "num_user_post": " 4", "author": "zzyzxx"}, {"date": "November 26, 2012 - 12:05 pm", "content": "The project is only 2 years old (publicly), so it has not been dead for a 'couple of years'. There is lots of activity for ThingSpeak, in fact it is growing really fast. We doubled in size in the past 6-8 months. The API hosted at ThingSpeak.com has gone through much development and new features added. I have not blogged about each one, but I am planning a post that summarizes all of the changes. People have noticed all of the changes as they discussed quite a bit on other forums.We have over 6000 users in the different versions of ThingSpeak, most come from ThingSpeak.com and hosted versions, and 1000 come from the GitHub version of ThingSpeak. I think the API updates you are referring to are with the GitHub API version, we are behind on that as internally we are focused first on the hosted version of ThingSpeak, then rolling out updates to GitHub. The next update is large just to play catch up with the two different versions.If you are looking for particular features, it would be helpful if you are vocal about them, so we can prioritize internal development. You can submit features suggestions  / enhancements here and on GitHub (github you tag an issue as an enhancement).For latest news:Follow the blog - http://community.thingspeak.com/Tweets by thingspeakhttps://www.facebook.com/iobridgeSet a google alert for 'thingspeak' and you will get flooded with updates from other places around the web. ThingSpeak grows when it's developer count and activity grows and the project is going really, really well from all aspects except that we have to keep expanding – it is bigger today than any day previous. ", "num_user_post": " 402", "author": "Hans"}, {"date": "November 26, 2012 - 6:48 pm", "content": "OK sorry Hans I did not mean to offend you! However, 2 years in code/Internet time is an eternity.  And with GitHub showing virtually no changes in 2 years, I (incorrectly) assumed the development had stopped.  Now I understand development hasn't stopped, it's just not being documented properly on GitHub, in the API documentation, or in the blog.  I'm sure you can understand those conditions make it virtually impossible to understand what all the updates and improvements are - hence my confusion over what is going on with ThingSpeak and IOBridge! When do you expect the updates to be listed on GitHub? Thanks!", "num_user_post": " 4", "author": "zzyzxx"}, {"date": "November 27, 2012 - 1:27 am", "content": "No offense... just realized that it does say updated two years ago on GitHub. Most of those files do not change often, so I can see what you are saying. We did update the translator a couple of weeks ago, but that is lost in the mix.Updating the GiTHub repo is on the list, but I will tell you that we hear way more about the hosted version. I don't have a date to share. Also, with the Raspberry Pi being an embedded computer - there is a group of users porting ThingSpeak so it will run on the Raspberry Pi. I think that will give the GitHub version a big kick.", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/update-of-opensource-api-on-github/", "posts": [{"date": "September 20, 2012 - 1:44 pm", "content": "Hello ! I like to work with your OpenSource API on my Servers but compared to your API running on thingspeak.com the OpenSource API seems a little bit outdated.A lot of parts of the code are about a year old, last updates seven months.I appreciate the free service of thingspeak.com offers for people that cant afford or run their own servers, but there are a lot of users that feel better with their data on their own servers. Do you plan an update of the OpenSoruce API in near future ? Kind Regards fire", "num_user_post": " 2", "author": "fire"}, {"date": "September 21, 2012 - 12:06 am", "content": "Hi fire,Yes, we have plans on updating the GitHub for the open source API in the coming weeks. There are 10 updates or so that we have to make and the API part will be current. Thanks for checking. We are glad that people still want to download the source and run it home servers. You should be able to run what is there, since most of the changes are to how the charts gets data out and how we filter out data on the outbound side. The core mechanics will stay the same.Hans", "num_user_post": " 402", "author": "Hans"}, {"date": "September 21, 2012 - 3:18 am", "content": "Hi Hans!Good to hear that the opensource-api will be further updated. Could you please explain how to report bugs in the source code? or where to suggest improvements? Github? Forum? Mail? Michael", "num_user_post": " 3", "author": "mik"}, {"date": "September 21, 2012 - 4:02 pm", "content": "Hi Michael,I think GitHub issue tracker is a good place. You can tag bugs, enhancements, etc. Let us know what you have.Hans", "num_user_post": " 402", "author": "Hans"}, {"date": "October 23, 2012 - 3:33 pm", "content": "I just wanted to add that I, too, will be looking forward to updates on the opensource api. Keep up the good work!", "num_user_post": " 1", "author": "easterro"}, {"date": "October 24, 2012 - 3:48 am", "content": "I wait for Opensource API updates eagerly. The Average and Rounding filters wont work reliably and the output getsslower and slower every day ... ", "num_user_post": " 2", "author": "fire"}, {"date": "October 30, 2012 - 11:32 am", "content": "Fire,What parts of the average and rounding are not working?We don't have any open bugs on that part, so I wanted to make sure we have that working properly for your app.A common mistake is using a time period that is not supported, such as average=7, 7 is not a valid time period and will default back to having no averaging.This is the line that defines the time periods: 10, 15, 20, 30, 60, 240, 720, 1440 (Line 201 of thingspeak / app / controllers / feed_controller.rb).We are still working on the updates, but the core API calls will not be affected much.Hans", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/is-it-possible-to-fix-axes-range-on-charts/", "posts": [{"date": "September 26, 2012 - 6:35 am", "content": "Hi,I collect temperature data from 5 sources. The actual collection and display works fine but instead of having a chart display with a 'window' of temperature, can it display with a fixed range. I would like to see my hot-water temp chart from 0 to 100 as the temperature axis but it always seems to fit the data into a window within the range of max/min.Is it possible to have a chart display this way?Thanks.", "num_user_post": " 3", "author": "StewieT"}, {"date": "October 17, 2012 - 8:00 am", "content": "I'm also waiting for this basic feature ! Thomas", "num_user_post": " 5", "author": "tparvais"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/api-posting/", "posts": [{"date": "October 4, 2012 - 5:23 pm", "content": "Hi. Using the code below, I get this error message:  Connecting Arduino to network...Arduino connected to network using DHCPMy IP address: 192.168.64.105.Posting...Connection to ThingSpeak failed (1)Posting...Connection to ThingSpeak failed (2)Posting...Connection to ThingSpeak failed (3) --------------------------------I'm on a corporate network, and these are my settings for the Device:   TitleDevice 1459ModelArduinoPublic IP Address192.168.64.105Public Port Number Local IP Address Local Port Default Gateway IP Subnet Mask MAC Address9A-A9-23-42-1E-4D Any advice is greatly appreciated... Matt -------------------------------------  #include <SPI.h>#include <Ethernet.h>// Local Network Settingsbyte mac[] = { 0x9A, 0xA9, 0x23, 0x42, 0x1E, 0x4D}; // Must be unique on local network// ThingSpeak Settingschar thingSpeakAddress[] = 'api.thingspeak.com';String writeAPIKey = [removed]const int updateThingSpeakInterval = 16 * 1000;      // Time interval in milliseconds to update ThingSpeak (number of seconds * 1000 = interval)// Variable Setuplong lastConnectionTime = 0; boolean lastConnected = false;int failedCounter = 0;// Initialize Arduino Ethernet ClientEthernetClient client;void setup(){  // Start Serial for debugging on the Serial Monitor  Serial.begin(9600);    // Start Ethernet on Arduino  startEthernet();}void loop(){  // Read value from Analog Input Pin 0  String analogPin0 = String(analogRead(A0), DEC);    // Print Update Response to Serial Monitor  if (client.available())  {    char c = client.read();    Serial.print(c);  }  // Disconnect from ThingSpeak  if (!client.connected() && lastConnected)  {    Serial.println('...disconnected');    Serial.println();        client.stop();  }    // Update ThingSpeak  if(!client.connected() && (millis() - lastConnectionTime > updateThingSpeakInterval))  {    updateThingSpeak('field1='+analogPin0);  }    // Check if Arduino Ethernet needs to be restarted  if (failedCounter > 3 ) {startEthernet();}    lastConnected = client.connected();}void updateThingSpeak(String tsData){  if (client.connect(thingSpeakAddress, 80))  {              Serial.println('Posting...');    client.print('POST /update HTTP/1.1n');    client.print('Host: api.thingspeak.comn');    client.print('Connection: closen');    client.print('X-THINGSPEAKAPIKEY: '+writeAPIKey+'n');    client.print('Content-Type: application/x-www-form-urlencodedn');    client.print('Content-Length: ');    client.print(tsData.length());    client.print('nn');    client.print(tsData);        lastConnectionTime = millis();        if (client.connected())    {      Serial.println('Connecting to ThingSpeak...');      Serial.println();            failedCounter = 0;    }    else    {      failedCounter++;        Serial.println('Connection to ThingSpeak failed ('+String(failedCounter, DEC)+')');         Serial.println();    }      }  else  {    failedCounter++;        Serial.println('Connection to ThingSpeak Failed ('+String(failedCounter, DEC)+')');       Serial.println();        lastConnectionTime = millis();   }}void startEthernet(){    client.stop();  Serial.println('Connecting Arduino to network...');  Serial.println();   // delay(1000);    // Connect to network amd obtain an IP address using DHCP  if (Ethernet.begin(mac) == 0)  {    Serial.println('DHCP Failed, reset Arduino to try again');    Serial.println();  }  else  {    Serial.println('Arduino connected to network using DHCP');    Serial.println();     Serial.print('My IP address: ');  for (byte thisByte = 0; thisByte < 4; thisByte++) {    // print the value of each byte of the IP address:    Serial.print(Ethernet.localIP()[thisByte], DEC);    Serial.print('.');   }    Serial.println();      }    delay(1000);}  ", "num_user_post": " 1", "author": "greennomad"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/how-to-change-appearance-of-public-charts/", "posts": [{"date": "September 25, 2012 - 11:31 am", "content": "Ok, I realize this is probably a really dumb n00b question, but how exactly does one change the appearance of the charts?For example, the default x-axis label is 'Date'.  Since it's not date, but rather time, I'd like to change it to 'Time'.I cannot seem to figure this out!TIA", "num_user_post": " 4", "author": "zzyzxx"}, {"date": "September 25, 2012 - 3:19 pm", "content": "TIA,All you have to do is sign in, view your channel, and select the Public View. On any of the charts that you want to change, click on the 'pencil' icon. One of the fields is X-axis, so go ahead and enter what you want to say.I did this for one of my channels: https://thingspeak.com/channels/3Let us know if that helps,Hans", "num_user_post": " 402", "author": "Hans"}, {"date": "September 25, 2012 - 4:31 pm", "content": "Thanks Hans.  That works...Is it possible to change the embedded public chart size?  Or use something like thishttp://api.thingspeak.com/channels/3164/charts/1?width=900&height=320&max=100&min=0&results=360&days=7&dynamic=true&yaxis=x-axis&xaxis=Time&title=Flux%20Intensity?", "num_user_post": " 4", "author": "zzyzxx"}, {"date": "September 25, 2012 - 5:22 pm", "content": "Unfortunately, on the channel page, we use a fixed window size. ", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/errors-updating-channels/", "posts": [{"date": "September 18, 2012 - 10:27 pm", "content": "I'm new to this, so I'm probably doing something stupid, but after hours of searching I can't really say what it is I'm doing wrong.I'm trying to update my channel with some data in a little Processing (Java) app. Both GET and POST are failing on me. Here is the code I'm using for GET:String data = 'field1=' + mCurrentTemperature;String apiKey = 'V8BTEQWV9A8FRQ3U';mClient = new Client(this, 'api.thingspeak.com', 80);mClient.write('GET /update?key=' + apiKey + '&amp;field1=' + mCurrentTemperature + ' HTTP/1.0n');mClient.write('Host: 127.0.0.1nn');The response I get is this:HTTP/1.1 301 Moved PermanentlyServer: nginx/0.8.53Date: Wed, 19 Sep 2012 03:21:06 GMTContent-Type: text/htmlContent-Length: 185Connection: closeLocation: https://www.thingspeak.com/?key=V8BTEQWV9A8FRQ3U&amp;field1=73.292<html><head><title>301 Moved Permanently</title></head><body bgcolor='white'><center><h1>301 Moved Permanently</h1></center><hr><center>nginx/0.8.53</center></body></html>Which seems weird to me.Perhaps even weirder is when I try to use POST:String data = 'field1=' + mCurrentTemperature;String apiKey = 'V8BTEQWV9A8FRQ3U';  mClient = new Client(this, 'api.thingspeak.com', 80);mClient.write('POST /update HTTP/1.1n');mClient.write('Host: api.thingspeak.comn');mClient.write('Connection: closen');mClient.write('X-THINGSPEAKAPIKEY: ' + apiKey + 'n');mClient.write('Content-Type: application/x-www-form-urlencodedn');mClient.write('Content-Length: ');mClient.write( data.length() );mClient.write('nn');mClient.write( data );The response I get back from that is:Client says: HTTP/1.1 411 Length RequiredServer: nginx/0.8.53Date: Wed, 19 Sep 2012 03:24:59 GMTContent-Type: text/htmlContent-Length: 181Connection: close<html><head><title>411 Length Required</title></head><body bgcolor='white'><center><h1>411 Length Required</h1></center><hr><center>nginx/0.8.53</center></body></html>But I've specified Content-Length explicitly. Am I calculating it wrong?I'm really hoping someone can shed some light on what's going here because I'm totally stumped!", "num_user_post": " 1", "author": "amcclung"}, {"date": "September 19, 2012 - 11:03 pm", "content": "Hmm… everything looks right. What microcontroller is sending that request?Can you try making the GET HTTP 1.1?", "num_user_post": " 402", "author": "Hans"}]}]}