{"url": "https://community.thingspeak.com/forum/thingspeak-plugins/page-1/", "threads": [{"url": "https://community.thingspeak.com/forum/thingspeak-plugins/public-plugin/", "posts": [{"date": "August 22, 2015 - 5:49 am", "content": "Good morning everyone, I am a new user and I have a stupid problem, after updating the site https://thingspeak.com/ not find the flag to make public more plugins ... sorry for the stupid question but are 2 days I try the site. thank yougianlucaP.S. sorry for my english, I'm Italian", "num_user_post": " 4", "author": "giangist"}, {"date": "August 22, 2015 - 11:16 am", "content": "Hi gianluca,Can you describe a little more what you're trying to make public?  On channels, it's on the channel options tab, about 2/3s of the way down.  Then click (Save Channel).   On the visualizations, choosing public on the edit screen makes it available on the public display associated with any of your channels.-Rob", "num_user_post": " 47", "author": "Rob Purser"}, {"date": "August 22, 2015 - 4:00 pm", "content": "Hello Rob, thanks for your answer, I can not make public various plugins google gauge that I created long ago ... before there was a check box to be ticked before saving but now is no longer present ... thanksgianluca", "num_user_post": " 4", "author": "giangist"}, {"date": "August 25, 2015 - 9:38 pm", "content": "Same problem here.  Plugins are not working on the public page.", "num_user_post": " 1", "author": "AdamJWood"}, {"date": "August 27, 2015 - 3:26 am", "content": "Yep same here. 'Make Public' tick box has vanished from Google gauge. Happened during the layout change I think. Tick box is still visible in Matlab visualizations.", "num_user_post": " 2", "author": "sh-323"}, {"date": "August 27, 2015 - 5:17 pm", "content": "Ok! Now is ok!", "num_user_post": " 4", "author": "giangist"}, {"date": "August 27, 2015 - 5:18 pm", "content": "Ok! Now is ok!", "num_user_post": " 4", "author": "giangist"}, {"date": "September 3, 2015 - 3:34 am", "content": "Hi everyone, I've got the same problem.giangist : how did you manage to make your Google gauge public ?", "num_user_post": " 1", "author": "icetea06"}, {"date": "September 3, 2015 - 4:20 pm", "content": "Public Plugins:We have made changes to public plugins. We are looking at new visualizations (as in MATLAB Visualizations) and new ways to make public displays of data and controls without writing custom JavaScript. We are making updates and hopefully this will address the custom public plugins.MATLAB Visualizations can be added to public channel views.Here's some code to show the latest value using MATLAB Visualizations:currentTemp = thingSpeakRead(12397,'Field',4);annotation('textbox',[0.2 0.2 0.6 0.6],...    'HorizontalAlignment','center',...    'VerticalAlignment','middle',...    'LineStyle','none',...    'String',[num2str(currentTemp) '°F'],...    'FontSize',72);", "num_user_post": " 402", "author": "Hans"}, {"date": "September 6, 2015 - 5:21 am", "content": "Hello, same problem here. Plugins are not working on the public page. 'Make Public' tick box has vanished from Google gauge plugin.Please fix this problem.", "num_user_post": " 1", "author": "xkosm"}, {"date": "October 16, 2015 - 8:24 pm", "content": "Hi there,After a few hours of frustration trying to figure out why my newly created temperature gauge couldn't be added to my public channel, I finaly found this page. I'm not sure why this feature was removed. I think it's much cooler to have a gauge than just the text displaying the temperature.It would be nice if the 'Make Public' feature would be added back!Cheers", "num_user_post": " 3", "author": "mschutze"}, {"date": "October 18, 2015 - 2:45 am", "content": "mschutze said Hi there,After a few hours of frustration trying to figure out why my newly created temperature gauge couldn't be added to my public channel, I finaly found this page. I'm not sure why this feature was removed. I think it's much cooler to have a gauge than just the text displaying the temperature.It would be nice if the 'Make Public' feature would be added back!CheersI'm all for", "num_user_post": " 19", "author": "kniazio"}, {"date": "November 4, 2015 - 12:30 pm", "content": "mschutze said Hi there,After a few hours of frustration trying to figure out why my newly created temperature gauge couldn't be added to my public channel, I finaly found this page. I'm not sure why this feature was removed. I think it's much cooler to have a gauge than just the text displaying the temperature.It would be nice if the 'Make Public' feature would be added back!CheersHi.Same here.Very frustrating to see some nice public channel with this gauge pluging working, and could´t get your own, even another pluging.Best regards.", "num_user_post": " 1", "author": "arssant"}, {"date": "November 12, 2015 - 5:25 am", "content": "Hello,I am also facing the same issue. I have created a custom plugin. I can visualize it in my private view, but not on the public view.Could you suggest, how can I visualize it on public view as well.Best regards.", "num_user_post": " 3", "author": "kanishk.chaturvedi"}, {"date": "November 19, 2015 - 4:33 pm", "content": "My tip is to take the code out of the edit boxes and put together a simple display site elsewhere for your gauge 🙂", "num_user_post": " 1", "author": "Jw1342"}, {"date": "December 17, 2015 - 10:14 am", "content": "The same me... I am trying to make it public a few days, before I found this topic - new account, new chanel,....", "num_user_post": " 9", "author": "m-blue"}, {"date": "December 21, 2015 - 8:37 am", "content": "Can we get an update on this please?  The inability to display public plugins is very limiting, and this issue has been an open one for months.  Could the public plugin feature be reactivated while you work on a more permanent solution?", "num_user_post": " 1", "author": "DeKay"}, {"date": "December 28, 2015 - 3:43 am", "content": "When will be possible to make profile / gauge public? Is it in plans or it will stay like now?", "num_user_post": " 9", "author": "m-blue"}, {"date": "January 12, 2016 - 10:39 pm", "content": "As others have mentioned this is very frustrating.   This is a great (essential) feature.  What are the plans?", "num_user_post": " 1", "author": "tech.roberts"}, {"date": "January 17, 2016 - 3:43 pm", "content": "Please add this option back.", "num_user_post": " 4", "author": "fanest"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-plugins/writing-a-generic-plugin/", "posts": [{"date": "July 16, 2014 - 3:19 pm", "content": "I'm interested in writing a generic / reusable plugin for Thingspeak. But all the examples I've seen are hard coded to call the API with a specific channel ID (and API_KEY if required) to get the feed data. Is there a way for the plugin to get the 'current' channel who's page it's installed on?", "num_user_post": " 2", "author": "Resseguie"}, {"date": "July 16, 2014 - 4:05 pm", "content": "Hi,I just wrote a simple plugin that should allow you to get the channel ID depending on the channel page it exists on: https://thingspeak.com/plugins/4482 .  Just view-source, and you should see the JavaScript code that should help you out.lee", "num_user_post": " 457", "author": "lee"}, {"date": "July 17, 2014 - 2:23 pm", "content": "Makes sense, thanks. Any thoughts on private channels that would require an API key?", "num_user_post": " 2", "author": "Resseguie"}, {"date": "July 17, 2014 - 2:33 pm", "content": "It's a little more complicated, but you could extract the API keys from a JSON list of your channels.  Please see 'List My Channels' under the documentation here: https://thingspeak.com/docs/channels#index .lee", "num_user_post": " 457", "author": "lee"}, {"date": "August 20, 2018 - 7:36 am", "content": "This is indeed possible by using that channel API call, although it only works for the plugins when the are embedded in the channel page (iframe). When you detach the plugin to display it into a separate window/tab, it doesn't have any reference to the channel anymore, so you'd need a fallback channel + api key. Here's an example.You can get your User API key from Account > Profile (https://thingspeak.com/account/profile).code here: https://pastebin.com/ikSCch3k(couldn't find any way to post code to this forum without losing formatting)", "num_user_post": " 1", "author": "Spreeuw"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-plugins/google-gauge-blocking-channel/", "posts": [{"date": "July 30, 2018 - 10:02 am", "content": "Hi!I put Google Gauge in my chaneel and played around with settings a little bit. It seems I somehow set a few settings wrong, so Google Gauge now prevents page to be loaded fully. Can I temporary disable this gauge?", "num_user_post": " 7", "author": "matjaz1118"}, {"date": "July 30, 2018 - 10:29 am", "content": "matjaz1118 said Hi!I put Google Gauge in my chaneel and played around with settings a little bit. It seems I somehow set a few settings wrong, so Google Gauge now prevents page to be loaded fully. Can I temporary disable this gauge?  Same for me! My channel is blocked, hanging....", "num_user_post": " 15", "author": "fmarzocca"}, {"date": "July 30, 2018 - 10:43 am", "content": "I have also cleared the channel, with the result to delete all points, but it is still hanging!Pls  suggest a solution...", "num_user_post": " 15", "author": "fmarzocca"}, {"date": "July 30, 2018 - 12:41 pm", "content": "Can you please clarify:  Did you add the gauge using the gauge widget on your channel, or using the plugins app?", "num_user_post": " 401", "author": "cstapels"}, {"date": "July 30, 2018 - 4:23 pm", "content": "cstapels said Can you please clarify:  Did you add the gauge using the gauge widget on your channel, or using the plugins app?  Using the gauge widget on the channel, through the web browser.", "num_user_post": " 15", "author": "fmarzocca"}, {"date": "July 30, 2018 - 6:31 pm", "content": "I did it using gauge widgaet, also", "num_user_post": " 7", "author": "matjaz1118"}, {"date": "July 31, 2018 - 12:26 pm", "content": "I managed to remove the gauge from the page and now I have my channel back!", "num_user_post": " 15", "author": "fmarzocca"}, {"date": "August 1, 2018 - 7:43 pm", "content": "fmarzocca said I managed to remove the gauge from the page and now I have my channel back!  How did you manage to do that?", "num_user_post": " 7", "author": "matjaz1118"}, {"date": "August 2, 2018 - 9:10 am", "content": "Thanks for reporting this. We've rectified your particular gauge settings on the server side.The issue turns out that setting the tick interval to a small number relative to the range of the gauge results in the browser trying to draw too many ticks, causing the browser to hang. We will be putting in checks in the code to prevent this from happening in the future.", "num_user_post": " 225", "author": "Vinod"}, {"date": "August 2, 2018 - 2:03 pm", "content": "matjaz1118,Is your channel/gauge still stuck?", "num_user_post": " 401", "author": "cstapels"}, {"date": "August 2, 2018 - 7:32 pm", "content": "It gout unstuck, but then i accidently changed the tick back to 0.01 and it got stuck again 🙁 BTW, min and max values of my gague are 0 and 0.5", "num_user_post": " 7", "author": "matjaz1118"}, {"date": "August 5, 2018 - 4:32 pm", "content": "Vinod said Thanks for reporting this. We've rectified your particular gauge settings on the server side.The issue turns out that setting the tick interval to a small number relative to the range of the gauge results in the browser trying to draw too many ticks, causing the browser to hang. We will be putting in checks in the code to prevent this from happening in the future.  Vinod, can you please change my gauge settings again. I promiss, I won't change them back to 0.01 again 🙂", "num_user_post": " 7", "author": "matjaz1118"}, {"date": "August 13, 2018 - 1:04 pm", "content": "HiMy cahnnel is still stuck. Can you pleas help me. My channel ID is: 486008", "num_user_post": " 7", "author": "matjaz1118"}, {"date": "August 13, 2018 - 5:03 pm", "content": "A fix will be deployed shortly. Please check back on Wednesday or Thursday (August 15th or 16th).", "num_user_post": " 225", "author": "Vinod"}, {"date": "August 15, 2018 - 3:30 pm", "content": "My cahnnel is working again! Thankyou for the fix.", "num_user_post": " 7", "author": "matjaz1118"}, {"date": "August 15, 2018 - 11:29 pm", "content": "Thank you for your patience as we resolved this.Hopefully now no matter what setting you put in, the gauge setting auto adjusts itself to prevent this situation 🙂", "num_user_post": " 225", "author": "Vinod"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-plugins/creating-pluging-to-show-house-map-with-last-temp-data-as-overlay-in-multiple-points/", "posts": [{"date": "July 5, 2018 - 5:11 am", "content": "Greetings,I have been looking on the net for a while now and have not seen anyone done this in simple way yet ( my coding skills at current is almost none exsisting ).I have Arduino NodeMCU's gathering temperatures info from my house. I use Blynk (at current, but adding also now direct path to thingSpeak also) to gather the data on App , but what I really would like to is create a map of the house and have as overlay last channel information on specific locations.I have read sample (tutorials) on here like creating a overlay map ( https://se.mathworks.com/help/thingspeak/create-heatmap-overlay-image.html) and how t get data from channels but that where my skills hit a wall.Has anyone create anything like that and how would one start to work on it ?", "num_user_post": " 1", "author": "Soiski71"}, {"date": "July 9, 2018 - 3:18 pm", "content": "I also want to make such a 2D overlay based on real time data.  I think it would be even better if it had 3D projections and animation of time-lapse data.  I'm working on it slowly.What else would you like to do that is not demonstrated in the heatmap demo?  Do you have your temperature data posted to thingspeak channels?I think the next step after that is to generate the base map to put the heatmap overlay onto.  If you don't have an online file already, you can generate on in MATLAB.For example, see https://www.mathworks.com/help/matlab/ref/rectangle.html.rectangle('Position',[1 2 5 6])axis([0 10 0 10])The next step it to aggregate the data from thingspeak, and then generate the overlay.  Let us know if you get stuck.", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-plugins/gauge-widget-min-value-bug/", "posts": [{"date": "June 10, 2018 - 9:02 am", "content": "Hi ThingSpeak Community 🙂i've tried out the new ThingSpeak Gauge Widget. When I set the min value to 0 or smaller everything works perfect. But when I set the min value to 900 and max to 1100 (I want to display the air pressure in hPa) the Gauge still starts at 0, without ticks until 900. I 've tried differnt combinations of options, but always when min is bigger than 0 this bug appears.Link of my Gauge: https://thingspeak.com/channels/508946/widgets/3826Are there any fixes?Thank you for your help!Niko", "num_user_post": " 3", "author": "nikwer"}, {"date": "June 10, 2018 - 3:08 pm", "content": "Thanks for pointing that out.  I was able to reproduce this issue in my channel.  We will check it out and get back to you shortly.", "num_user_post": " 401", "author": "cstapels"}, {"date": "June 16, 2018 - 11:53 am", "content": "cstapels said Thanks for pointing that out.  I was able to reproduce this issue in my channel.  We will check it out and get back to you shortly.  Hi cstapels,do you know when there will be a fix?Thank YouNiko", "num_user_post": " 3", "author": "nikwer"}, {"date": "June 20, 2018 - 8:40 pm", "content": "Hi cstapels,Also in edit window (the pencil, to change things) you edit the title, it is changed, it persist in the edit window ... but it is NOT reflected in the channel window.The others fields in the edit window are changed and the changes are reflected.So your only chance is to write the title once, the first time when creating the widget Thank You", "num_user_post": " 91", "author": "piajola"}, {"date": "June 20, 2018 - 11:25 pm", "content": "The widget title will be saved after editing. However, today you will need to refresh the channel page to see the new title. This and the other issues reported in this thread will be resolved shortly. One of us will post an update once this is done. You will not need to make any changes on your channel/widget settings to see the fixes.Thank you for your patience as we resolve these issues.", "num_user_post": " 225", "author": "Vinod"}, {"date": "June 22, 2018 - 12:42 am", "content": "Thank you Vinod,We patiently wait for the fixes, no worries at all, and again thank you for the great work ", "num_user_post": " 91", "author": "piajola"}, {"date": "June 27, 2018 - 10:14 am", "content": "Hi folks,The issues reported on this thread are all addressed. Please try it out and let us know.We'd also like to hear from our users about additional widgets you want to see on ThingSpeak.-Vinod", "num_user_post": " 225", "author": "Vinod"}, {"date": "June 27, 2018 - 1:49 pm", "content": "Hi Vinod,Just see my channel and see the gauges are OKSeems good, any issues (I do not think so) will tell hereAgain thank you very much for your work ", "num_user_post": " 91", "author": "piajola"}, {"date": "June 27, 2018 - 6:07 pm", "content": "Hallo Vinod,Now it works for my Pressure Gauge. Thank you so much, great work. Best wishesNiko", "num_user_post": " 3", "author": "nikwer"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-plugins/apply-a-formula-yax-b-on-temperature-sensor-readings/", "posts": [{"date": "June 14, 2018 - 11:47 am", "content": "hi.how to step make formula to in coming data?for ex   :     y=ax+bi use DHT11 for temperature and humidity readingsand Wemos D1 and channel thingspeak https://thingspeak.com/channels/514292thank you", "num_user_post": " 2", "author": "danu"}, {"date": "June 20, 2018 - 7:39 am", "content": "addressed similar post here: https://community.thingspeak.com/forum/thingspeak-plugins/apply-a-formula-to-incoming-data/#p6362", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-plugins/apply-a-formula-to-incoming-data/", "posts": [{"date": "May 7, 2015 - 5:59 am", "content": "Hi,Is it possible to create a plugin in which a formula is applied to data? I mean I have raw data coming from the sensor and I want the chart displaying converted value, let's say:Y=aX+bwhere, X is raw data sent from sensor and Y is converted data that I want to displayThanks,Rodri", "num_user_post": " 19", "author": "rodri"}, {"date": "May 7, 2015 - 8:51 am", "content": "Hi Rodri,Yes this is possible, but you'll have to know JavaScript and manipulate the data points directly after they're retrieved but before the chart is drawn.lee", "num_user_post": " 457", "author": "lee"}, {"date": "May 8, 2015 - 1:25 am", "content": "Hi Rodri   I did something similar with https://thingspeak.com/plugins/3339. In my case to convert steadily-rising counter values into a rate according to the formula (this_count-last_count)/(this_time-last_time)  Hopefully you can 'view page source' to get the code. Thingspeak doesnt have a lot of support for sharing details of public plugins.", "num_user_post": " 271", "author": "rw950431"}, {"date": "June 30, 2015 - 4:54 am", "content": "Yes finally I also used plugins. Thank you very much", "num_user_post": " 19", "author": "rodri"}, {"date": "June 14, 2018 - 11:30 am", "content": "may i know how to Apply a formula y = ax + b to incoming data in thingspeak?i need it", "num_user_post": " 2", "author": "danu"}, {"date": "June 19, 2018 - 10:01 am", "content": "danu,Would it be acceptable to apply to formula after you get the data in a channel?  I would recommend you write the data to a channel and then use a MATLAB analysis script to read the data, apply the formula, and then write the data to another channel.  There are several good tutorials that show this kind of work flow.  For example the get started tutorial:https://www.mathworks.com/help/thingspeak/getting-started-with-thingspeak.htmlor the wind chill tutorial:https://www.mathworks.com/help/thingspeak/calculate-wind-chill.htmlThese tutorials also show how to set up a time control to perform the formula application on a regular schedule.If you want to apply the formula each time new data is posted, you can use the react app.  Here is an explanation of that work flow:https://www.mathworks.com/help/thingspeak/monitor-channel-inactivity-using-multiple-thingSpeak-apps.html", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-plugins/plugin-to-create-buttons-to-send-talkback-commands/", "posts": [{"date": "June 28, 2014 - 1:56 pm", "content": "Is it possible to create a plugin to create buttons to send TalkBack commands?  A point in the right direction would be appreciated.Regards,", "num_user_post": " 4", "author": "bborncr"}, {"date": "June 29, 2014 - 1:08 pm", "content": "Hi,Yes you can create a plugin to send TalkBack commands.  The easiest way to do this would be to create a HTML button, add an 'onclick' event handler, and then use jQuery.ajax() ( http://api.jquery.com/jQuery.ajax/ ) to send the command data to ThingSpeak ( https://thingspeak.com/docs/talkback#add_command ).  Please let me know if you need further help!lee", "num_user_post": " 457", "author": "lee"}, {"date": "June 30, 2014 - 5:08 pm", "content": "Thanks for the reply.  I tried the following which doesn't seem to be working:https://thingspeak.com/plugins/4376/edit", "num_user_post": " 4", "author": "bborncr"}, {"date": "June 30, 2014 - 8:30 pm", "content": "Hi,I can't view your plugin, it's currently set to 'private'.  Please edit the plugin and uncheck the 'private' field and I'll take a look at it.lee", "num_user_post": " 457", "author": "lee"}, {"date": "June 30, 2014 - 10:12 pm", "content": "The private field is unchecked.  I just went in and saved it again.  It's still unchecked.", "num_user_post": " 4", "author": "bborncr"}, {"date": "July 1, 2014 - 1:58 am", "content": "Hi,Sorry you're right, the plugin is public, the link was just to the edit page which I couldn't access.In your code, it may be helpful to update jQuery to a newer version.  Also, your post function looks like it should be changed to:$.post('https://api.thingspeak.com/talkbacks/499/commands.json?apikey=MYAPIKEY&command_string=TURN_ON&position=1');The turnOff function should follow the same format.  Also make sure to set MYAPIKEY correctly to your TalkBack API key.lee", "num_user_post": " 457", "author": "lee"}, {"date": "July 1, 2014 - 5:37 am", "content": "That was it!  Just sloppy syntax errors!Thanks,", "num_user_post": " 4", "author": "bborncr"}, {"date": "December 28, 2014 - 12:20 am", "content": "I see there isn't a button example posted in the forums yet.  I need help implementing a Talkback button.  This is that I have now that doesn't return anything using the 'execute' API.HTML Window between body:  (arrows left out on purpose)button onclick='myFunction()'>Click me</buttonAnd Javascript window:function myFunction(){$.post('https://api.thingspeak.com/talkbacks/1026/commands.json?apikey=[MYKEY]&command_string=TURN_ON&position=1');}Thank you.Scott", "num_user_post": " 3", "author": "zesty"}, {"date": "December 29, 2014 - 9:29 am", "content": "Hi Scott,Can you provide me with the ID of your plugin (or its URL) and I'll take a look at it?lee", "num_user_post": " 457", "author": "lee"}, {"date": "December 29, 2014 - 10:59 am", "content": "Here it is.  I don't know what I'm doing.    As far as I'm concerned, I'd settle for the easiest means to send TalkBack commands from a weblink or button on webpage.   https://thingspeak.com/plugins/6998", "num_user_post": " 3", "author": "zesty"}, {"date": "December 29, 2014 - 1:43 pm", "content": "Hi Scott,It looks like your code is correct, but you need to add a link to the jQuery library so that your JavaScript will run correctly.  In the head tags inside the body section, add the following line:Here's a full example that I made: https://thingspeak.com/plugins/6664 .lee", "num_user_post": " 457", "author": "lee"}, {"date": "December 29, 2014 - 2:07 pm", "content": "This is fantastic.  Thank you!I'd suggest adding this code to the TalkBack documentation as an example.", "num_user_post": " 3", "author": "zesty"}, {"date": "June 3, 2018 - 4:51 pm", "content": "Hello Everyone,I made a toggle button just like you guys discribe. But How am I going to read the value from arduino uno? I want to turn on-off a servo motor. Thank you all.", "num_user_post": " 2", "author": "mehmetalisubasi"}, {"date": "June 10, 2018 - 5:21 pm", "content": "mehmetalisubasi,Does your application need to read the value from the arduino?  You could just have the Arduino poll the thingspeak channel and change its servo power on state to match the state of the channel.You can use the talkback app to queue commands and then have the arduino poll for commands in the queue.  You can use MQTT to subscribe to the channel, and then the MQTT broker will push updates to your device when the channel value is changed.Here is a particle photon example for MQTT subscribe.https://www.mathworks.com/help/thingspeak/use-particle-photon-client-to-subscribe-to-channel-updates.htmlYou can do similar things on an arduino with the pubsub library.You can also just make a loop in your arduino code that polls the channel continuously to look for a change, like this cheerlights example:https://community.thingspeak.com/tutorials/arduino/cheerlights-with-arduino-and-the-fastled-library/Here is an example for reading from and writing to ThingSpeak with the Communication library.https://www.mathworks.com/help/thingspeak/rapid-prototyping-with-thingspeak.htmlIf you really need the arduino to write the state to your channel, then use the writing part of the examples (write with the REST API), or MQTT publish to put the state of the servo into your channel.", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-plugins/customization-of-chart-with-multiple-series/", "posts": [{"date": "June 6, 2018 - 10:39 am", "content": "Dear Users,I have 5 individual charts who get data from a physical object I made using the 'Particle Photon Board'. It is a cube with 5 buttons. Each buttons sends out a '1' if it is pressed. Each button is unique and has its own webhook and channel.Now I am trying to make 1 chart which contains all 5 charts and displays them over a 7 day period (1 week). But I still have some issues, for example, even tho all my 'yaxismin' are 0, the yaxis of my 'Chart With Multiple Series' is -0,5.In this line I added the 'yaxismin=0' like you would in any individual chart. This works with 'days=7', 'round=0', ... BUT NOT WITH yaxismin???// get the data with a webservice call    $.getJSON('https://api.thingspeak.com/channels/' + channel_id + '/fields/' + field_number + '.json?offset=0&min=0&round=0&yaxismin=0&days=14&results=' + results + '&api_key=' + api_key, function(data) {On my website, you can see the individual channels which I want to combine into 1, maybe you know a better way to do this?THE MAIN GOAL IS to make it easy to see WHEN, HOW MANY TIMES and WHAT was pressed (buttons on my object) in 1 simple graph...https://thingspeak.com/apps/plugins/232782Help?MY JAVASCRIPT CODE:  // variables for the first series  var series_1_channel_id = 483067;  var series_1_field_number = 1;  var series_1_read_api_key = '';  var series_1_results = 60;  var series_1_color = '#d62020';  // variables for the second series  var series_2_channel_id = 483130;  var series_2_field_number = 1;  var series_2_read_api_key = '';  var series_2_results = 60;  var series_2_color = '#00aaff';  // variables for the second series  var series_3_channel_id = 483146;  var series_3_field_number = 1;  var series_3_read_api_key = '';  var series_3_results = 60;  var series_3_color = '#32a9d8';  // variables for the second series  var series_4_channel_id = 483147;  var series_4_field_number = 1;  var series_4_read_api_key = '';  var series_4_results = 60;  var series_4_color = '#63d832';  // variables for the second series  var series_5_channel_id = 487759;  var series_5_field_number = 1;  var series_5_read_api_key = '';  var series_5_results = 60;  var series_5_color = '#d832d8';  // chart title  var chart_title = 'Care-Cube';  // y axis title  var y_axis_title = 'Samenvatting';  // user's timezone offset  var my_offset = new Date().getTimezoneOffset();  // chart variable  var my_chart;  // when the document is ready  $(document).on('ready', function() {    // add a blank chart    addChart();    // add the first series    addSeries(series_1_channel_id, series_1_field_number, series_1_read_api_key, series_1_results, series_1_color);    // add the second series    addSeries(series_2_channel_id, series_2_field_number, series_2_read_api_key, series_2_results, series_2_color);    // add the second series    addSeries(series_3_channel_id, series_3_field_number, series_3_read_api_key, series_3_results, series_3_color);    // add the second series    addSeries(series_4_channel_id, series_4_field_number, series_4_read_api_key, series_4_results, series_4_color);    // add the second series    addSeries(series_5_channel_id, series_5_field_number, series_5_read_api_key, series_5_results, series_5_color);  });  // add the base chart  function addChart() {    // variable for the local date in milliseconds    //var localDate;    // specify the chart options    var chartOptions = {      chart: {        renderTo: 'chart-container',        defaultSeriesType: 'spline',        backgroundColor: '#ffffff',        events: { }      },      title: { text: chart_title },      plotOptions: {        series: {          marker: { radius: 3 },          animation: true,          step: false,          borderWidth: 0,          turboThreshold: 0        }      },      tooltip: {        // reformat the tooltips so that local times are displayed        formatter: function() {          var d = new Date(this.x + (my_offset*60000));          var n = (this.point.name === undefined) ? '' : '' + this.point.name;          return this.series.name + ':' + this.y + '' + n + '' + d.toDateString() + '' + d.toTimeString().replace(/(.*)/, '');        }      },      xAxis: {        type: 'datetime',        title: { text: 'Date' }      },      yAxis: { title: { text: y_axis_title } },      exporting: { enabled: false },      legend: { enabled: false },      credits: {        text: 'ThingSpeak.com',        href: 'https://thingspeak.com/',        style: { color: '#D62020' }      }    };    // draw the chart    my_chart = new Highcharts.Chart(chartOptions);  }  // add a series to the chart  function addSeries(channel_id, field_number, api_key, results, color) {    var field_name = 'field' + field_number;    // get the data with a webservice call    $.getJSON('https://api.thingspeak.com/channels/' + channel_id + '/fields/' + field_number + '.json?offset=0&min=0&round=0&yaxismin=0&days=7&results=' + results + '&api_key=' + api_key, function(data) {      // blank array for holding chart data      var chart_data = [];      // iterate through each feed      $.each(data.feeds, function() {        var point = new Highcharts.Point();        // set the proper values        var value = this[field_name];        point.x = getChartDate(this.created_at);        point.y = parseFloat(value);        // add location if possible        if (this.location) { point.name = this.location; }        // if a numerical value exists add it        if (!isNaN(parseInt(value))) { chart_data.push(point);}      });      // add the chart data      my_chart.addSeries({ data: chart_data, name: data.channel[field_name], color: color });    });  }  // converts date format from JSON  function getChartDate(d) {    // offset in minutes is converted to milliseconds and subtracted so that chart's x-axis is correct    return Date.parse(d) - (my_offset * 60000);  }", "num_user_post": " 10", "author": "SenneHoekman"}, {"date": "June 10, 2018 - 5:08 pm", "content": "I would write a MATLAB visualization that plots the series on a single plot, and then you can embed the visualization wherever you like. (after you set the visualization as public.See this tutorial for an example of several plotshttps://www.mathworks.com/help/thingspeak/Compare-Temperature-Data-from-Three-Different-Days.htmlAdditionally see the regular MATLAB plot function help for examples on plotting multiple series.Does this solution provide the type of visualization you would like to see?", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-plugins/why-is-chart-with-multiple-series-limited-to-private-view-is-there-a-way-to-make-this-public-easily/", "posts": [{"date": "June 6, 2018 - 1:03 pm", "content": "In my html file it says:         NOTE: This plugin will not be visible on public views of a channel.        If you intend to make your channel public, consider using the        MATLAB Visualization App to create your visualizations.But MATLAB is no good, since it does not feature interactive content (in 'Chart With Multiple Series' you can hover over elements and see details).Can I make it so my 'Chart With Multiple Series' is viewable for everyone so I can place it on my website?For now it just looks like this: http://sennehoekman.be/masterproef/index2.htmlOn my pc, I can view it no problem, on any other device the frame is empty and says: 'The author made this visualisation private.'I am the author and I DO NOT WANT THIS PRIVATE...<!--    //ajax.googleapis.com/ajax/libs/jquery/1.9.1/jquery.min.js//thingspeak.com/highcharts-3.0.8.js//thingspeak.com/exporting.js    %%PLUGIN_CSS%%    %%PLUGIN_JAVASCRIPT%%    [Image Can Not Be Found]  -->", "num_user_post": " 10", "author": "SenneHoekman"}, {"date": "June 6, 2018 - 4:00 pm", "content": "You can take the HTML, CSS and Javascript that you put into the plugin on ThingSpeak and host it on your website. ThingSpeak would provide the data storage, from which your website could pull the data and render the plugin. You'd need to embed your channel's read API key in the JS hosted on your website.", "num_user_post": " 225", "author": "Vinod"}, {"date": "June 6, 2018 - 4:47 pm", "content": "Vinod said You can take the HTML, CSS and Javascript that you put into the plugin on ThingSpeak and host it on your website. ThingSpeak would provide the data storage, from which your website could pull the data and render the plugin. You'd need to embed your channel's read API key in the JS hosted on your website.  I did an exact copy of the HMTL, CSS and Javascript, and when I run it I get: %%PLUGIN_CSS%% %%PLUGIN_JAVASCRIPT%% Ajax loader...Not even integrated in my website and it still doesn't show anything...", "num_user_post": " 10", "author": "SenneHoekman"}, {"date": "June 6, 2018 - 5:13 pm", "content": "Copy the CSS and put it in place of %%PLUGIN_CSS%% in the HTML. Likewise, replace %%PLUGIN_JAVASCRIPT%% with the JS in your HTML. That should fix it.See the JSFiddle here:https://jsfiddle.net/dtvw18os/5/", "num_user_post": " 225", "author": "Vinod"}, {"date": "June 6, 2018 - 5:24 pm", "content": "Vinod said Copy the CSS and put it in place of %%PLUGIN_CSS%% in the HTML. Likewise, replace %%PLUGIN_JAVASCRIPT%% with the JS in your HTML. That should fix it.  Still nothing...Here is the txt file containing everything (without the API keys of course)http://sennehoekman.be/masterproef/Newvisuals.txtAnd this is the result I should get: https://thingspeak.com/apps/plugins/232782", "num_user_post": " 10", "author": "SenneHoekman"}, {"date": "June 6, 2018 - 5:27 pm", "content": "Sorry JS fiddle isn't updated. See this:https://jsfiddle.net/t6a3xqL5/", "num_user_post": " 225", "author": "Vinod"}, {"date": "June 6, 2018 - 5:29 pm", "content": "Vinod said Sorry JS fiddle isn't updated. See this:https://jsfiddle.net/t6a3xqL5/  Uhm, what am I suppose to do with this?", "num_user_post": " 10", "author": "SenneHoekman"}, {"date": "June 6, 2018 - 5:40 pm", "content": "See this:https://jsfiddle.net/yv7mknp0/Click the 'Run' button on the top left.Is that what you want embedded on your site? If so, modify the HTML of your website to include the HML, CSS and JS.", "num_user_post": " 225", "author": "Vinod"}, {"date": "June 6, 2018 - 5:46 pm", "content": "Vinod said See this:https://jsfiddle.net/yv7mknp0/Click the 'Run' button on the top left.Is that what you want embedded on your site? If so, modify the HTML of your website to include the HML, CSS and JS.  This is what I want on my site but whatever I do, it won't show up on my website... 🙁My iframe on my website shows: File is possibly moved or deleted.Here: https://jsfiddle.net/SenneHoekman/0eL8hxvj/There is the embed option to generate an iframe, which I was already using for inidividual channels from Thingspeak, but this iframe does not work...", "num_user_post": " 10", "author": "SenneHoekman"}, {"date": "June 6, 2018 - 6:02 pm", "content": "SenneHoekman said This is what I want on my site but whatever I do, it won't show up on my website... 🙁My iframe on my website shows: File is possibly moved or deleted.Here: https://jsfiddle.net/SenneHoekman/0eL8hxvj/There is the embed option to generate an iframe, which I was already using for inidividual channels from Thingspeak, but this iframe does not work...  DUDE, you are awesome! It wasn't working because I was viewing it locally, when I checked it after putting it online, IT WORKS! THANKS!!!", "num_user_post": " 10", "author": "SenneHoekman"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-plugins/led-status-plugin/", "posts": [{"date": "April 24, 2018 - 9:38 am", "content": "Hello.I connected a LED to ESP8266 and I want to see in Thingspeak if the LED is on or off.Is there any plugin that can do this?Thanks,Oleks.", "num_user_post": " 3", "author": "oleksid"}, {"date": "April 24, 2018 - 11:16 am", "content": "Try the attached code. Type in the HTML into the HTML section of a plugin, the CSS into the CSS section of the plugin, and the Javascript into the Javascript section of the plugin.You will need to modify the JavaScript code with your channel ID and API key.", "num_user_post": " 225", "author": "Vinod"}, {"date": "April 26, 2018 - 4:20 am", "content": "Hello.Thank you a lot.In arduino IDE, how can I write the code to this plugin?", "num_user_post": " 3", "author": "oleksid"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-plugins/plugin-show-onoff-devices/", "posts": [{"date": "February 25, 2017 - 2:13 am", "content": "Hi, I need pligin, which would show the logical state of various devices such as on / off light (no graph). Perhaps as a site where it would be five wheels (signal LED) show  red ON, white OFF. It is possible to create such a plugin for Thinkspeak? Excuse my English 😉", "num_user_post": " 6", "author": "Maco33"}, {"date": "February 25, 2017 - 2:15 pm", "content": "It is pretty easy to create a custom plugin for it. Below is an example of a status LED.1) Create a new plugin on ThingSpeak2) In the HTML section put this:<html><head>%%PLUGIN_CSS%% %%PLUGIN_JAVASCRIPT%%</head><body> <p>Status LED</p> </div></body></html>3) In the CSS section put this<style type='text/css'>.led-box { height: 30px; width: 25%; margin: 10px 0; float: left;}.led-box p { text-align: center; margin: 1em;} .red-led { margin: 0 auto; width: 40px; height: 40px; background-color: #F00; border-radius: 50%; box-shadow: rgba(0, 0, 0, 0.2) 0 -1px 7px 1px, inset #441313 0 -1px 9px, rgba(255, 0, 0, 0.5) 0 2px 12px;}.green-led { margin: 0 auto; width: 40px; height: 40px; background-color: #0F0; border-radius: 50%; box-shadow: rgba(0, 0, 0, 0.2) 0 -1px 7px 1px, inset #304701 0 -1px 9px, #89FF00 0 2px 12px;}</style> 4) In the Javascript section put this: https://ajax.googleapis.com/ajax/libs/jquery/1.9.1/jquery.min.jshttps://www.google.com/jsapi google.setOnLoadCallback(initChart); // load the data function loadData() {// get the data from thingspeak $.getJSON('https://api.thingspeak.com/channels/YOUR CHANNEL NUMBER HERE/feed/last.json?api_key=CHANNEL API READ KEY HERE, function(data) {// get the data point p = data.field1; q = document.getElementById('LED');// if there is a data point display it if (p && q) { if (p>100){ q.className = 'red-led'; } else {q.className = 'green-led';} } }); } // initialize the chart function initChart() { loadData(); // load new data every 15 seconds setInterval('loadData()', 1000); }5) Add the plugin that you just created to the channel's private or public viewYou can easily extend this concept to create any plugin you wish if you know HTML, Javascript and some CSS.", "num_user_post": " 225", "author": "Vinod"}, {"date": "February 25, 2017 - 6:39 pm", "content": "Make a modification to the above, change the javascript logic to:// get the data point p = (Date.now() - new Date(data.created_at)) / (60*1000); q = document.getElementById('LED');// if there is a data point display it if (p && q) { if (p>5){ q.className = 'red-led'; } else {q.className = 'green-led';} } This will make the status LED go red if the channel was updated over 5 minutes ago. ", "num_user_post": " 225", "author": "Vinod"}, {"date": "February 25, 2017 - 6:45 pm", "content": "The forum software seems to have mangled my example's HTML section. It is missing an HTMLdiv id='LED' just before the  <p> status LED </p>", "num_user_post": " 225", "author": "Vinod"}, {"date": "February 26, 2017 - 5:17 am", "content": "Thank you very much, I'm going to study 😉 ", "num_user_post": " 6", "author": "Maco33"}, {"date": "March 1, 2017 - 8:11 am", "content": "Hi Vinod, so I modified it a bit and it works. Please could you create JAVA script for at least two LEDs(Channels 2 and ...), that I knew how to continue? HTML and CSS, I learned a little bit, but I do not learned  JavaScript yet.Thank you very much.", "num_user_post": " 6", "author": "Maco33"}, {"date": "April 24, 2018 - 9:43 am", "content": "Hello.I tried to apply this to see the LED status connected to ESP8266 but I wasn’t successful.Is there another code that I can use?Thanks,Oleks.", "num_user_post": " 3", "author": "oleksid"}]}]}