{"url": "https://community.thingspeak.com/forum/thingspeak-api/page-12/", "threads": [{"url": "https://community.thingspeak.com/forum/thingspeak-api/mqtt-not-working/", "posts": [{"date": "September 30, 2017 - 10:35 am", "content": "Hello,i have a device that has been posting data for a long time. It’s based on ESP8266 and uses pub sub as mqtt library. About a day ago data disappeared from the dashboard. I am traveling so I don’t have physical access but I see that it is working nicely as it also syslogs locally. I reset it from remote but no help. Sys log says it can’t connect to mqtt. Firmware has not changed, connectivity is in place and tested. Has anything changed on the thingspeak side?anyone having similar issues?thanks!", "num_user_post": " 10", "author": "MarcFinns"}, {"date": "October 2, 2017 - 9:58 am", "content": "There are no reported issues with the MQTT publish functionality at this time. The team confirmed this by testing from multiple networks.", "num_user_post": " 225", "author": "Vinod"}, {"date": "October 4, 2017 - 9:53 am", "content": "Vinod said  There are no reported issues with the MQTT publish functionality at this time. The team confirmed this by testing from multiple networks.  Hello Vinod, I also tested with IoT devices and it can be reproduce easily just by using the bare-bones demo sketch of the ubiquitous PubSub library: https://github.com/knolleary/pubsubclient/blob/master/examples/mqtt_esp8266/mqtt_esp8266.inoMost of the times it returns code MQTT_CONNECT_UNAUTHORIZED  5 and sometimes MQTT_CONNECTION_TIMEOUT   -4My device has been running for months on the same firmware but it suddenly stopped on Friday September 29 at 1:49PM (GMT+2).Please note that I was traveling in another continent so for sure nobody changed anything on my side...May I ask you to submit this info to the team?Thanks for your time!", "num_user_post": " 10", "author": "MarcFinns"}, {"date": "October 4, 2017 - 10:19 am", "content": "Vinod said There are no reported issues with the MQTT publish functionality at this time. The team confirmed this by testing from multiple networks.  Vinod, it does not even work anymore with your own example!https://nl.mathworks.com/help/thingspeak/use-arduino-client-to-publish-to-a-channel.html", "num_user_post": " 10", "author": "MarcFinns"}, {"date": "October 4, 2017 - 12:16 pm", "content": "I just tried the example you linked to and I was able to get it to work.However, I did need to change the client ID in the code to something unique.Line 73, changed from:   if (mqttClient.connect('ArduinoWiFi101Client'))to   if (mqttClient.connect('MyClient12345'))There can be only one client at a time connected to the MQTT broker with a particular client ID.  So in my case someone was already connected with 'ArduinoWiFi101Client'.   If you are using a generic client ID in your code, it is possible that another user is has decided to use the same client ID and is interfering with your device's ability to connect.It looks like the ESP8266 code you referenced does take this into account by appending a timestamp to the client ID.  That would help ensure that your ID is unique.We're going to update the examples in the documentation so that others don't get hit with this issue.", "num_user_post": " 34", "author": "JasonW"}, {"date": "October 4, 2017 - 1:39 pm", "content": "JasonW said I just tried the example you linked to and I was able to get it to work. However, I did need to change the client ID in the code to something unique. Line 73, changed from:   if (mqttClient.connect('ArduinoWiFi101Client'))to   if (mqttClient.connect('MyClient12345')) There can be only one client at a time connected to the MQTT broker with a particular client ID.  So in my case someone was already connected with 'ArduinoWiFi101Client'.    If you are using a generic client ID in your code, it is possible that another user is has decided to use the same client ID and is interfering with your device's ability to connect. It looks like the ESP8266 code you referenced does take this into account by appending a timestamp to the client ID.  That would help ensure that your ID is unique. We're going to update the examples in the documentation so that others don't get hit with this issue.   Hello JASONW, I strongly believe you introduced a bug in your server code.My device has a truly unique ID. I assure no other device has it... and still cannot connect for days now.Since then it has been retrying to no avail. Changing the ID works again, but i guess your server does not handle the connect/disconnect every minute, meaning it does not forget the device upon disconnect.", "num_user_post": " 10", "author": "MarcFinns"}, {"date": "October 4, 2017 - 2:43 pm", "content": "Server bug confirmedEven changing the ID, after a few iteration it starts failing.The only way to have it somewhat working is to generate every time a random ClientID. Not sure if this is the way it is designed...In any case it often fails with -4 (MQTT_CONNECTION_TIMEOUT).Any chance you guys could take a look at it?THANKS A MILLION", "num_user_post": " 10", "author": "MarcFinns"}, {"date": "October 5, 2017 - 6:41 am", "content": "I've just had two channels stop reporting via MQTT as well.They have been both reporting for months without a problem and both suddenly can't connect to the broker regardsmutton", "num_user_post": " 1", "author": "mutton"}, {"date": "October 5, 2017 - 10:15 am", "content": "Something else to try is adding a username and password to the connection request.  The additional parameters help the broker differentiate clients with the same the client ID.For Publish operations the choice of a username and password are not important, you can use anything.  In the code it would looks like this: if(mqttClient.connect('MyVeryUniqueClientID_6F1EBB','SomeUsername','SomePassword'))", "num_user_post": " 34", "author": "JasonW"}, {"date": "October 5, 2017 - 2:51 pm", "content": "JasonW said Something else to try is adding a username and password to the connection request.  The additional parameters help the broker differentiate clients with the same the client ID.JasonW, the broker gets often confused even when the clientID is very unique...!Any chance this new behaviour could be reported to the dev team?thanks!", "num_user_post": " 10", "author": "MarcFinns"}, {"date": "October 5, 2017 - 4:19 pm", "content": "MarcFinns,We have many many other MQTT clients that are publishing data without issue. There were no changes to our server near the Sept 29th.  So I'm trying to understand what is different in your case.Did you try adding the username and password?  I am on the dev team. I'm asking you to try that for a specific reason as the result will help steer the troubleshooting effort.Also if you can send me the client ID (or partial client ID) you are using, I can look through the server logs for additional details.", "num_user_post": " 34", "author": "JasonW"}, {"date": "October 5, 2017 - 4:33 pm", "content": "JasonW said MarcFinns, We have many many other MQTT clients that are publishing data without issue. There were no changes to our server near the Sept 29th.  So I'm trying to understand what is different in your case. Did you try adding the username and password?  I am on the dev team. I'm asking you to try that for a specific reason as the result will help steer the troubleshooting effort. Also if you can send me the client ID (or partial client ID) you are using, I can look through the server logs for additional details.  Jason, I will recompile and give it a try. However believe me, this thing had been running for months... when this change of behaviour took place i was one continent away", "num_user_post": " 10", "author": "MarcFinns"}, {"date": "October 15, 2017 - 5:16 am", "content": "mutton said I've just had two channels stop reporting via MQTT as well. They have been both reporting for months without a problem and both suddenly can't connect to the brokerHi Mutton, did you manage to achieve different results..?This thing is sooooo broken and the company does not care obviously. Their site has not changed forever, clearly not a priority for them.", "num_user_post": " 10", "author": "MarcFinns"}, {"date": "October 15, 2017 - 8:43 pm", "content": "Marc - have you been able to reproduce the issue you see with a desktop client such as MQTTFx? We have tried numerous things and are unable to reproduce what you are seeing on your end.We care deeply about ThingSpeak users and continue to add new features almost every month. Just last week we released MQTT subscribe, in addition to to the existing MQTT publish functionality. See here for the new subscribe API, in addition to the existing publish API. I have also asked for the lead developer, Jason, to reach out to you directly to try and reproduce the issue you are seeing since we are unable to reproduce this on our end.", "num_user_post": " 225", "author": "Vinod"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/api-for-linux-users/", "posts": [{"date": "May 22, 2016 - 6:38 pm", "content": "Hi there!My name is Pedro Bertoleti. I have developed a API for using ThingSpeak (to send data) on Linux. It was developed in C language in socket level (so, at least in theory, It works in every Linux distribution with access to Internet). It means that, using what I've done, it's possible to send data to ThingSpeak with good performance and in a easy way too!Please, I would ask you to test it and comment here what you think about it (if it's good, if it's a loss of time, etc.). The API can be downloaded (and its instructions can be read too) here: https://github.com/phfbertoleti/ThingSpeakCThanks in advance.Pedro Bertoleti", "num_user_post": " 4", "author": "phfbertoleti"}, {"date": "June 20, 2016 - 9:12 am", "content": "Thanks for sharing, Pedro! Have you gotten any feedback?", "num_user_post": " 402", "author": "Hans"}, {"date": "July 5, 2016 - 3:40 am", "content": "phfbertoleti said  Please, I would ask you to test it and comment here what you think about it (if it's good, if it's a loss of time, etc.). The API can be downloaded (and its instructions can be read too) here: https://github.com/phfbertoleti/ThingSpeakCHi Pedro,I just cloned it to 4 of my devices, compiled and tested without any problems on two Raspberries and two Odroid C1. Small and simple, will replace my bash-script with your program. Thanks for sharing!", "num_user_post": " 4", "author": "sesom"}, {"date": "July 22, 2016 - 10:55 am", "content": "Hans said Thanks for sharing, Pedro! Have you gotten any feedback?  Hi Hans!  Sorry for delay in answering. I've got some feedbacks (including user sesom, who replied in this post too), all of them were good feedbacks!And you, did you like it?", "num_user_post": " 4", "author": "phfbertoleti"}, {"date": "July 22, 2016 - 10:57 am", "content": "sesom said phfbertoleti said  Please, I would ask you to test it and comment here what you think about it (if it's good, if it's a loss of time, etc.). The API can be downloaded (and its instructions can be read too) here: https://github.com/phfbertoleti/ThingSpeakC Hi Pedro, I just cloned it to 4 of my devices, compiled and tested without any problems on two Raspberries and two Odroid C1. Small and simple, will replace my bash-script with your program. Thanks for sharing!  sesom, sorry for delay in answering.Thank you very much for your feedback and tests!!", "num_user_post": " 4", "author": "phfbertoleti"}, {"date": "September 4, 2016 - 7:08 pm", "content": "sesom said phfbertoleti said  Please, I would ask you to test it and comment here what you think about it (if it's good, if it's a loss of time, etc.). The API can be downloaded (and its instructions can be read too) here: https://github.com/phfbertoleti/ThingSpeakC Hi Pedro, I just cloned it to 4 of my devices, compiled and tested without any problems on two Raspberries and two Odroid C1. Small and simple, will replace my bash-script with your program. Thanks for sharing!  sesom, good news. Recently, I've got a BeagleBone Black (Rev. C) and it worked without problems too. Good news, isn't it?", "num_user_post": " 4", "author": "phfbertoleti"}, {"date": "September 11, 2017 - 11:41 pm", "content": "Hi Pedro,I downloaded your API but unfortunately I couldn't connect to ThingSpeak by using HTTPS. I realized that HTTPS requests can be managed with OpenSSL, thus I modified your code to allow such feature and I've added a read function as well. Hereby I'm sending you a link where you can download the modified code.ThingSpeakLinux-mod ", "num_user_post": " 1", "author": "alexparrado"}, {"date": "October 13, 2017 - 4:45 am", "content": "Hi pedro, Your API Doesnt connect in HTTPS. http://www.traininginmarathahalli.in/selenium-training-in-bangalore/", "num_user_post": " 1", "author": "adamlee"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/alguien-espanol-problema-campos-de-canal/", "posts": [{"date": "September 29, 2017 - 6:22 pm", "content": "alguien que hable español??? tengo un problema con mi canal en thingspeak, tengo configurado 3 campos, 2 temperaturas y una humedad, pero sólo me muestra una sola temperatura.muchas gracias de antemano, un saludo", "num_user_post": " 1", "author": "juanreina"}, {"date": "September 29, 2017 - 8:00 pm", "content": "Hola juan,Nuevo en el barrio? o nuevo en este forum del barrio? Bienvenido ... pero debes describir mejor(mas completo) lo que pasa.thingspeak y matlab SI funcionan bien ... si usas arduino te puedo ayudar pero debes, como repito, dar muchas mas pistas.No des contraseñas ni ID ni algo por el estilo. Si es arduino lo que importa es la logica de tu programa y que observes los 15 segundos minimo entre envio y envio Saludos ", "num_user_post": " 91", "author": "piajola"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/how-do-i-send-output-from-delayed-program-with-api-to-thingspeak/", "posts": [{"date": "September 21, 2017 - 3:53 pm", "content": "Hello,I want to send the output of a program ./airsensor -v to my ThingSpeak account to see the air quality trend. The tool (./airsensor -v) needs ~ 15 seconds to print a number after you hit enter, but it does print out the values continuously every 15 seconds. The sensor is usb connected to a Raspberry Pi. I tried the following two commands, but non of them worked. Can someone correct the commands? I'm very new to all this, as you might see. ./airsensor -v | while read line; do curl -X GET -d 'value=$line' 'https://api.thingspeak.com/update?api_key=[API-WRITE-KEY]&field1=0' ; done./airsensor | curl -X POST -d @- https://api.thingspeak.com/update?api_key=[API-WRITE-KEY]&field1=0What would be the command or script to continuously send the outputs of ./airsensor -v to thingspeak?", "num_user_post": " 1", "author": "Duck"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/graphics/", "posts": [{"date": "September 13, 2017 - 2:55 am", "content": "Hello allis there anyway to remove the data point 'dots' from the default graphs generated by the thingspeak API as they make my graphs look a bit messy and crowded? Thanks", "num_user_post": " 2", "author": "geoffg"}, {"date": "September 13, 2017 - 11:36 am", "content": "You can add a MATLAB analysis or visualization to your channel where the output is a thingSpeakPlot() or a MATLAB plot. ThingSpeakPlot default does not have data points (but you can turn them on if you like).[data,time]=thingSpeakRead(320695,'NumPoints',24,'Fields',[1]);thingSpeakPlot(time,data(:,1));Then you can add the visualization (or analysis) to your channel.", "num_user_post": " 401", "author": "cstapels"}, {"date": "September 13, 2017 - 5:25 pm", "content": "Thnaks for that - yes looks much nicer ", "num_user_post": " 2", "author": "geoffg"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/work-out-sunrise-and-sunset-for-data-collected-from-light-sensor/", "posts": [{"date": "September 1, 2017 - 9:04 pm", "content": "Hi All, I have a curly question, maybe! I have a light sensor (LDR) monitoring the day light and I've worked out that between the values 50 and 60 is when it's either getting dark or getting light, basically sunrise or sunset.So my theory is to retrieve values in the range between 50 and 60 that happened during AM giving me an approximate sunrise time and then use the same range during PM giving me the sunset time. Because I live in QLD, Australia the sunrise and sunset are around the same time all year round (QLD does not implement day light saving at all) so how would I retrieve values recorded between say 5am to 7am and values between 5pm and 7pm or the lowest value that occurred in the morning time and the lowest value that occurred in the evening time. How would I be able to do this in MATLAB to retrieve the data from my channel?Has anyone done anything similar, nothing came up during my research hence the question!", "num_user_post": " 9", "author": "viiartz"}, {"date": "September 2, 2017 - 3:35 am", "content": "I would just get the official times from somewhere like https://sunrise-sunset.org/api  using the webread() function rather than attempt to guess them from ambient light data..  But it is possible to retrieve data from a channel for a specific time see https://au.mathworks.com/help/thingspeak/get-channel-field-feed.html particularly the 'start' and 'end' parameters.    Hopefully one of the matlab experts who lurk here might be able to help you with the syntax.", "num_user_post": " 271", "author": "rw950431"}, {"date": "September 2, 2017 - 8:14 pm", "content": "Hi viiartz,As rw950431 says look at the internet of people for a second and get the canonical hours Mr Sun visit us I saw your channel (I think) where lux is overloading half-day. See the code below, please copy/paste and blindily run it; see the output box, copy results to Excel to see if that make sense, now erase/change at your pleasure all/any pzrt % MATLAB Code belowreadChannelID = 312667;disp(['Working in channel number ',num2str(readChannelID)]); % you compose the text%% Read Data - your choice on what you want %%% one way to Read %%lux = thingSpeakRead(readChannelID, 'OutputFormat','table' , 'NumDays', 1)lux = thingSpeakRead(readChannelID, 'OutputFormat','table' , 'Numpoints', 5); % without ; ending to displaydisp(lux.Lux); % case sensitive% another way %[luxx,timestamps] = thingSpeakRead(readChannelID, 'fields',[2] , 'Numpoints', 5);disp(luxx);%% selecting time lapse %%t = datetime('now','TimeZone','local','Format','HH:mm:ss');disp(['right now ' datestr(t)]);lorita = datetime('now','TimeZone','America/Lima'); % datestr(datetime('now'),30)yy=year(lorita); % it is 'the today' every time this runsmm=month(lorita);dd=day(lorita);% ho=hour(lorita); you will put your time% mi=minute(lorita);% se=second(lorita);%% Mr.sun is coming ... Mr.sun is coming ... Mr.sun is coming ... Mr.sun is coming ...tini1=datetime([yy,mm,dd,5,30,0]); %,'TimeZone','UTC') whatever you estimate/wishtfin1=datetime([yy,mm,dd,6,30,0]); %,'TimeZone','UTC') here hour 6 min 30 secs 0 [06:30:00]disp(['Mr.sun coming from ' datestr(tini1) ' to ' datestr(tfin1)]);%% Mr.sun is leaving ... Mr.sun is leaving ... Mr.sun is leaving ... Mr.sun is leaving ...tini2=datetime([yy,mm,dd,17,30,0]); %,'TimeZone','UTC') whatever you estimate/wishtfin2=datetime([yy,mm,dd,18,30,0]); %,'TimeZone','UTC') here hour 6 min 30 secs 0 [06:30:00]disp(['Mr.sun leaving from ' datestr(tini2) ' to ' datestr(tfin2)]);[lux1,timestamp1] = thingSpeakRead(readChannelID, 'fields',[2] , 'DateRange',[tini1,tfin1]);[lin1,col1]=size(lux1);[lux2,timestamp2] = thingSpeakRead(readChannelID, 'fields',[2] , 'DateRange',[tini2,tfin2]);[lin2,col2]=size(lux2);disp(['coming ' num2str(lin1) 'x' num2str(col1) ' leaving ' num2str(lin2) 'x' num2str(col2)]);%% nuclear/fision/fusion intergalactic calculations %%[maxLux1, maxLuxIdx] = max(lux1);[minLux1, minLuxIdx] = min(lux1);[maxLux2, maxLux2Idx] = max(lux2);[minLux2, minLux2Idx] = min(lux2);% Choose the timestamp at which the maximum/minimum lux was measuredtimeLuxTemp1 = timestamp1(maxLuxIdx);timeLuxTemp2 = timestamp1(minLuxIdx);timeLux2Temp1 = timestamp2(maxLux2Idx);timeLux2Temp2 = timestamp2(minLux2Idx);display(['Maximum lux Mr.sun coming is ' num2str(maxLux1) '->' datestr(timestamp1(maxLuxIdx))]);display(['Minimum lux Mr.sun coming is ' num2str(minLux1) '->' datestr(timestamp1(minLuxIdx))]);display(['Maximum lux Mr.sun leaving is ' num2str(maxLux2) '->' datestr(timestamp2(maxLux2Idx))]);display(['Minimum lux Mr.sun leaving is ' num2str(minLux2) '->' datestr(timestamp2(minLux2Idx))]);display('- - - - - - - - - - - -')for c = 1:length(timestamp1) disp([num2str(lux1(c)) '--' datestr(timestamp1(c),'HH:MM:SS')])enddisplay('- - - - - - - - - - - -')for c = 1:length(timestamp2) disp([num2str(lux2(c)) '--' datestr(timestamp2(c),'HH:MM:SS')])end If it is of some help and you solve your issue post your code so others can use it ", "num_user_post": " 91", "author": "piajola"}, {"date": "September 3, 2017 - 7:54 am", "content": "Awesome work @piajola..   Do you happen to know if parameters like  'start' and 'end' can be added to the thingSpeakRead() function- there is a vague reference to 'other parameters' in the docco but no real examples.", "num_user_post": " 271", "author": "rw950431"}, {"date": "September 3, 2017 - 5:29 pm", "content": "Hi rw950431,To my knowledge using thingspeakread the way is 'Daterange' with 2 dates/time as parametersIn a string to be used for retrieval of records you use 'start''end', i.e.http://api.thingspeak.com/channels/xXx/feeds.json?start=2017-1-8 00:00:00&end=2017-1-8 23:59:59That is the way I use this, it is enough for meI hope this is some help ", "num_user_post": " 91", "author": "piajola"}, {"date": "September 7, 2017 - 10:00 am", "content": "piajola said Hi viiartz, As rw950431 says look at the internet of people for a second and get the canonical hours Mr Sun visit us  I saw your channel (I think) where lux is overloading half-day. See the code below, please copy/paste and blindily run it; see the output box, copy results to Excel to see if that make sense, now erase/change at your pleasure all/any pzrt   % MATLAB Code belowreadChannelID = 312667;disp(['Working in channel number ',num2str(readChannelID)]); % you compose the text %% Read Data - your choice on what you want %%% one way to Read %%lux = thingSpeakRead(readChannelID, 'OutputFormat','table' , 'NumDays', 1)lux = thingSpeakRead(readChannelID, 'OutputFormat','table' , 'Numpoints', 5); % without ; ending to displaydisp(lux.Lux); % case sensitive% another way %[luxx,timestamps] = thingSpeakRead(readChannelID, 'fields',[2] , 'Numpoints', 5);disp(luxx); %% selecting time lapse %%t = datetime('now','TimeZone','local','Format','HH:mm:ss');disp(['right now ' datestr(t)]); lorita = datetime('now','TimeZone','America/Lima'); % datestr(datetime('now'),30)yy=year(lorita); % it is 'the today' every time this runsmm=month(lorita);dd=day(lorita);% ho=hour(lorita); you will put your time% mi=minute(lorita);% se=second(lorita); %% Mr.sun is coming ... Mr.sun is coming ... Mr.sun is coming ... Mr.sun is coming ... tini1=datetime([yy,mm,dd,5,30,0]); %,'TimeZone','UTC') whatever you estimate/wishtfin1=datetime([yy,mm,dd,6,30,0]); %,'TimeZone','UTC') here hour 6 min 30 secs 0 [06:30:00]disp(['Mr.sun coming from ' datestr(tini1) ' to ' datestr(tfin1)]); %% Mr.sun is leaving ... Mr.sun is leaving ... Mr.sun is leaving ... Mr.sun is leaving ... tini2=datetime([yy,mm,dd,17,30,0]); %,'TimeZone','UTC') whatever you estimate/wishtfin2=datetime([yy,mm,dd,18,30,0]); %,'TimeZone','UTC') here hour 6 min 30 secs 0 [06:30:00]disp(['Mr.sun leaving from ' datestr(tini2) ' to ' datestr(tfin2)]); [lux1,timestamp1] = thingSpeakRead(readChannelID, 'fields',[2] , 'DateRange',[tini1,tfin1]);[lin1,col1]=size(lux1);[lux2,timestamp2] = thingSpeakRead(readChannelID, 'fields',[2] , 'DateRange',[tini2,tfin2]);[lin2,col2]=size(lux2); disp(['coming ' num2str(lin1) 'x' num2str(col1) ' leaving ' num2str(lin2) 'x' num2str(col2)]); %% nuclear/fision/fusion intergalactic calculations %%[maxLux1, maxLuxIdx] = max(lux1);[minLux1, minLuxIdx] = min(lux1);[maxLux2, maxLux2Idx] = max(lux2);[minLux2, minLux2Idx] = min(lux2); % Choose the timestamp at which the maximum/minimum lux was measuredtimeLuxTemp1 = timestamp1(maxLuxIdx);timeLuxTemp2 = timestamp1(minLuxIdx);timeLux2Temp1 = timestamp2(maxLux2Idx);timeLux2Temp2 = timestamp2(minLux2Idx); display(['Maximum lux Mr.sun coming is ' num2str(maxLux1) '->' datestr(timestamp1(maxLuxIdx))]);display(['Minimum lux Mr.sun coming is ' num2str(minLux1) '->' datestr(timestamp1(minLuxIdx))]);display(['Maximum lux Mr.sun leaving is ' num2str(maxLux2) '->' datestr(timestamp2(maxLux2Idx))]);display(['Minimum lux Mr.sun leaving is ' num2str(minLux2) '->' datestr(timestamp2(minLux2Idx))]); display('- - - - - - - - - - - -')for c = 1:length(timestamp1) disp([num2str(lux1(c)) '--' datestr(timestamp1(c),'HH:MM:SS')])enddisplay('- - - - - - - - - - - -')for c = 1:length(timestamp2) disp([num2str(lux2(c)) '--' datestr(timestamp2(c),'HH:MM:SS')])end   If it is of some help and you solve your issue post your code so others can use it   Wow piajola, thank you for taking the time to answer my question and writing code, amazing what the code is able to pull out of the data collected. That is exactly or very similar to what I was imagining I wanted to do. Yes, I could get the info from the net but what fun would that be! I'll need to really take a close look at and try to decipher what the code does, I mean I have an idea, I'm just not familiar with Matlab code or functions. I always try and post any code related to a question where possible. Again thank you so much! ", "num_user_post": " 9", "author": "viiartz"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/how-to-properly-use-relative-timestamps-via-delta_t-in-rest-api/", "posts": [{"date": "August 20, 2017 - 6:27 pm", "content": "This is about relative timestamps mentioned in REST API https://www.mathworks.com/help/thingspeak/bulk-update-a-channel-feed-1.htmlDocs states 'For devices without a real-time clock, you can use relative timestamps instead of absolute timestamps. Replace the 'created_at' with 'delta_t'inside the updates JSON object to use relative timestamps. Here, 'delta_t' represents time in seconds passed since the last measurement was recorded.'I thought it's somehow for buffering values and then submitting them at once. Should be great feature.Intention is more or less clear, but I can't match it with TS' behavior that I see. Or, maybe,  I'm using it in some wrong way.Actual behavior is that if I submit series of field values, TS interprets it in a way like 1st record in a series is submitted 'now' and all consecutive records get's time 'now'+delta_t; that is a kind of 'in the future' and not in the past as I thought it should be.I've tried to use negative values s delta_t - no luck.I also tried to send delta_t of first record as zero and non-zero values. Though it will trigger TS to use zero as 'now' and all consecutive submissions as really 'relative' to this 1st series. No luck. Please advice if I can somehow get it working in a way so TS treats values as 'from the past' and not 'from the future'.", "num_user_post": " 3", "author": "Pavlo"}, {"date": "September 7, 2017 - 4:24 am", "content": "ok, so it looks like I'll have to submit data 'upfront' as I have not found the way to do otherwise.So instead of submitting data fort 'past'. I will send 'last 5 minutes' data as is, and ThingSpeak will record them like they occurred 'in the future' (next five minutes)", "num_user_post": " 3", "author": "Pavlo"}, {"date": "September 7, 2017 - 8:57 am", "content": "I think the intention of the timestamp field is to record the submission time. Using bulk update and relative timestamps will be difficult to get the behavior you hope for.Is your goal to show the data with accurate datetimes on your channel page?  One possible work around would be to use a MATLAB visualization to read the data from your channel and adjust the datetimes and then re-plot the data.  If you use ThingSpeakRead() with the 'outputformat','timetable'  then MATLAB makes it easy to shift your data.  For example lag(TT,dt) shifts the data in time table TT by a value of dt.  Then you can show that visualization on your channel page.", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/only-one-otherwise-functional-nodemcu-wont-talk-to-thingspeak/", "posts": [{"date": "March 22, 2017 - 8:04 pm", "content": " I'm currently prototyping a device that sends data to ThingSpeak. I've been tinkering on a breadboard, and have a circuit that I like enough that I decided to build it into the hardware of the device so I can test things out off-breadboard.So I put things into the plastic housing, and soldered everything together-- I know, it's *really* ugly. But all of the solder joints seem just fine, and the whole thing is 'clean' insofar as there is no dust, nothing is shorting against anything else, etc.http://i.imgur.com/yPMED4p.jpgSo here's the thing- I still have my breadboard circuit, and I have a total of 6 NodeMCU's (one purchased as a single, the other in a 5-pack). So I can swap NodeMCU's into and out of the breadboard. The program that I have prints to the serial terminal continuously, and sends data to ThingSpeak once every 20 seconds. The code & the breadboard circuit work fine with two different NodeMCU's. I get data both in my serial terminal & on ThingSpeak.Here's the thing-- I'll put the code onto the NodeMCU built into my device, and everything works except sending data to ThingSpeak. The serial terminal works fine; the sensors are all reading normally. But not a single data point will show up online. I have put in int statusCode = ThingSpeak.writeFields(myChannelNumber, myWriteAPIKey);and I'm getting a -301 error every time-- this is 'Failed to connect to ThingSpeak.'Any ideas of what could even cause this problem? ", "num_user_post": " 4", "author": "masters42"}, {"date": "March 22, 2017 - 11:38 pm", "content": "If the circuit works on a breadboard and does not work in the soldered project box, I would wonder if the soldering caused some damage to the WiFi circuit or antenna.One angle to work is to de-solder the chip from your circuit, put it in to your breadboard and see if it works. Alternatively, try building a circuit with a different nodeMCU chip and see if it works.Another angle is to see if a simple program can connect to a site like google.com. Something like this: #include <ESP8266WiFi.h>const char* ssid = 'WiFiSSID';const char* password = 'WiFiPassword';void setup() {  Serial.begin(115200);  Serial.println();  WiFi.begin(ssid, password);  while (WiFi.status() != WL_CONNECTED) {    delay(500);    Serial.print('.');  }}void loop() {  WiFiClient client;  while (!client.connect('google.com', 80)) {    Serial.println('connection failed, retrying...');  }  Serial.println('CONNECTED TO GOOGLE');  delay(5000);} Now look at the serial monitor. Are ever able to connect to google?", "num_user_post": " 225", "author": "Vinod"}, {"date": "March 23, 2017 - 8:38 am", "content": "A long time ago I had a problem similar to this.  My breadboard worked fine but the production unit wouldn't connect.  In my case it was caused by using the same MAC address in both devices while they were both online.  It created chaos in my router as the router didn't know where to send TCP packets.That probably isn't your problem but make sure your breadboard is offline before powering up the other one, in case they are interfering with each other in some way. ", "num_user_post": " 34", "author": "JasonW"}, {"date": "March 23, 2017 - 1:20 pm", "content": "Update: the board in the device wouldn't connect to Google, either-- it just wouldn't connect to the Internet, period. Everything else *appeared* to work just fine- it was connected to an ADC, receiving inputs from 3 different sensors, and serial printing reasonable values. I de-soldered it from everything; still no connection. I removed it from the housing, still no connection.I soldered together a new circuit fresh, with a different NodeMCU from the same 5-pack. It works 🙂 So that's good. Unfortunately, in my initial excitement I can't definitely say that I tested the original board beforehand. I like to *think* that I would have, but I just don't remember. So I don't know if it came unable to connect to WiFi, or if it was some consequence of soldering where the heat fubar'd something.Also, I noticed that the 5-pack of NodeMCU's I got on Amazon has an odd quirk- the silk screen for the pin labels reads D0 D1 D1 D3 ... as in, pin D2 is mis-labled. It may just be fair to say that I got a bum chip... although it still seems odd to me that the entire SoC works except WiFi. Maybe that makes sense to someone more familiar with how they're put together.Thanks for the input, folks!", "num_user_post": " 4", "author": "masters42"}, {"date": "September 6, 2017 - 3:57 am", "content": "Same issue here. Thank you for your suggestions!", "num_user_post": " 1", "author": "brodys"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/finer-grained-retrieval-of-most-recent-data-than-integer-days/", "posts": [{"date": "March 31, 2017 - 8:13 am", "content": "I would like to use the API on Channels and Channel Fields to request the most recent N minutes or seconds of data. However, the API only allows integer days. Is there a reason for this restriction. Can a future update include 'minutes=N' or 'seconds=N'?Thanks!", "num_user_post": " 4", "author": "rvnash"}, {"date": "March 31, 2017 - 3:26 pm", "content": "Hello rvnash,You can click this linkthingspeak.com/channels/9/charts/1?bgcolor=a2a2a2&color=444444&dynamic=false&type=spline&width=auto&height=auto&round=2&start=2017-03-31 00:00:00&end=2017-03-31 00:01:00&offset=-05.00it is channel 9 field 1 chart for today since midnight for a lapse of 1 minute showing some points about each 15 seconds, checked in Chrome-W10 but I believe any modern browser will do.In a plug-in the javascript code to pick the needed points is something like this$.getJSON('https://api.thingspeak.com/channels/' + channel_id + '/fields/' + field_number + '.json?offset=0&round=2&results=' + results + '&api_key=' + api_key, function( .... etc, etcHope this very little information is of some help ", "num_user_post": " 91", "author": "piajola"}, {"date": "September 6, 2017 - 12:22 am", "content": "Thank you, piajola. It does help me a lot!This is also useful: javascript obfuscator", "num_user_post": " 2", "author": "zoey7"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/api-usage-limits-per-ip-address/", "posts": [{"date": "August 30, 2017 - 1:59 pm", "content": "Hello ThingSpeak community!In a few days I'll be giving an introductive workshop on the arduino ecosystem and the internet of things and one of the exercises we have planned makes use of ThingSpeak - basically, logging values read from a temperature sensor. We plan on having each participant register individually, of course, and use their own API keys for this purpose. We will, of course, make sure everyone respects the request rate limit.We have one concern: we'll have a single outgoing IP address. To ThingSpeak's servers, it may look like there is an excessive number of requests coming from this IP address. I'm trying to see if this will become an issue and what steps I can take to mitigate it.The number of individual participants will be around 25.", "num_user_post": " 1", "author": "ticklemynausea"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/retrieve-the-the-stored-value-from-a-field-from-an-hour-ago/", "posts": [{"date": "August 23, 2017 - 10:47 am", "content": "Hi, I know how to retrieve the last stored value, but how would I go about retrieving a value from an hour ago?", "num_user_post": " 9", "author": "viiartz"}, {"date": "August 23, 2017 - 1:40 pm", "content": "For a REST API call, from a device for example, use the start and end parameters in you rest call. The process to get a channel feed field  is shown in the doc here.  The call is a GET and looks like thishttps://api.thingspeak.com/channels/1417/fields/1.json?end=2017-08-22%2013:12:12&start=2017-08-22%2012:12:12 The format is start (datetime) Start date in format YYYY-MM-DD%20HH:NN:SS (optional)end (datetime) End date in format YYYY-MM-DD%20HH:NN:SS (optional)You should also append your api_key if it is a private channel &api_key=xxxxxxxxxxxxxxxx.The example for map path visualization that shows you how to do it in MATLAB, using the thingSpeakRead() function.data = thingSpeakRead(73734,'DateRange',... [datetime('today')-caldays(10),datetime('today')],'outputFormat','table');", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/csv-import-on-reachand-thing-http/", "posts": [{"date": "August 22, 2017 - 7:16 am", "content": "Hi, I am in the middle of developing a commercial IoT Application with Thingspeak and in need of some help.I am connecting an ESP8266 to 4 sensors.ESP8266 is connected to a Channel.each Sensor to a Field.each Sensor will have 3 trigger leveleach Trigger need to Send HTTP Request to 2 Web services.with all of this trigger and request, i end up with 24 React and 8 ThingHTTP.the problem is, i'm planning to have thousands of ESP8266 and realize, it will be a pain to manage and maintain the React and Thing HTTP manually.does anyone have any experience with this kind of problem and have a solutions?a CSV Import for React and ThingHTTP is more than enough. but I can't seem to find those functions. any idea?", "num_user_post": " 2", "author": "cpram"}]}]}