{"url": "https://community.thingspeak.com/forum/thingspeak-api/page-32/", "threads": [{"url": "https://community.thingspeak.com/forum/thingspeak-api/thingspeak-integration/", "posts": [{"date": "December 26, 2014 - 12:13 pm", "content": "I'm new to ThingSpeak. Is there a way to subscribe, =automatically receiving the new data coming in ThingSpeak from devices, from my own application. Something similar as MQTT pub/sub?Thanks.", "num_user_post": " 3", "author": "gdillen"}, {"date": "December 29, 2014 - 9:25 am", "content": "Hi,We currently don't provide this capability, but it's something that we have discussed adding in the future.lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/api-bug/", "posts": [{"date": "December 19, 2014 - 11:10 am", "content": "When posting two values 'field1' and 'created_at' to the API. Both appear correctly on /feeds/last: https://api.thingspeak.com/channels/20692/feeds/last but NOT on /feed.json: https://api.thingspeak.com/channels/20692/feed.jsonThis looks like a bug related to setting the created_at value!", "num_user_post": " 4", "author": "powtac"}, {"date": "December 19, 2014 - 11:23 am", "content": "No bug, sorry my fault!The problem was that 'date.month' returns 0-11 (January = 0) and I didn't '+1' to match the correct date for created_at!", "num_user_post": " 4", "author": "powtac"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/problems-with-update-feed-after-a-creation/", "posts": [{"date": "December 18, 2014 - 11:28 am", "content": "Hi, I have another problem:when I create a channel and I try to update a feed (adding a set of data) the result is that the data are not stored on the channel and as result I obtain only a 0 value (as entry number)!I tried to wait 3 seconds before the submission,but the result is the same!Do you know why?", "num_user_post": " 4", "author": "lifedj"}, {"date": "December 18, 2014 - 2:23 pm", "content": "Hi,We limit updates to one update per Channel every 15 seconds ( https://thingspeak.com/docs/channels#rate_limits ), so this is the behavior that you may be seeing.lee", "num_user_post": " 457", "author": "lee"}, {"date": "December 19, 2014 - 10:52 am", "content": "Ok, I thought the limit was referred only between 2 update (in my opinion it was not considered in this count the creation).Thank you again! ", "num_user_post": " 4", "author": "lifedj"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/how-to-get-write-api-key-for-a-channel/", "posts": [{"date": "December 18, 2014 - 8:07 am", "content": "How can I write on a channel if I don't have the API Key?I will explain: I have a script that gets data from a lot of devices, and at the end it has to write these data on thingspeak.Thus, what I want to do is: look in thingspeak if a channel with a specific name exist.If it exist I want to write the data on the channel.But considering that I don't know the Write API key a priori, I cannot do it beacuse there is not a way to know that key.How can I do it?", "num_user_post": " 4", "author": "lifedj"}, {"date": "December 18, 2014 - 8:58 am", "content": "Hi,You can list all of your Channels along with their API keys by using the documentation at https://thingspeak.com/docs/channels#index (look under 'List My Channels').lee", "num_user_post": " 457", "author": "lee"}, {"date": "December 18, 2014 - 11:25 am", "content": "Ok, thank you very much!I continued to fetch HTML code instead of JSON and there weren't api keys in the result!Thank you! ", "num_user_post": " 4", "author": "lifedj"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/arduino-yun-connection/", "posts": [{"date": "December 16, 2014 - 7:01 am", "content": "Hello, I was wondering if anyone has connected a Yun directly to a ThingSpeak channel, and if so, could post some code that I could adapt. I've not been able to get the examples using ethernet to work, and would like to use Yun's wireless connection anyway. thanks a lot!Ben", "num_user_post": " 2", "author": "benduino"}, {"date": "December 17, 2014 - 6:01 am", "content": "Yep,i'm using ittry this:#include// Include the Bridge library for communication between processors#include// Include the HttpClient library for communication with ThingSpeakunsigned long LastUpdateTime=0;// Unsigned long to hold the last update timeHttpClient client;// Create a new client object;char URL[260]='';// Declare a character array to hold the URL (Reserve 260 bytes). We are only currently using 219 bytes but leaving room for future expansion in case the server url changesvoid setup(){        client.noCheckSSL();// Turn of checking of SSL certificate validity only requires if using https to communicate with thingspeak (We implictly trust the servers key)        Bridge.begin();// Open the connection between the Arduino and OpenWrt}void loop(){        UpdateThingSpeak;}void UpdateThingSpeak()// This routine issues an HTTPS get command directly to ThingSpeak{        if (millis() - LastUpdateTime > 15000)// If its been 15 seconds since we last tried to contact ThingSpeak        {                URL[0]='';// This 'resets' the character array without it, it will continue to grow using all the available memory   // Now we concatenate the URL one operation at a time, adding each variable to the string until we end up with a full URL                strcat(URL,'https://api.thingspeak.com/update?api_key=');// First add the https base url                strcat(URL,'XXXXXXXXXXXXXXXX');// Then the API Key                strcat(URL,'&field1=text 1');                strcat(URL,'&field2=text 2');                strcat(URL,'&field3=text 3');                strcat(URL,'&headers=false');// Add the flag to reduce the number of http headers                strcat(URL,'');// Add the string to terminate the URL                while(client.available() >0 )// Before we start, if anything is available in the client buffer                {                        client.read();// We call a read to clear out any rubbish in the buffer                }                client.getAsynchronously(URL);// Tell Linino to 'GET' the url in the background                // Note if your using talkback and you add the talkback url into this string you can then do a client.read and get the latest talkback command whilst updating thingspeak                LastUpdateTime = millis();// Reset the timer        }}", "num_user_post": " 54", "author": "chrisjmears"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/how-to-connect-gsm-mobile-style-anyone/", "posts": [{"date": "April 1, 2014 - 5:29 pm", "content": "Hi all/fellow enthusiastsRelated to my post almost a month back; someone has surely done a GSM mobile connection. Hence, some light could be shed on how to connect this way (as opposed to ethernet).I am posting NULL values..... I posted my arduino code; could someone share theirs (which works).Many thanksStonker", "num_user_post": " 5", "author": "Stonker"}, {"date": "May 1, 2014 - 6:35 pm", "content": "Solved:Use xively basic example for gsm shield on ArduinoTake the post data required from the thingSpeak example for wireless shield on this site --- doneif anyone needs help on this  - let me knowStonker", "num_user_post": " 5", "author": "Stonker"}, {"date": "May 22, 2014 - 2:27 am", "content": "Hi Stonker,does your solution work fine with the gsm shield?", "num_user_post": " 63", "author": "vespapierre"}, {"date": "December 11, 2014 - 9:25 am", "content": "Hi Stonker,thanks a lot for your post.I am struggling to upload sensor data from Arduino via GSM/GPRS Shield to Thingspeak.I tried to modify a Xively sketch that I found online, but couldn't make it work for Thingspeak.If you managed to do so, would you mind posting your code?Thanks a lot in advance, appreciate your efforts.CheersPrecedent", "num_user_post": " 2", "author": "Precedent"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/response-headers-size/", "posts": [{"date": "February 20, 2014 - 5:20 am", "content": "Hi,I've been testing with the API to send data from a sensor that is connected by means of a GPRS modem. So far everything is working smoothly.One think that is bothering me tough is the size of the response headers. As you guys probably know, GPRS connection traffic for M2M is billed for upload and download amounts of data.For this particular device a typical request is less then 200 bytes and a reply I get from the API is between 575 and 600 bytes.I'm copying a reply bellow:************************************HTTP/1.1 200 OKServer: nginx/1.5.7Date: Thu, 20 Feb 2014 10:07:57 GMTContent-Type: text/html; charset=utf-8Connection: keep-aliveVary: Accept-EncodingStatus: 200 OKX-Frame-Options: ALLOWALLAccess-Control-Allow-Origin: *Access-Control-Allow-Methods: GET, POST, PUT, OPTIONS, DELETE, PATCHAccess-Control-Allow-Headers: origin, content-type, X-Requested-WithAccess-Control-Max-Age: 1800ETag: '8f14e45fceea167a5a36dedd4bea2543'Cache-Control: max-age=0, private, must-revalidateX-Request-Id: ebf9ee6b-f7a2-4886-ae75-2c5982cc3af1Content-Length: 17***********************I understand that all some of those maybe required for debugging or when you are pulling data, but for an update channel message I really think is too verbose.Is there a way (with an extra request parameter for example) to request a 'short version' for the reply? Or even better: squeeze the reply of the update channel call to the minimum required data to keep request/response of sensors at the minimum possible amount of data?Hope this makes sense to you guys.Thanks!", "num_user_post": " 3", "author": "jass"}, {"date": "February 20, 2014 - 10:27 am", "content": "Hi,We just added an option for you which allows some response headers to be removed.  Just add the parameter 'headers' with a value of 'false' (for example: '&headers=false') when updating your Channel, and the Rails headers will be removed (although the Nginx webserver headers will still be present).lee", "num_user_post": " 457", "author": "lee"}, {"date": "February 24, 2014 - 4:30 am", "content": "Hi,Great! Yes, it's shorter now. Anything that improves that is welcome.Thanks for the prompt reply.", "num_user_post": " 3", "author": "jass"}, {"date": "November 18, 2014 - 3:23 pm", "content": "Hi Jass,i have a GPRS shield from seeedstudio and i am trying to set it up for thingspeak and i cant seem to make it work. if you could pls share your code on how u set up your GPRS or if you can help me i would really appreciate it. Thank you in advance.", "num_user_post": " 2", "author": "samvivi7"}, {"date": "December 11, 2014 - 9:17 am", "content": "Hi Sam,thanks a lot for your post.Unfortunately I cannot provide an answer since I am struggling with the same problem.I want to upload sensor data from Arduino via Seeed GPRS Shield to Thingspeak.Did you by any change already manage to do so?If yes, would you mind posting your code? I couldn't find anything online and neither thingspeak nor seeedstudio support did reply to my request.Of course, if I manage to figure something out, I'll be happy to post it here.Thanks a lot in advance, appreciate your effortsCheersPrecedent", "num_user_post": " 2", "author": "Precedent"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/arduino-and-thikspeak-example/", "posts": [{"date": "December 4, 2014 - 12:37 pm", "content": "Hello,I am a new starter, and I use an Arduino R3 and the Ethernet shield.Download the simple example from GitHub'ThingSpeak-Arduino-Examples/Ethernet/Arduino_to_ThingSpeak.ino'My question is this example working?I compiled it, no problems but it is not workingIt is waiting, this is the message 'Connecting Arduino to network...' thats all.I put the local network setting as printed on the back of my Ethernet shield, andtaken the api key from my channel.Any clou?Thanks for any help.Jan KromhoutHellevoetsluis-NL", "num_user_post": " 1", "author": "Jan Kromhout"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/cant-post-lat-long/", "posts": [{"date": "December 3, 2014 - 10:37 am", "content": "Using HTTP requester for Firefox or using just http url posts, I can update every field except the Lat and Long. Am I doing something wrong or is this feature down?For example i can do this and it works fine to update field1 with whatever I wanthttps://api.thingspeak.com/update?api_key=(MY KEY)&field1=123but this doesnt work:https://api.thingspeak.com/update?api_key=(My Key)&lat=40.123&long=-82.123Thoughts?", "num_user_post": " 1", "author": "zanderman111"}, {"date": "December 3, 2014 - 4:58 pm", "content": "Hi,What Channel is this for?  Also, when viewing your Channel feed, are you adding the parameter 'location=true' so that the location data will be returned?lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/about-the-api-security/", "posts": [{"date": "December 2, 2014 - 11:29 am", "content": "Hi everyone, I have two questions regarding the security of data transfer while using the ThingSpeak platform. 1) Is it just enough to add a simple 's' to the http request (becoming then an 'https' request) to insure that all the data exchange between my computer/hardware and the Thingspeak platform are safe/encrypted ? 2) If the answer to my first question is 'yes', would it also be the case when using ThingSpeak locally on a private machine ? Or do I have to make a specific action on this private machine ?Thank you very much in advance for your input...Cheers, Thierry", "num_user_post": " 1", "author": "TC"}, {"date": "December 2, 2014 - 1:44 pm", "content": "Hi Thierry,Yes using https will ensure that your communications between your computer/hardware and ThingSpeak are secure.  Locally, you can also use https, but may have to create a self-signed SSL certificate.lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/new-router-problems/", "posts": [{"date": "November 18, 2014 - 1:46 am", "content": "I installed a new router and after that my Time Control Apps stoped working. The ioBridge App works so I think it's the router. I turned off all of the fire wall settings and tested the Time Control App but it still didn't work. What else can I try?", "num_user_post": " 3", "author": "dmagee"}, {"date": "November 18, 2014 - 2:53 pm", "content": "Hi,We had some slight problems that were preventing some TimeControls from firing.  We've fixed this issue now, can you check again to see if it's working properly for you?lee", "num_user_post": " 457", "author": "lee"}, {"date": "November 20, 2014 - 11:02 pm", "content": "Thanks, I've been watching the program for the last two days. Old Time Control App's that i have not altered work but if I modify or make a new Time Control App it will not work.Thanks,Dave", "num_user_post": " 3", "author": "dmagee"}, {"date": "November 21, 2014 - 8:57 am", "content": "Hi Dave,Everything is working fine from our end, can you double-check the TimeControl time and date, and make sure the Action it's connected to is working correctly?lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/using-arduino-with-gsm-shield/", "posts": [{"date": "November 20, 2014 - 3:04 am", "content": "Hi, would anyone be able to help me on this? I am trying to use my Arduino to get temperature sensor to upload to thingspeak channel but I am stuck on the coding part. Would anyone be able to help me? Thanks", "num_user_post": " 1", "author": "sleepel"}]}]}