{"url": "https://community.thingspeak.com/forum/thingspeak-plugins/page-6/", "threads": [{"url": "https://community.thingspeak.com/forum/thingspeak-plugins/converting-counter-values-to-rate-of-change/", "posts": [{"date": "January 30, 2014 - 5:59 pm", "content": "My raspberry pi is currently doing a data logging task so I've written a simple shell script to post some performance data to https://thingspeak.com/channels/10042  (you can get the script at https://gist.github.com/rw950431/8702588).As you can see the data is mostly ever-increasing counters: what I'm wanting is a way to convert these values into a rate (packets/sec etc) for easy viewing.   Does anyone know of a plugin or other method to easily achieve this?", "num_user_post": " 271", "author": "rw950431"}, {"date": "February 4, 2014 - 7:24 pm", "content": "Due to the deafening silence I've gone ahead and made my own. I used the Google Vis 'AnnotationChart'  but it should be possible to switch to another chart type fairly easily.See the result at https://thingspeak.com/channels/10042 Source at https://gist.github.com/rw950431/8815072 Useful docs at https://developers.google.com/chart/interactive/docs/gallery", "num_user_post": " 271", "author": "rw950431"}, {"date": "March 26, 2014 - 4:28 pm", "content": "@rw950431,Thanks very much for posting those details; just what I'm after. I shall be plagiarising your efforts although I have some catch up to do re figuring out javascript.", "num_user_post": " 1", "author": "robstwd"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-plugins/plugin-examples-dynamic-resolution/", "posts": [{"date": "March 11, 2014 - 4:30 am", "content": "Hi Thingspeakers  1. Can you put here some examples for plugins ( such as google gauge ) ?2. What colours can be used during defining a simple chart for the field of a channel? ( red,blue,green,black,yellow,purple is checked already   )3. I'd like to put some charts from my channels to webpage. Embedding iframe values are ok, but can have problems with resolution. Can you help my how to solve this? (I know it is rather a webpage editing question, than a plugin or charts specification...)Thanks!", "num_user_post": " 63", "author": "vespapierre"}, {"date": "March 12, 2014 - 5:38 pm", "content": "Hi,Any HTML color name or code can be used for the chart colors.  I'm not sure what you mean by embedding resolution--do you want a larger chart to appear?lee", "num_user_post": " 457", "author": "lee"}, {"date": "March 13, 2014 - 5:42 pm", "content": "Take a look at the webpage I made that graphs multiple channels:http://community.thingspeak.com/forum/announcements/thingspeak-live-chart-multi-channel-second-axis-historical-data-csv-export/", "num_user_post": " 70", "author": "turgo"}, {"date": "March 19, 2014 - 8:31 am", "content": "I just would like to have a page where the charts can be read 'user friendly' on 1024*768 and bigger resolutions. Thanks for the colors!Turgo thanks!I will check it!", "num_user_post": " 63", "author": "vespapierre"}, {"date": "March 19, 2014 - 10:44 am", "content": "Hi,You can make charts any size you want.  Please see https://thingspeak.com/docs/charts#create for chart parameters.lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-plugins/plugin-what-gives-back-just-value/", "posts": [{"date": "March 12, 2014 - 6:25 am", "content": "Hi,I am looking for a plugin or solution for getting back just the value from the fields of the channel. For example like google gauge gives back the current value in the middle of the screen ( for example temperature value, and so on ).How can I insert the current (actual) value for each field to a webpage?", "num_user_post": " 63", "author": "vespapierre"}, {"date": "March 12, 2014 - 6:43 am", "content": "ok, using  'http://api.thingspeak.com/channels/(channel_id)/field/(field_id)/last.(format)' is great.Is there an example how to embed it to a webpage with some 'nice look'?", "num_user_post": " 63", "author": "vespapierre"}, {"date": "March 12, 2014 - 5:42 pm", "content": "Hi,The easiest way to display it on the page with a nice look would be to use JavaScript to get the value, and insert it into an HTML 'div' tag with appropriate CSS styles.  Unfortunately I don't have any examples of this though.lee", "num_user_post": " 457", "author": "lee"}, {"date": "March 19, 2014 - 8:26 am", "content": "Hi,thank you for the answer! Will give a try!", "num_user_post": " 63", "author": "vespapierre"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-plugins/animation-using-plugins/", "posts": [{"date": "March 5, 2014 - 11:23 am", "content": "Dear all,I am wondering if there is possible to build and run small animations by using plugins.For example if a led turns on and off on an mbed board, let's say at a time interval of 1 min, I would like to see it also on a plugin on Thingspeak.Please let me know if this is possible and what kind of tools would be needed to build such plugin. By the way I found Thinkspeak a great project, thanks for make it free.", "num_user_post": " 7", "author": "Mircea3M"}, {"date": "March 5, 2014 - 11:45 am", "content": "Hi,Yes building this as a plugin is possible.  The easiest way I can think of would be to use JavaScript and jQuery's animate functions.lee", "num_user_post": " 457", "author": "lee"}, {"date": "March 6, 2014 - 9:55 am", "content": "Hi lee,thanks for the hint.It seems that I have to learn a little bit of jQuery .Mircea.", "num_user_post": " 7", "author": "Mircea3M"}, {"date": "March 10, 2014 - 11:57 am", "content": "Dear all, where goes the jQuery code fit in or how to load it within the html of the Thingspeak plugin platform.Thanks,Mircea", "num_user_post": " 7", "author": "Mircea3M"}, {"date": "March 10, 2014 - 12:12 pm", "content": "Hi all,I got it working. In case that somebody else didn't know how to make it, click on the following link https://thingspeak.com/plugins/3419 , right click on the page, then view page source and you'll get the point.Mircea.", "num_user_post": " 7", "author": "Mircea3M"}, {"date": "March 10, 2014 - 11:36 pm", "content": "Hi Mircea,I think your plugin is currently private, so nobody else can view it.  If you want others to be able to see your plugin, please edit it and uncheck the 'Private?' checkbox and then save your plugin.lee", "num_user_post": " 457", "author": "lee"}, {"date": "March 13, 2014 - 2:26 am", "content": "Hi lee, thanks for the observation...I made it public, anyway its just a simple use of jQuery, but good enough to help somebody without knowledge to get started.P.S. Regarding the forum...is there a way to receive notifications by email in case of a reply's to a topic or subject?", "num_user_post": " 7", "author": "Mircea3M"}, {"date": "March 13, 2014 - 10:37 am", "content": "Hi,There's no way that I know of to get notifications by email (but I'm not very familiar with how Wordpress works).lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-plugins/truncated-javascript-code-in-plugins/", "posts": [{"date": "January 4, 2014 - 6:39 am", "content": "I just discovered that my two plugins are not working anymore - without me doing any changes to them. When inspecting the source, it appears that the JavaScript code has somehow  been truncated, and when going to edit mode, I can also only see incomplete code.Has anybody else experienced something similar?nr", "num_user_post": " 7", "author": "nr"}, {"date": "January 5, 2014 - 4:50 pm", "content": "Hi,We don't truncate any of the JavaScript code from our side, it can be as long as you want.  Other plugins are working correctly on our system.  It seems that your two plugins were edited recently on Dec 26 and Dec 29.  Could you have accidentally edited them, or updated them using a (mobile?) device that truncated the data sent to our servers?lee", "num_user_post": " 457", "author": "lee"}, {"date": "January 6, 2014 - 7:30 pm", "content": "I haven't touched any of the plugins for several days (Dec 26/29 sounds about right), and at least one of them was working nicely until the day before yesterday. The JavaScript code for both plugins appear to have been truncated at the same position - making it quite an odd coincidence.Anyway, thanks for the feedback, lee.Apart from being puzzling, there's no harm done. I'll just insert the code again.nr", "num_user_post": " 7", "author": "nr"}, {"date": "February 3, 2014 - 4:35 am", "content": "Hi,I have had the same thing, on my plugin  https://api.thingspeak.com/plugins/2253It stopped working in the last month or so, but i have only just come back to see what the problem is. I haven't logged into the thinkspeak site for many months so it wasn't an edit from me.I don't seem to have a copy of what i had in it, (my bad) but you might want to check how this could have happened, data loss bugs are bad!Thanks,Simon", "num_user_post": " 1", "author": "whahoo"}, {"date": "February 3, 2014 - 12:09 pm", "content": "Hi Simon,I think I figured out the problem with some of the data being truncated.  In order to better support our international users, we recently switched some of our database tables over to UTF8, and in the process some irregular characters may have caused the data immediately after them to be lost.  Do you remember if you had any non-alphanumeric characters (perhaps right after the 'Temp') in your code?  I apologize for the data loss, but now that the tables have been converted to UTF8 it shouldn't happen again.lee", "num_user_post": " 457", "author": "lee"}, {"date": "February 3, 2014 - 2:50 pm", "content": "Simon, thanks for posting and backing me.I checked against the original code and can confirm that the JavaScript code in my two plugins was in fact truncated at the location of a non-alphanumeric character (the degree symbol, Unicode U+00B0). Thanks for solving the puzzle, lee.nr", "num_user_post": " 7", "author": "nr"}, {"date": "February 4, 2014 - 12:12 pm", "content": "Hi,Same problem for me. I have 8 active plugins.Four of them are truncated and i haven't edited them since a long time.Plugins : 1231,3905,3906,3907Like this one :    body {        background-color: #FFF;    }    var chart;    var charts;    var data;    google.load('visualization', '1', {        packages: ['gauge']    });    google.setOnLoadCallback(initChart);    function displayData(point) {        var conso        var dt = new Date();        var sec = (dt.getHours() * 3600) + (dt.getMinutes() * 60) + dt.getSeconds();        if ((sec > 23400) && (sec < 81000)) {            // Heures pleines 06:30 a 22:30            conso = point * 0.0001353;            // data.setValue(0, 0, '", "num_user_post": " 9", "author": "kulgan"}, {"date": "February 4, 2014 - 2:37 pm", "content": "Hi Kulgan,This was likely due to non-alphanumeric characters in your code, which caused data to be truncated when we converted our tables to UTF8.  We apologize for the problems this caused.lee", "num_user_post": " 457", "author": "lee"}, {"date": "February 6, 2014 - 11:22 am", "content": "Thank you for the solution, but is it possible to have the original script?Because I would prefer not to spent 2 hours to rewrite my code, if possible!", "num_user_post": " 9", "author": "kulgan"}, {"date": "February 6, 2014 - 12:05 pm", "content": "Unfortunately we can't retrieve the original script.lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-plugins/long-time-to-display-4-plugins/", "posts": [{"date": "December 17, 2012 - 5:22 am", "content": "Hi,I display 4 plugins. First i obtain two, and a few minutes after the two others. I don't understand why.There are two channels, one with 1 plugin and 1 with 3 plugins.It's like it was ok for the first plugins on each channel and needs more time to display second and third plugin on the channel which contains 3.Do you have this issue ?", "num_user_post": " 9", "author": "kulgan"}, {"date": "December 18, 2012 - 12:10 am", "content": "Hmm, this is an odd issue.I would say that the code in the Plugins are taking a long time to load or conflicting with each other. I would try not displaying them on a channel and see if that speeds up the loading of the channel.", "num_user_post": " 402", "author": "Hans"}, {"date": "December 18, 2012 - 9:08 am", "content": "Yes for my 3 temperatures I work on one chanel with 3 fields. I am going to create one channel by field ...", "num_user_post": " 9", "author": "kulgan"}, {"date": "December 20, 2012 - 12:32 pm", "content": "Yes, I confirm, it's ok with a plugin on a channel with only one field.", "num_user_post": " 9", "author": "kulgan"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-plugins/thingspeak-plugins/", "posts": [{"date": "December 16, 2012 - 5:39 pm", "content": "I write here because there is no 'ThingSpeak Plugins' place. I would like to send négatives values to a google gauge. But I don't knox how.It's to display temperatures values.So my gauge would start from -20° to +50° and for now I can display -20 to +50° scall but I send 10° and it's pointing on -10° that's the best i can do 🙁 Please Help.", "num_user_post": " 9", "author": "kulgan"}, {"date": "December 16, 2012 - 10:19 pm", "content": "Good idea, I have created a new forum for ThingSpeak Plugins and moved your topic here.From what I know special characters and the Google Charts API need to be encoded.I also found this topic: https://groups.google.com/forum/?fromgroups=#!topic/google-visualization-api/w_C-Jt1RaaULet us know if you find anything out.", "num_user_post": " 402", "author": "Hans"}, {"date": "December 17, 2012 - 5:08 am", "content": "Hi,Thank you for this new forum and Thank you very much for your link, it contains the solution for me !!!// I add the value + 20 to the gaugedata.setValue(0, 1, point + 20);// I display the correct value in the middledata.setFormattedValue(0, 1, String(point));Very nice ! I take this opportunity to thank you for ThingSpeak service. very very useful. !!", "num_user_post": " 9", "author": "kulgan"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-plugins/react-apps-is-not-reacting-for-no-data-check/", "posts": [{"date": "November 6, 2012 - 7:03 am", "content": "Basically I'm sending temp and humidity values to Thingspeak channel. I've setup React app for each channel to trigger alert when data has not been updated for hours. But these React configuration are not working, in both modes (Alarm one time, or each time the condition is met) As action, I've declared Prowl notification with the ThingHTTP Apps. Theses actions are working perfectly (when triggered manually using the correcponding URL) Setup for that is really basic, but I have maybe missed something to make the whole chain to work. Help will be welcome! Best regardsMarc ", "num_user_post": " 2", "author": "mamiot"}, {"date": "November 8, 2012 - 11:50 pm", "content": "Marc,We are looking into this, doing some tests. We will get back to you as soon as we find something.Thanks for letting us know,Hans", "num_user_post": " 402", "author": "Hans"}, {"date": "November 9, 2012 - 8:39 am", "content": "Marc Is your alert configured as a ThingTweet, or ThingHTTP when you're React is triggered?", "num_user_post": " 9", "author": "akinsgre"}, {"date": "November 9, 2012 - 10:31 am", "content": "Alerts are configured as a ThingHTTP, sending a request to Prowl. Theses 2 last days, I received several alert and I suppose it was you tests and troubleshooting operations. Many thanks for you helpBest regardsMarc", "num_user_post": " 2", "author": "mamiot"}]}]}