{"url": "https://community.thingspeak.com/forum/thingspeak-apps/page-1/", "threads": [{"url": "https://community.thingspeak.com/forum/thingspeak-apps/thingtweet-what-is-minimum-response-time-i-should-expect/", "posts": [{"date": "August 29, 2018 - 10:13 pm", "content": "I'm using a digital input connected to a ESP8266 to connect to ThingSpeak. I have then used ThingTweet to post tweets when the digital input status toggles.The digital input is monitoring a reed switch on an electrically operated gate which I'd like to monitor the open/closed status.Problem...  The gate open/close status does come through as tweets but so slow, several minutes....   Question... What is the minimum response I should expect keeping mind that the gate may only be open for say a minute. Where is the time delay being introduced?Thanks for your comments  in anticipation", "num_user_post": " 1", "author": "raybright"}, {"date": "September 4, 2018 - 2:26 pm", "content": "You should be able to drastically improve your performance time if you set up your own monitor instead of twitter.  You can use MQTT subscribe to get rapid feedback on a channel status.Here is an example showing publish and subscribe  for MQTT on ESP8266.https://www.mathworks.com/help/thingspeak/mqtt-publish-and-subscribe-with-esp8266.htmlYou can use the subscribe part to monitor the gate status, but you will have to use another device at the monitor point.  There are MQTT clients that will run on a cell phone, but I would use another ESP connected to a OLED display.  You can use the callback function to update the screen.I have been able to achieve sub second response time averages using MQTT subscribe.It would be interesting to know if you get an additional performance gain using MQTT publish to update the gate status. If you feel like implementing it in two parts, please let us know what you get after implementing each part, or just let us know MQTT helps ypur application.", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/is-it-possible-for-thingtweet-to-ignore-null-values/", "posts": [{"date": "August 25, 2018 - 10:32 am", "content": "Hi. Hope somebody can help. It's quite simple, I am bringing in data from a temperature sensor and when it is below 25 degrees it posts a tweet. However, occasionally the value returned from the sensor is null and it tweets when it shouldn't. Is there a way to have ThingTweet ignore NULL values?", "num_user_post": " 1", "author": "AussieBattler"}, {"date": "August 30, 2018 - 5:07 pm", "content": "Your plan is definitely possible, it requires just a little bit of administration, and it may increase the delay.  I would create another channel for filtered data.  Then create a MATLAB analysis that reads the data from your temperature sensor channel. If the value is normal, it writes to the refined channel  If the value is NULL, you can have it repeat the previous value or do a running average.  You can use a React or TimeControl to trigger the Analysis.  Then you can set up your react to trigger on the refined channel, and it wont have the problem with NULL values.   You can only have one react run 'On data insertion' so one of the two operations will need to be on a regular schedule.Let us know if that works for you.", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/post-to-thingspeak-com-using-esp8266-and-lua/", "posts": [{"date": "July 31, 2018 - 8:05 am", "content": "I am trying to send data to thingspeak.com When I type the following on the browser address bar,  my channel in the thingsspeak gets updated https://api.thingspeak.com/update?api_key=JYHBUME7WXOZ1B50&field1=12I am trying  to send the same address using ESP8266 using POST methid. I have code to connect to WiFi network. I need POST method command. Can anyone help?", "num_user_post": " 2", "author": "vkadal"}, {"date": "August 9, 2018 - 3:37 pm", "content": "The easiest way is to use the thingSpeak communication library.  Here is a good example.https://www.mathworks.com/help/thingspeak/read-and-post-temperature-data.htmlThis one shows you how to build the POST manually.  its harder, buy may offer more flexibility in some cases.https://www.mathworks.com/help/thingspeak/MoistureMonitor.htmlHere is the reference page for the write data method, which works with GET and POST.https://www.mathworks.com/help/thingspeak/writedata.html", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/tweet-me-an-alarm-message/", "posts": [{"date": "July 24, 2018 - 5:31 am", "content": "I have setup my Twitter acount but I can't understand how to setup a React to send me a tweet message if a battery is below a threshold. It seems that the only option I have in 'react' is to send a public tweet from my account.", "num_user_post": " 15", "author": "fmarzocca"}, {"date": "July 26, 2018 - 5:14 pm", "content": "ThingSpeak does not offer a way to send a direct message on Twiter.  You can send a public Tweet as you indicated.It is possible to use IFTTT to send a TEXT message or email.Seehttps://www.mathworks.com/help/thingspeak/use-ifttt-to-send-text-message-notification.htmlorhttps://www.mathworks.com/help/thingspeak/analyze-channel-data-to-send-email-notification-from-ifttt.html", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/similar-test-frequency/", "posts": [{"date": "May 28, 2018 - 9:37 pm", "content": "Hello,I have two different projects on the same account, and for each I want to have a react on data insertion, but if I select 'Run action each time condition is met' for two different reacts looking at two different channels, I get 'You have a React with similar Test Frequency, Action, and Option settings. Delete that React to save this one.'I'm registering only once every 5 minutes, in both channels, but no synchronization between them, and they are actually more than 500km from each other. Any way to overcome this limitation or this is a free account limit, and I should create two accounts ?Thanks", "num_user_post": " 1", "author": "ArgusR"}, {"date": "July 10, 2018 - 3:29 pm", "content": "This is an account limitation for any account type at present.  You can have at most 1 react that runs MATLAB code on data insertion.  Unfortunately, the 500 km would be only about 400 us apart, at least in terms of signal propagation. 🙂You could consider a time based react that runs every n minutes.  The react can call MATLAB code that looks back over the last n minutes, and evaluates all the entries for your condition of interest.  The read data REST call includes a minutes parameter you can use for this purpose.", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/timecontrol-doesnt-work/", "posts": [{"date": "July 2, 2018 - 5:17 am", "content": "Hi, guys, I need help with my TimeContol scheduling because it does not start. The column of last ran is always empty. My settings are:  recursive - 5 minutes. It's enough strange because the matlab function works properly if used manually.Regards", "num_user_post": " 3", "author": "Polaris82"}, {"date": "July 3, 2018 - 9:01 am", "content": "I presume the action is set to call the MATLAB function you refer to?Can you please try delelting this TimeControl and setting a new one with the same properties?Please let us know if that works.", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/scheduled-recurring-timecontrol-app-is-not-firedstarted/", "posts": [{"date": "January 4, 2018 - 6:49 am", "content": "Hi,I have several recurring timeControl app. What I have experienced that some of them usually is not started. Sometimes it is started, but it is random how it behaves. Those timers have actions interacting with talkback. Timers are recurring types, week based and should run every workdays at specified time.For example the timer (29180)is scheduled but that scheduled date is passed, so somehow skipped.Last Run: 2018-01-02 8:04 pm, Run At: 2018-01-03 8:00 pm Timer:(29186)Last Run:                                Run At: 2018-01-04 5:00 amCurrent time is Jan-04-2018 12:20:00 PM CET. Have you noticed similar problem or is it isolated just for me? Can someone check the log what the cause is of not starting the sheduled timers? I can provide the problematic timer IDs to check it: 29180 and 29186Thanks:Richlock", "num_user_post": " 2", "author": "richlock"}, {"date": "January 4, 2018 - 7:04 pm", "content": "I'm not sure I have correctly understood your problem, so please correct me if I got it wrong.You have several TimeControls set to execute on a daily schedule. Sometimes of them execute on schedule, while others do not. You're trying to troubleshoot this. correct?Information that would be helpful:   What apps are tied to your TimeControl?   How is the TimeControl interacting with TalkBack? Also, stepping back from the immediate issue you are trying to diagnose, can you provide more information describing your project so I can suggest something knowing about the application?", "num_user_post": " 225", "author": "Vinod"}, {"date": "January 5, 2018 - 3:34 am", "content": "I attached picture when the TimeControl did not run. It can be noticed that the column 'Last Run' did not refreshed after the prediefined time elapsed.Nor my relay, controlled by talkback, switched on or off. The talkback functionality is working as I can trigger it manually from postman or curl and my device act on it.This relay is for switching the heating. I try to replace my wall mounted programmable thermostat to have remote control possibilities and have original time control.I attached what is the detail one of my TimeControl settings. To overcome the issue, I edit the faulty timeControl (did not change anything) and save it. This way it is re-registered. Then I hope it will fired correctly next time.The last day it was OK, so the problem may be gone. But for me this TimeControl app is not so reliable.", "num_user_post": " 2", "author": "richlock"}, {"date": "July 2, 2018 - 10:05 am", "content": "I've the same problem, did you solve?", "num_user_post": " 3", "author": "Polaris82"}, {"date": "July 2, 2018 - 4:17 pm", "content": "Polaris82:Can you share the settings for your TimeControl?", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/thinghttp-get-trouble/", "posts": [{"date": "June 13, 2018 - 1:46 pm", "content": "I'm using Matlab to compare Data from two channels. On certain Conditions Data is written to an channel which in turn triggers react to start thinghttp.ThingHttp is supposed to send a simple get request to an url. The get request triggers a script on the server it is send to. Everything else is working. I simply need ThingHttp to sendthis get request. No need to handle any return. Simply putting the url in my browser works so the script and server are all right. Yet it does not work. In ThingHttp I only gave an url, set input to get and http type to 1.1.Can anyone help?", "num_user_post": " 3", "author": "codenascher"}, {"date": "June 13, 2018 - 4:25 pm", "content": "When you edit the request, you can see another request to trigger the ThingHTTP on the right hand side help pane.  If you copy this into your browser, does it trigger the URL you desired?  hat is the response from your browser to the trigger request?In the react, there is a table that indicates when it was last run.  Is your react running as you expect?", "num_user_post": " 401", "author": "cstapels"}, {"date": "June 13, 2018 - 5:38 pm", "content": "Okay, I found the problem. I tried to use placeholders like %%trigger%% in the url, thinking thinghttp would replace them with the actual values for me.", "num_user_post": " 3", "author": "codenascher"}, {"date": "June 13, 2018 - 9:43 pm", "content": "Sorry that was confusing.  Thanks for posting  the solution.  If you read the doc, can you answer the survey feedback on the page where you saw replacement keys?  That would really help us improve it.", "num_user_post": " 401", "author": "cstapels"}, {"date": "June 14, 2018 - 2:19 am", "content": "I will, thanks for the help.", "num_user_post": " 3", "author": "codenascher"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/talkback-button/", "posts": [{"date": "March 28, 2015 - 12:53 pm", "content": "Can someone help with how to formulate a URL for a Talkback command?I'd like to have a link (or a button) on a website to send a Talkback command.  It will be the same command everytime - click link/button, trigger a pin on the arduino Yun.  Instead of having to us the interface on Thingspeak, I'd like to use my webpage with a link.I've looked at the tutorials, but (and again, I am a newbie here) I'm getting stuck on the syntax.  I know I can code a URL to update a Channel Field pretty easily (so that if i copy it into the browser address bar, the field will update as desired). - BUT I can't get the same functionality for posting a Talkback Command.My attempt: ' https://api.thingspeak.com/talkbacks/1234/commands/?api_key=XXXXXXXXXX/?command_string=ON 'Does not work - returns the error:  'error_auth_required'", "num_user_post": " 8", "author": "notforyou23"}, {"date": "March 29, 2015 - 10:27 pm", "content": "So, I found a workaround - I'm actually using the Bridge functionality on the Arduino Yun to do just this...  Basically, sending a command to the Yun via a hyperlink on a webpage.  I am going from the Bridge example, but tweak it to have a switch go on and off.  Its clunky, but it works for now.if (command == 'opensesame') {      digitalWrite(RELAY, LOW);      delay(300);      digitalWrite(RELAY, HIGH);    }The issue with this is that when you click the hyperlink it brings you to that 'page' on the arduino yun (i.e.: arduino.local/arduino/opensesame/).  It would be better to just fire off a command and stay put.Good times.", "num_user_post": " 8", "author": "notforyou23"}, {"date": "May 27, 2018 - 5:53 pm", "content": "Hi,I am trying to put a toggle button to my channel, and open-close a led. I tried to use talkback to send a command to ardunio uno but i haven't succeeded yet. Did you manage to send on-off command to ardunio ? If yes can you help me about it?Thank you in advance,Have a good day.", "num_user_post": " 2", "author": "mehmetalisubasi"}, {"date": "June 10, 2018 - 2:54 pm", "content": "Talkback app is good for device control.   Sometimes I have been confused between getting commands (read list) and executing them (remove from list)I would recommend you start by getting your Arduino set up to read a channel value, and then move on to the Talkback.Since Talkback is not included in the ThingSpeak communication library at present, you will have to formulate the request format.  You could first use a cheerlights example to see how to read a field value:https://community.thingspeak.com/tutorials/arduino/cheerlights-with-arduino-and-the-fastled-library/You don't need pixels, you can just output to the serial port. (just be sure to disable to pixels control part if you don't have them.Then you can change the format of the GET request to the Talkback format:https://api.thingspeak.com/talkbacks/TALKBACK_ID/commands/executeIf you want to add commands the the Talkback queue, be careful to use the POST verb and format.You could also consider having your device subscribe to a channel using MQTT.  The MQTT subscribe feature will push messages to your device whenever the channel us updated.There is presently an example for particle photon, which is very similar to Arduino.https://www.mathworks.com/help/thingspeak/use-particle-photon-client-to-subscribe-to-channel-updates.htmlLet us know how it goes!", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/weird-channel-graphs-days1-goes-back-to-3-days-1/", "posts": [{"date": "June 10, 2018 - 4:25 am", "content": "I have 5 individual channels on Thingspeak and have set them all on days=1 in the url like the url below for example/charts/1?width=auto&bgcolor=%23ffffff&color=%233e92cb&days=1&dynamic=true&min=0&results=60&round=0&title=Care-Cube&type=column&xaxis=Tijdstip&yaxismin=0&sum=10However, when you view this on my website (link below)http://sennehoekman.be/masterproef/conflictvaardigheden.htmlYou see nothing at first, and then after a while it shows the data for 6th of june, WHICH IS 4 DAYS AGO?!How can I solve this? I just want my graphs to show today, which doesn't seem to work with setting it on 'days=1'?", "num_user_post": " 10", "author": "SenneHoekman"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/problem-with-thinghttp-help-needed/", "posts": [{"date": "May 27, 2018 - 6:26 am", "content": "Hello ThingSpeak Community,Recently I bought an ESP32-F Module and I started experimenting with the wifi. I want to get data from a website and read them thru the ESP. My code is ok, connecting to my ThingHTTP link and reading the data. Problem is that I can not read data from a website using ThingHTTP. Let's see an example:I want to get data from openweathermap (yes I know that they have already an API option but it's just an example)When creating a ThingHTTP, at the URL I paste https://openweathermap.org/city/734077Then using the inspect option I find the XPath of the humidity which is //*[@id='weather-widget']/table/tbody/tr[4]/td[2]Then I paste it at the Parse String, select GET and HTTP Version 1.1 and save it.Then when I use the link that it says, I keep getting: Error parsing document, try a different parse string.However in the second example:URL:https://www.timeanddate.com/worldclock/greece/athensParse String: //*[@id='ct']And then I get the data that I want.Why is that happening? I want to create a project that will get data from a website and display them on an LCD Screen. I also tried with receiving data from youtube without luck.Any help is welcome!P.S: I am new to the subject. I am sorry if I did something wrong. Please let me know.", "num_user_post": " 1", "author": "Alexan"}, {"date": "May 27, 2018 - 10:26 pm", "content": "What you have found is a common issue with ThingHTTP.  You can only parse the content that is originally loaded with the page.  If you inspect the source of the first page, you will see a weather-widget java script that is populating the table with the humidity data. That data is provided to the page by the script, but the data isn't there yet when thingHTTP attempts to parse the page for you.  If you look at the source of the second page, you will find the element 2:58:45 am, which is populated into the page at runtime (though it may be updated later.)At the present time, it is not possible for MATLAB or ThingSpeak to parse the final content of pages that have embedded code that populates elements after run time.Fortunately there is the API option as you pointed out.  There are also time APIs to read from the second page you described.You can use MATLAB analysis and the webread() function to return data from API calls and provide it to other apps or write to your ThingSpeak channel.", "num_user_post": " 401", "author": "cstapels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/react-problem/", "posts": [{"date": "May 22, 2018 - 4:45 am", "content": "Hello,First of all I want to thank Thingspeak developers and its community because I find it a very useful tool!I'm doing a university project reading values sent from a GPRS module.  Values are updated correctly in the corresponding fields, each 2-3 min.The problem comes when I want to send a tweet with ThingTweet and React. It should send me a tweet each time a specific field reaches a certain value, but it isn't doing it. This is the configuration I've: It seems that when the condition is met the first time in some hours, it sends the tweet, but then, if condition is met another time in the next minutes (8-9min I've checked) it doesn't send the tweet. I don't know what could it be the issue? There's any kind of limit that makes React not working until the next hour or something like that? Thanks,Dani", "num_user_post": " 3", "author": "sandan"}, {"date": "May 22, 2018 - 10:08 am", "content": "I just tested I react to a thingtweet that I have based on a numeric value for field 1 on a channel.  I was able to trigger it once and then again 8 minutes later, with similar settings as yours.Did you check the data in your channel to make sure it was updated?  If you were rapidly updating, a post may have exceeded the rate limit and been denied.  Also, sometimes numeric based reacts can be tricked by string like data.  Make sure the post that you want to trigger the react does not have any non numeric characters in it, especially non printable ones.You can test if the conditional setting is causing the failure by setting the condition to not equal to a string.  I have attached an example of a react that I want to run every time I post any data to the channel.  If your channel is public, can you share the channel #?", "num_user_post": " 401", "author": "cstapels"}, {"date": "May 22, 2018 - 5:43 pm", "content": "Hi, thanks for your time. How did you tried React, with 'Run action only the first time the condition is met'? I can't see the image. That's the way I did and it doesn't work. The data I'm using is from field 6 from channel thingspeak.com/channels/468578. You can see in field 6 that data has been a lot of times over 50000 (the React threshold) and in the Twitter account: twitter.com/senshort , there are only 11 tweets.There are only numbers in my data, so I don't think it's related with string problems. I can't see the image (link broken it seems), so I don't know how to make that condition you are explaining.", "num_user_post": " 3", "author": "sandan"}, {"date": "May 22, 2018 - 7:55 pm", "content": "Sorry, I cannot see the image you attached, but I am assuming you have set the React to 'Run action each time the condition is met'.Another thing to keep in mind is that Twitter does not allow tweet with the same text to be sent multiple times.This thread throws some light on that: https://twittercommunity.com/t/duplicate-tweets/13264So if your tweet is of the same text, it might be blocked by Twitter and hence not posted.Hope this helps.", "num_user_post": " 1", "author": "desaiankit"}]}]}