{"url": "https://community.thingspeak.com/forum/thingspeak-apps/page-16/", "threads": [{"url": "https://community.thingspeak.com/forum/thingspeak-apps/more-test-frequency-options/", "posts": [{"date": "July 7, 2014 - 7:57 am", "content": "Hi,I would like to have an option to set the Test Frequency parameter for check 1 or 5 minutes (and not only 10, 30, 60).The reason behind his is to show an 'No Data check' React in a m2m demo and 10 minutes will be too long to wait.Any Idea?", "num_user_post": " 12", "author": "DodBasim"}, {"date": "July 7, 2014 - 10:43 am", "content": "Hi,Due to the large number of Reacts currently in our system, unfortunately we won't be able to lower the frequency to 1 or 5 minutes since the Reacts consume a large amount of system resources, and lowering the frequency would have an adverse affect on the performance of ThingSpeak as a whole.lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/append-channelid-to-reactthinghttp/", "posts": [{"date": "June 25, 2014 - 4:23 pm", "content": "Hi,I would like to send the Channel ID with the http React call.The idea is to parse at the receiving side which sensor was triggered.It can be either in body or header (i'm writing the web service that's being triggered)Thanks for the help!", "num_user_post": " 12", "author": "DodBasim"}, {"date": "June 26, 2014 - 11:54 pm", "content": "Hi,Based on your request, we just added the ability to replace the Channel ID by using %%channel_id%%.  Please see https://thingspeak.com/docs/react#replacements for documentation.lee", "num_user_post": " 457", "author": "lee"}, {"date": "June 28, 2014 - 1:32 am", "content": "Lee,Wow!Thank you so much!I will give it a try.[Edit]Works! ", "num_user_post": " 12", "author": "DodBasim"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/cheerlights/", "posts": [{"date": "June 15, 2014 - 11:12 am", "content": "I'm playing with a cheerlights setup using an iobridge io-204 and an arduino. For now, just turning LEDs on and off with the color commands. Using the iobridge dashboard, via a serial widget, it works fine. I'm now working on setting up the twitter control, and running into issues. I'm guessing its some syntax issues that I'm just not getting right.Couple questions:For the body of the thinghttp app, is the iobridge widget ID entered within brackets or not? The trigger remains just as is, with the double%%?...from the docs, would appear that is the case. (Edit..the key piece not showing up properly in the message, so I just removed.....)   here is the info i'm working from: http://www.cheerlights.com/arduino-iobridge-cheerlights-controller  reference info for what to enter in thingspeak.The cheerlights website indicates just 3 things need to be inserted..method, body, and url..wondering if something has changed on the thingspeak side over time requiring more?Also..on the tweetcontrol app...the trigger is purely the color? No hashtags or reference to cheerlights?I've dug thru the documentation, tried several variations, but still not getting a response from the iobridge...Thanks for any and all suggestions.", "num_user_post": " 2", "author": "DonFL"}, {"date": "June 16, 2014 - 6:01 pm", "content": "Got it working. On the url for the iobridge thinghttp app, drop 'post'...simple as that.", "num_user_post": " 2", "author": "DonFL"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/tweet-control/", "posts": [{"date": "May 19, 2014 - 9:46 am", "content": "There is no manual for that so let me ask you here. I want to create a tweetcontrol which after I trigger it from Twiter it will send data to my embedded system. By that I mean that I have opened a tcp port which i read data. I want after I trigger the event to receive those data. In ThingHTTP in URL: I put my IP 100.xxx.xxx.xxx, method: Post , body : 'I want this to be in my device test spam spamspamm' , and host my lan's ip and port :Host: 192.168.1.10:5005 . I have set up my tcp socket where I read data, still after I trigger the tweetcontrol nothing is send to me. Any ideas?", "num_user_post": " 11", "author": "tester"}, {"date": "May 19, 2014 - 11:00 am", "content": "Hi,If you try to trigger just your ThingHTTP ( https://thingspeak.com/docs/thinghttp#send_request ) does that work?lee", "num_user_post": " 457", "author": "lee"}, {"date": "May 19, 2014 - 12:46 pm", "content": "As it seems no. I even tried to do it on my pc,params = urllib.urlencode({'api_key ':'...','message': 'sdasdsadasdasdas'})headers = {'Content-type': 'application/x-www-form-urlencoded','Accept': 'text/plain'}conn = httplib.HTTPConnection('api.thingspeak.com:80')conn.request('POST', '/send_request', params, headers)response = conn.getresponse()print response.status, response.reasondata = response.read()conn.close()I get Error: 404 Not found.", "num_user_post": " 11", "author": "tester"}, {"date": "May 19, 2014 - 12:51 pm", "content": "Let me ask you something.TweetControl  sends a warning to ThingSpeak when a trigger is pulled and then the ThingSpeak site-server will send the selected ThingHTTP request to the device or not ?", "num_user_post": " 11", "author": "tester"}, {"date": "May 19, 2014 - 2:53 pm", "content": "Hi,I think you have the ThingHTTP test URL wrong, it should be: http://api.thingspeak.com/apps/thinghttp/send_request (you seem to be missing '/apps/thinghttp' in your test POST).Yes you are correct, posting on Twitter with the #thingspeak hashtag and your trigger word will send the alert to ThingSpeak, which will then use ThingHTTP to send data to your device.lee", "num_user_post": " 457", "author": "lee"}, {"date": "May 20, 2014 - 3:34 am", "content": "Yes you are right about the POST query. It was wrong. I can activate the ThingHttp now only problem is that it does nothing. I mean I use as URL my public IP and as host my private ip and port as I wrote above. I sniff the packets and after I send the http-request, I get a response HTTP OK 200 and then I dont see any (http-)response on my newtwork at all. I use body to send data body : 'hello pc', still I dont see the data while I sniff the packets. I have used all methos (POST/GET/DELETE/PUT).I tried this too. I forwarded a port on my router and used as Host : PublicIP:port . Still I dont see the http response from the server.ThingHTTP settings:API KEY:6LFV2M18ZL5ZANZQMETHOD: POSTContent Type:application/x-www-form-urlencodedHTTP Version:1.1Host: 176.92.xx.xx:5000Body: Hello Worldall the other forms are null.", "num_user_post": " 11", "author": "tester"}, {"date": "May 20, 2014 - 1:22 pm", "content": "This problem seems like it may be due to the configuration of your local network (possibly NAT problems).  From this article: http://www.i-programmer.info/babbages-bag/1721-ip-addressing-and-routing.html?start=2 , 'For example, how can someone on the Internet gain access to one of the machines on the internal network? The simple answer is they can’t because the router only delivers packets that arrive in response to outgoing packets and none of the machines connected to the local network have valid IP addresses. That is, it is impossible for an external agent to initiate a connection to a local machine.'Are you able to send a GET or POST from another web browser not on your local network to your specified PublicIP and port?As an alternative, you may want to check out our TalkBack app ( https://thingspeak.com/apps/talkbacks ).  You can make a ThingHTTP request that adds a TalkBack command ( https://thingspeak.com/docs/talkback#add_command ), and then have your device periodically check if there are any TalkBack commands to execute and act on it accordingly.  Then you can hook that ThingHTTP up to TweetControl, and by posting on Twitter you should be able to control your device.", "num_user_post": " 457", "author": "lee"}, {"date": "May 20, 2014 - 1:54 pm", "content": "Nice alternative. I will check it tomorrow and I'll let you know. Thanks and sorry for bothering you.", "num_user_post": " 11", "author": "tester"}, {"date": "May 21, 2014 - 10:50 am", "content": "Yeah, worked like a charm. Thanks Lee.", "num_user_post": " 11", "author": "tester"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/thinghttp-using-unicode-trigger/", "posts": [{"date": "April 2, 2014 - 2:45 pm", "content": "i am trying to use an arabic trigger words to trigger the thinghttp action. i have a feeling triggering is not taking place because maybe unicode is not recognized, is there a way to resolve this issue?", "num_user_post": " 6", "author": "muscatco2"}, {"date": "April 2, 2014 - 8:33 pm", "content": "Hi,I'll take a look into this further, what's the ThingHTTP ID?lee", "num_user_post": " 457", "author": "lee"}, {"date": "April 2, 2014 - 10:33 pm", "content": "you mean the API key ? X8UE4NIGCC2ML17C", "num_user_post": " 6", "author": "muscatco2"}, {"date": "April 3, 2014 - 12:40 am", "content": "Hi,Your ThingHTTP ID is 1215 (feel free to reset your API key).  There was no problem with ThingHTTP, but there was a problem where TweetControl was filtering out UTF8 characters.  I updated the code to be UTF8-compatible; you can try Tweeting your message again and everything should work properly.lee", "num_user_post": " 457", "author": "lee"}, {"date": "April 3, 2014 - 8:49 am", "content": "it worked !!!! million thanks really appreciated, that was quick", "num_user_post": " 6", "author": "muscatco2"}, {"date": "April 6, 2014 - 11:55 pm", "content": "will this also help the thing tweet ? as there also the Arabic text is not shown whenever the tweet is is Arabic!!", "num_user_post": " 6", "author": "muscatco2"}, {"date": "April 7, 2014 - 11:09 am", "content": "Hi,You should be able to use ThingTweet with UTF8 characters too without a problem.lee", "num_user_post": " 457", "author": "lee"}, {"date": "April 7, 2014 - 2:37 pm", "content": "could it be that Iobridge platform is what blocks it ? because it does not tweet ?!!", "num_user_post": " 6", "author": "muscatco2"}, {"date": "April 7, 2014 - 3:04 pm", "content": "Hi,I'm not sure what you mean by the ioBridge platform blocking it.   Can you try following the instructions at https://thingspeak.com/docs/thingtweet#update and let me know if that works?lee", "num_user_post": " 457", "author": "lee"}, {"date": "April 8, 2014 - 2:11 pm", "content": "yes i sow that, it will be a good way to isolate the problem. in my original project is to do the POST through iobridge gateway, which works when i sent latin charactors , the moment i try to send arabic it does not.", "num_user_post": " 6", "author": "muscatco2"}, {"date": "April 10, 2014 - 9:24 am", "content": "We will have to check on the ioBridge side... but you may be right, the Latin character set might be what is currently supported from the ioBridge actions.", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/react-with-no-data-points-is-not-working/", "posts": [{"date": "April 1, 2014 - 3:41 am", "content": "Hi,it seems the react rule with no data point setting is not working...I have two of these 'rules'. In case of checking the link, that is ok.Thanks!", "num_user_post": " 63", "author": "vespapierre"}, {"date": "April 1, 2014 - 12:11 pm", "content": "Hi,I just tested this out and it seems to be working fine from my end.  The Channel that is monitored for 'no data' must already have some feed data in it, can you verify that that is the case for your Channels?  Otherwise, please let me know the React IDs and I'll look further into this problem.lee", "num_user_post": " 457", "author": "lee"}, {"date": "April 4, 2014 - 11:33 am", "content": "Hi Lee,you are right, I have cleared the channel, but I am still testing. I will back to you soon!Thanks!", "num_user_post": " 63", "author": "vespapierre"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/why-does-this-xpath-fail/", "posts": [{"date": "February 7, 2014 - 12:32 am", "content": "URL=http://www.bom.gov.auParse String =//div[@class='capital']//a[@href='/vic/forecasts/melbourne.shtml']/p[@class='now']/spanWorks OK if I use //div[@class='capital']//a  but my every attempt to filter it further results in an error.I also tried the following with same result. (All work OK in Firefox with FirePath)//div[@class='capital']//a/h3[text()='Melbourne']/../p[@class='now']/span//a[@href='/vic/forecasts/melbourne.shtml']/p[@class='now']/spanAny chance you could modify the error message to tell the difference between wrong xpath syntax and no matching data?", "num_user_post": " 271", "author": "rw950431"}, {"date": "February 7, 2014 - 12:23 pm", "content": "Hi,The dot in the xpath was throwing our parser off.  We just made some changes that should fix this, please try your ThingHTTP request again.lee", "num_user_post": " 457", "author": "lee"}, {"date": "February 9, 2014 - 11:11 pm", "content": "Looking much better. The following //a[@href='/vic/forecasts/melbourne.shtml']/p[@class='now']/span/text()returns 23.4°Is there an xpath way to trim the trailing degree symbol off . Suspect the translate() or replace() functions might work but I dont know enough of the syntax to figure out how.  Ideally theres a general solution that will strip out anything thats not a part of a valid number (ie +-.0123456789)", "num_user_post": " 271", "author": "rw950431"}, {"date": "February 10, 2014 - 1:08 pm", "content": "Hi,Unfortunately we don't support xpath functions.lee", "num_user_post": " 457", "author": "lee"}, {"date": "February 10, 2014 - 7:38 pm", "content": "Thanks for the info Lee.Its still a very useful feature for internet-connected microcontrollers or devices on slow links that have difficulty decoding html on their own.", "num_user_post": " 271", "author": "rw950431"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/twitter-last-update-time-via-thinghttp/", "posts": [{"date": "February 6, 2014 - 10:42 pm", "content": "I was looking for a way to check when a twitter feed was last updated.  Twitter now require OAuth to access their API which is a pain to set up.The following ThingHTTP will return the time of the last tweet from a Twitter page. Format is 'seconds since 01-01-1970' aka epochtime and appears to be in the timezone of the page.URL=Tweets by CocaColaParse String=(//span/@data-time)[1]As a demo below is a small linux shell script that calculates how long since I posted to my twitter feed.  (The LAST= line isnt supposed to break like that)#!/bin/bashNOW=$( date +%s )LAST=$( wget -q -O- 'http://api.thingspeak.com/apps/thinghttp/send_request?api_key=HP66QVBRTW4ISD8B' )(( HOWLONG= $NOW - $LAST ))echo Last update $HOWLONG seconds ago", "num_user_post": " 271", "author": "rw950431"}, {"date": "February 6, 2014 - 11:15 pm", "content": "Also found thatParse String=//a[@data-element-term='follower_stats']/strong/@titleWill give the number of followers.  Format is numeric but with commas separating groups of 3 digits.eg coca-cola has 2,302,043 followers (slightly more than me...)I can highly recommend the Firefox extension 'FirePath' for figuring out Xpath syntax.", "num_user_post": " 271", "author": "rw950431"}, {"date": "February 7, 2014 - 12:06 pm", "content": "Thanks for posting your example parse string!lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/parse-json-data-with-thinghttp/", "posts": [{"date": "February 4, 2014 - 8:47 pm", "content": "Wondering if its possible to extract a field from JSON data using ThingHTTP?  JSON seems to be overtaking XML as the web's data exchange format of choice.For example extracting the 'likes' count from a facebook page using the graph API eg https://graph.facebook.com/cocacola.  (I know that you can request individual parameters using FB's API but I'm using this as a accessible example of a more general case)Am I right in thinking that there is no way to insert such a result into a channel without an external device?   Using a React on no data inserted for X minutes would seem obvious but I couldnt see any way that the React could update a channel with the result.", "num_user_post": " 271", "author": "rw950431"}, {"date": "February 5, 2014 - 12:25 am", "content": "Hi,You're right that we should support JSON parsing via ThingHTTP, so we just added this ability.  Using your example at https://graph.facebook.com/cocacola , you can parse the JSON via its keys, for example using the ThingHTTP parse strings 'founded', 'cover', or 'cover.cover_id' would all work.  Here's a ThingHTTP I created that parses that URL using 'cover.cover_id' (no quotes) as the parse string: http://api.thingspeak.com/apps/thinghttp/send_request?api_key=D1W3ZMRTQY5AO6AX .In terms of logging this data to a Channel, we leave it up to users to create applications that would do this.lee", "num_user_post": " 457", "author": "lee"}, {"date": "February 5, 2014 - 7:01 pm", "content": "Lee/   Thanks for that great news!  But what syntax is needed to obtain an array member?For example how to extract the 'refresh_message' from http://www.bom.gov.au/fwo/IDN60901/IDN60901.94768.json ?observations.header gets the whole array.   observations.header.refresh_message still gives the whole arrayobservations.header[0] gives 'Error parsing document, try a different parse string'", "num_user_post": " 271", "author": "rw950431"}, {"date": "February 6, 2014 - 1:40 am", "content": "We just added the ability to parse JSON with arrays too.Here's an example I created:ThingHTTP URL: http://www.bom.gov.au/fwo/IDN60901/IDN60901.94768.jsonParse string: observations.header[0].refresh_messageTest using: http://api.thingspeak.com/apps/thinghttp/send_request?api_key=4QPDGE1HA95U0QBMlee", "num_user_post": " 457", "author": "lee"}, {"date": "February 6, 2014 - 6:37 am", "content": "Excellent work! Thanks.Is there a list of public thingHTTP's or any other way of easily sharing?", "num_user_post": " 271", "author": "rw950431"}, {"date": "February 6, 2014 - 12:03 pm", "content": "Currently there is no list of public ThingHTTPs.lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/send-feed-value-with-react/", "posts": [{"date": "May 4, 2012 - 11:36 am", "content": "Hi there,I was wondering if there is a way to have ThingHTTP send unique feed values in the body of the POST that it sends when triggered by a React.  I am setting up temperature sensors and want them to trigger alarms at high and low values.  I would like the ThingHTTP to send json data to a PHP script with the information of which sensor and what the triggering value was. I'm transitioning from pachube to thingspeak and on pachube I was able  to set a trigger for each feed and when it got triggered it would send an http post with that feed's id and value. The React on here doesn't seem to pass any values that would tell my ThingHTTP alarm which feed and what value caused it to go off. Can I even send my own feed data through ThingHTTP to my external PHP script?  Am I thinking about this all the wrong way? Thanks for any help you can offer.-Tim", "num_user_post": " 2", "author": "vwtimah"}, {"date": "May 4, 2012 - 10:15 pm", "content": "I think I understand what you are asking...First, create a ThingHTTP request. In the Body of the request you can write anything you want. This includes JSON. In there you can put info that your PHP script may need to parse. Use the replacement: %%trigger%% in the Body and we will replace that string with what the trigger of your React is.Second, create your react and set the trigger value and select your ThingHTTP request.When data comes in that meets that condition, React will execute the ThingHTTP command and then do any detect replacements.I think that will do the trick for you. Let us know.", "num_user_post": " 402", "author": "Hans"}, {"date": "May 8, 2012 - 1:26 pm", "content": "Thank you Hans, that is just what I was looking for.  I missed that when reading through the React docs. Does React pass any other variables that can be parsed with '%%'? Thanks again, I'm really enjoying thingspeak so far compared to pachube. Looking forward to seeing what 2.0 brings as well.", "num_user_post": " 2", "author": "vwtimah"}, {"date": "July 18, 2013 - 12:56 pm", "content": "This is really cool, I also missed the %%trigger%% placeholder and it is what I needed.Side question: if I setup a Geo React, is there a way to pass the result of the calculation to ThingHTTP? I don't mean true or false, I mean the actual distance value? %%trigger%% doesn't seem to do the trick.Thanks for all your help!", "num_user_post": " 4", "author": "claudiuo"}, {"date": "February 5, 2014 - 6:32 am", "content": "vwtimah said Thank you Hans, that is just what I was looking for.  I missed that when reading through the React docs. Does React pass any other variables that can be parsed with '%%'? Thanks again, I'm really enjoying thingspeak so far compared to pachube. Looking forward to seeing what 2.0 brings as well.I have seen this question several times looking through different posts in the Forum and not once it was answered to the user. Hope that ThingSpeak answers it one day !!!", "num_user_post": " 1", "author": "murilo.picanco"}, {"date": "February 5, 2014 - 1:34 pm", "content": "Hi,Currently there are no other values besides %%trigger%% that can be parsed via React, and the %%trigger%% in Geo calculations does not return the distance.  We are actively developing ThingSpeak though, and will try to improve the features available to React and ThingHTTP.lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/thingtweet-status/", "posts": [{"date": "June 13, 2013 - 1:41 pm", "content": "Is ThingTweet working?  I haven't had a message get through for two days now.  I am getting 'HTTP/1.1 200 OK' back from the server after my post but it never shows up on Twitter.", "num_user_post": " 35", "author": "JChristensen"}, {"date": "June 14, 2013 - 2:24 am", "content": "Same problem here,it is about two days that tweets are not sent anymore.Any reason?I will try to change the api key.Best Regards", "num_user_post": " 3", "author": "davtas"}, {"date": "June 14, 2013 - 8:13 am", "content": "@davtas, thanks for the confirmation.I haven't changed my application for months, so I'm not inclined to change anything without hearing from ThingSpeak support on this.What can you tell us, folks??", "num_user_post": " 35", "author": "JChristensen"}, {"date": "June 14, 2013 - 8:55 am", "content": "Mine stopped working as well.  I tried regenerating my key and changing the code in my arduino, but still no luck.  I then unlinked my twittter account, and tried to re-authorize thingtweet to my twitter account.  Now I cannot get that to work.  Every time now, when I try to authorize the app, I get redirected to  a message that simply says 'Twitter Fail'.", "num_user_post": " 1", "author": "kg4jam"}, {"date": "June 14, 2013 - 5:17 pm", "content": "@kg4jam, appreciate the confirmation.  I was about to try what you did.Is anyone from ThingSpeak paying attention to this thread?Is ThingTweet actually *working* for anyone at this time?", "num_user_post": " 35", "author": "JChristensen"}, {"date": "June 14, 2013 - 5:28 pm", "content": "According to this gentleman, Twitter has changed their API.Tweets by davide_tasca", "num_user_post": " 35", "author": "JChristensen"}, {"date": "June 17, 2013 - 4:28 am", "content": "Check this, for confirmation of our problemTweets by thingspeakI wish the problem could be solved very soonRegards.", "num_user_post": " 3", "author": "davtas"}, {"date": "June 17, 2013 - 7:34 am", "content": "davtas said Check this, for confirmation of our problemTweets by thingspeakI wish the problem could be solved very soonRegards.Yes, I did see that, thanks.  Unfortunately that is the only information that I have seen from ThingSpeak on the problem, and that was posted three days ago now.As of tomorrow the problem will be a week old and I am very disappointed at the lack of information that has been forthcoming from ThingSpeak.  I would have expected better communication and some indication of estimated time to repair before now.I use ThingTweet as part of a home monitoring system.  While I only have a small number of systems installed, when I finish writing this I will be contacting my users to tell them that alerts are not functioning.", "num_user_post": " 35", "author": "JChristensen"}, {"date": "July 1, 2013 - 8:22 am", "content": "ThingTweet has been working for the past 7-8 days.  Who do we thank for fixing it?", "num_user_post": " 35", "author": "JChristensen"}, {"date": "July 1, 2013 - 10:04 pm", "content": "Sorry, it looks like I missed this thread. In fact Twitter did change their API, we had a dependency that did not get updated until about 10 days ago. As soon as it was ready, we made the update.", "num_user_post": " 402", "author": "Hans"}, {"date": "January 27, 2014 - 10:56 pm", "content": "Until recently, my Arduino project with ThingTweet had been working fine.  Now I get 'HTTP/1.1 400 Bad Request' and 'Invalid API Key' responses.  Has there been a change to the API?", "num_user_post": " 5", "author": "TonyC"}, {"date": "January 28, 2014 - 12:22 am", "content": "My Arduino feeds are working.  Have you made any changes?", "num_user_post": " 70", "author": "turgo"}, {"date": "January 28, 2014 - 12:21 pm", "content": "Hi,We haven't made any changes to ThingTweet, everything seems to be working fine from our end.  Here's an example you can try out from one of our test accounts:http://api.thingspeak.com/apps/thingtweet/1/statuses/update?api_key=UUADCKL1TM92VNAL&status=test%20postTweets by thingspeaktestlee", "num_user_post": " 457", "author": "lee"}, {"date": "January 28, 2014 - 8:21 pm", "content": "Thanks, Turgo.  The only change I made was to re-generate my API key.  ThingTweet had been working fine for me, until I started receiving 'Invalid API key' messages.  I re-generated my key, but it didn't help.Thanks, too, Lee.  ThingTweet works OK for me if I send the request from my browser.  My Arduino code worked OK before, and its POST command follows the protocol as described in the ThingTweet documentation.  Are there any logs that would be accessible to me to verify my Arduino's HTTP commands?", "num_user_post": " 5", "author": "TonyC"}, {"date": "January 28, 2014 - 10:41 pm", "content": "Tony, send me the details of your ThingTweet (lee at iobridge dot com) and I'll try to pull up the relevant server logs.lee", "num_user_post": " 457", "author": "lee"}, {"date": "January 29, 2014 - 1:56 pm", "content": "Another suggestion you can try is to unlink and then relink your Twitter account, since Twitter may have expired some of the authorization tokens that we have stored for your account.lee", "num_user_post": " 457", "author": "lee"}, {"date": "January 30, 2014 - 5:01 pm", "content": "Thanks, Lee - the relinking did the trick!", "num_user_post": " 5", "author": "TonyC"}, {"date": "February 2, 2014 - 1:30 pm", "content": "Howdy, Lee - ThingTweet started working again for me after the relinking, but hasn't worked since the database upgrade.  I tried relinking again, but it didn't help.  Here's the server response:HTTP/1.1 400 Bad RequestServer: nginx/1.5.7Date: Sun, 02 Feb 2014 03:41:46 GMTContent-Type: text/html; charset=utf-8Transfer-Encoding: chunkedConnection: closeStatus: 400 Bad RequestX-Frame-Options: ALLOWALLAccess-Control-Allow-Origin: *Access-Control-Allow-Methods: GET, POST, PUT, OPTIONS, DELETE, PATCHAccess-Control-Allow-Headers: origin, content-type, X-Requested-WithAccess-Control-Max-Age: 1800Cache-Control: no-cacheX-Request-Id: 2d9d912e-6922-44d0-a61f-86d8676c2600fInvalid API Key0Do you know what's going on?  Thanks for your help!Tony", "num_user_post": " 5", "author": "TonyC"}, {"date": "February 2, 2014 - 5:32 pm", "content": "Hi Tony,After relinking your account, did you make sure to use your new ThingTweet API key?lee", "num_user_post": " 457", "author": "lee"}, {"date": "February 3, 2014 - 6:23 pm", "content": "Hi lee - Yes - just double-checked.  New API key is correct.Tony", "num_user_post": " 5", "author": "TonyC"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/thinghttp-body-information-lost/", "posts": [{"date": "January 31, 2014 - 5:32 am", "content": "Hi,I have realized, that mya previously defined body values of all my ThingHTTP' have been lost! Not the whole string, but has been cut. Due to this I haven't received Android push messages.Can you tell me what caused this problem? Any server side backolad or something?Thanks!", "num_user_post": " 63", "author": "vespapierre"}, {"date": "January 31, 2014 - 11:16 am", "content": "Hi,We recently performed a database upgrade that may caused some minor unintended problems, we apologize for this.lee", "num_user_post": " 457", "author": "lee"}, {"date": "February 2, 2014 - 3:08 am", "content": "Hi Lee,thanks for the information! No problem!", "num_user_post": " 63", "author": "vespapierre"}]}]}