{"url": "https://community.thingspeak.com/forum/thingspeak-projects/page-3/", "threads": [{"url": "https://community.thingspeak.com/forum/thingspeak-projects/error-using-thingspeak-command-in-a-matlab-program/", "posts": [{"date": "May 5, 2017 - 11:17 pm", "content": "I am very impressed what thingspeak cloud service do but now, I can't solve the problem with running matlab code that ask for waiting the 15 second although I put the delay(45) up and down the command.  Please help me for the current project according to the attacted photo.Error displayMatlab command", "num_user_post": " 3", "author": "zkornz"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-projects/error-while-attempting-http-get-with-sim808/", "posts": [{"date": "March 12, 2017 - 10:09 am", "content": "hiim trying to update thinkspeak from sim808 but getting network error . kindly please check below and let me know if this is anything wrong in my methodology. im using terminal.exe to send command via RS232.ATOKAT+CREG?+CREG: 0,5 //connected in roamingAT+SAPBR=3,1,'Contype','GPRS'OKAT+SAPBR=3,1,'APN','www' //VODAFONE INDIA 'www' is APN (as per the operator)OKAT+SAPBR=3,1,'USER','' //blank (as per the operator)OKAT+SAPBR=3,1,'PWD','' //blank (as per the operator)AT+SAPBR=1,1OKAT+HTTPINITOKAT+HTTPPARA='CID','1'OKAT+HTTPARA='URL','https://api.thingspeak.com/update?api_key=MY_KEY&field1=VALUE'OKAT+HTTPACTION=0+HTTPACTION: 0,603,0 //means network error as per the documentnote: while im typing in browser url box, https://api.thingspeak.com/update?api_key=MY_KEY&field1=VALUE, i can able to update my field. i can able make call, send sms, i have internet packPLEASE HELP", "num_user_post": " 2", "author": "SankarSaba"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-projects/what-will-be-the-ip-address-of-my-channel/", "posts": [{"date": "February 24, 2017 - 4:14 am", "content": "I want the data from my ARM7 LPC2387 to be sent to my ThingSpeak Channel. Initially it was going to this server. #define DFLT_SERVER_IP          '118.67.249.235'What should be the modifications? including code modifications.", "num_user_post": " 5", "author": "arvimg"}, {"date": "February 25, 2017 - 2:25 pm", "content": "Can your device do DNS resolution? If so I would strongly recommend you send your data to api.thingspeak.com instead of using a static IP. ", "num_user_post": " 225", "author": "Vinod"}, {"date": "February 27, 2017 - 2:07 am", "content": "Can you mention specific code lines to send data to api.tingspeak.com ?what modifications would be required in the current scenario where it takes static IP? I am using Attolic True Studio for ARM development. I guess this is the outline of the code required.create a socketlookup the IP addressopen the socketsend the requestwait for the responseclose the socket", "num_user_post": " 5", "author": "arvimg"}, {"date": "February 27, 2017 - 6:41 am", "content": "You might want to take a look at the source for the official ThingSpeak library for Arduino and base your source on it.https://github.com/mathworks/thingspeak-arduinoSpecifically, see this file:https://github.com/mathworks/thingspeak-arduino/blob/master/src/ThingSpeak.h", "num_user_post": " 225", "author": "Vinod"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-projects/building-weather-station-only-first-field-is-being-updated/", "posts": [{"date": "February 15, 2017 - 8:03 pm", "content": "I can only update one data field at time. Pls advise. My work flow was create TS channel/fields, add channelID and APIKey info to Arduino sketch, add the code below to sketch. All data is seen on computer monitor. void loop() {BME280Temp=(bme.readTemperature()*1.8+32);  ThingSpeak.writeField(myChannelNumber,1,BME280Temp,myWriteAPIKey);   Atemp=(am2315.readTemperature()*1.8+32);  ThingSpeak.writeField(myChannelNumber,2,Atemp,myWriteAPIKey);      BME280Humi=(bme.readHumidity());  ThingSpeak.writeField(myChannelNumber,3,BME280Humi,myWriteAPIKey);   Ahumi=(am2315.readHumidity());  ThingSpeak.writeField(myChannelNumber,4,Ahumi,myWriteAPIKey);   BME280StationPressureMillibars=(bme.readPressure()/100);  BME280EquivSeaLevelPressureMillibars=(BME280StationPressureMillibars+(16/9.2));  BME280Press=(BME280EquivSeaLevelPressureMillibars*0.02953);  ThingSpeak.writeField(myChannelNumber,5,BME280Press,myWriteAPIKey);   Serial.print(BME280Temp,0);  Serial.print(' F  ');  Serial.print(Atemp,0);  Serial.print(' F  ');  Serial.print(BME280Humi,0);  Serial.print('%  ');  Serial.print(Ahumi,0);  Serial.print('%  ');  Serial.print(BME280Press,2);  Serial.println(' InHg');   delay(20000);", "num_user_post": " 2", "author": "hannon1000"}, {"date": "February 15, 2017 - 8:37 pm", "content": "You're attempting to write to multiple fields in a channel faster than your capacity as a free user allows you. Take a look at this example:https://github.com/mathworks/thingspeak-arduino/blob/master/examples/WriteMultipleVoltages/WriteMultipleVoltages.inoIt uses setField to set each individual field and combines the data from multiple fields into one write using writeFields.", "num_user_post": " 225", "author": "Vinod"}, {"date": "February 17, 2017 - 10:44 pm", "content": "Thank-you very much Vinod for your kindness while pointing out my 'duh'. I added delay lines. I see all graphs being updated.  Next steps are to add code that resets comm with TS if comms lost and code for sleep mode. Thanks again!!Kevin", "num_user_post": " 2", "author": "hannon1000"}, {"date": "February 18, 2017 - 11:12 am", "content": "You're welcome, Kevin.If you have a public channel and a blog or video linked to the project, maybe others can learn from it too.  We'd love to hear more about your project on the forum. ", "num_user_post": " 225", "author": "Vinod"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-projects/gas-meter-automation/", "posts": [{"date": "July 22, 2016 - 2:42 pm", "content": "Hello everyone!I'm working on an amateur project for my summer house. A gas meter with an impulse external module is installed there. I'm going to connect this external module with Arduino and via Internet upload information to ThingsSpeak.The problem is in the following: the external module provides me only an impulse. And I can upload a ping (1) to ThingsSpeak via Internet. This is useful in terms that I know when the meter counts another 0,01 cub.m. of gas. But I also would like to see not only pings at the time scale but also the current amount of pings. That means that every new ping should increase the total amount of pings at ThingsSpeak.I briefly checked the samples and functions description but couldn't find a way how to increase the total amount of pings at ThingsSpeak. Please correct me if I'm wrong. So the only way how to solve this is to get the last ping number from ThingsSpeak and with the every new ping increase it at Arduino side and send updated value to ThingsSpeak. And here I have also two options. Get the last ping amount from ThingsSpeak at startup of Arduino or get it before every single ping submission. I'm happy to see your opinions about this.", "num_user_post": " 28", "author": "kvv213"}, {"date": "July 23, 2016 - 6:09 am", "content": "Hello kvv213I do upload similar data for my gas consumption, but not on Thingspeak.However, I am using Thingspeak for other data.I can imagine the following process:- Upload your counter (1) on channel 1- Read channel 1 and write back to channel 2If, at the same time, you can read channel 2 (last value) and add 1, you should have your accumulated data.Once again, this is pure theory!There is an example on this server, under MATLAB Analysis, called 'Convert Celsius to Fahrenheit'.It shows how to read from a channel and write to another one.Let us know if you manage to make it work.Hope that help.daturach", "num_user_post": " 7", "author": "daturach"}, {"date": "July 25, 2016 - 1:43 am", "content": "daturach said  I can imagine the following process: - Upload your counter (1) on channel 1 - Read channel 1 and write back to channel 2 That looks like the 3rd option how to store meter's values at ThingSpeak. I don't see anything difficult in that. And it is is similar to just pre read the latest value from the main channel and upload an incremented value to the same channel.Option 1: Download the latest value from ThingSpeak at Arduino start-up and store it in the memory. Pros: we need to download it only once. Cons: if something wrong at Arduino side the results may be wrong (but likelikilyhood is very very low).Option 2: Download the latest value just before update the channel. Increment and update another channel. Pros: we can adjust the latest value from outside (for example justify meter's count) and we don't need to reboot Arduino. Cons: the server responce can be delayed and that leads to a potentiall miss of a click from the meter (the system is busy with waiting responce from the server).Option 3: Download the latest value from one channel then update both of them. Pros: mmmmm. Cons: requires 3 times more time than Option 1. BTW were did you upload your values? Was it a public service?", "num_user_post": " 28", "author": "kvv213"}, {"date": "July 25, 2016 - 3:40 am", "content": "I suspect you really want to display a rate (how many impulses per hour/day etc) rather than a count.To the above options I'd like to add option 0: Dont worry about retrieving the past count so long as your arduino doesnt restart too often.  ( Every counter has an overflow point so your code just has to deal with a count that goes backward now and again)See my post on how to convert a counter into a rate at http://community.thingspeak.com/forum/thingspeak-plugins/converting-counter-values-to-rate-of-change/  Doubtless it can also be done in a Matlab visualisation nowadays.", "num_user_post": " 271", "author": "rw950431"}, {"date": "July 25, 2016 - 4:57 am", "content": "Hello kvv213These values are uploaded on https://emoncms.org/  It's a public service but you can install the server on a Raspberry PI if you like.I have shared some graphs related to gas at https://emoncms.org/daturach If you zoom in, you should see the counter at value one when there is gas consumption. The other graphs are just derived by calculation executed directly on the server.daturach", "num_user_post": " 7", "author": "daturach"}, {"date": "July 25, 2016 - 10:51 pm", "content": "daturach-   cool graphs!  Was it difficult to derive the accumulation graphs from the counter using the emoncms platform?", "num_user_post": " 271", "author": "rw950431"}, {"date": "July 26, 2016 - 5:07 am", "content": "Not really. In my case, one pulse = 10 litres. Then you can multiply (on the server) the litres by a factor to get the kWh. On the server again, you apply a function called 'accumulator' which obviously accumulates the kWh.There are a few basic functions you can use. If you already upload content on Thingspeak and I think you do [great rate display graph :-)], you can try emoncms. If you know PHP/Javascript, then you can develop your own applications and have them running on your Raspi.daturach", "num_user_post": " 7", "author": "daturach"}, {"date": "July 26, 2016 - 11:14 am", "content": "daturach said Hello kvv213 These values are uploaded on https://emoncms.org/  It's a public service but you can install the server on a Raspberry PI if you like. I have shared some graphs related to gas at https://emoncms.org/daturach  If you zoom in, you should see the counter at value one when there is gas consumption. The other graphs are just derived by calculation executed directly on the server. daturach  Now the situation is getting worse. I have TWO data logging and visualization systems 🙂 The graphs are pretty cool.", "num_user_post": " 28", "author": "kvv213"}, {"date": "July 26, 2016 - 11:22 am", "content": "rw950431 said I suspect you really want to display a rate (how many impulses per hour/day etc) rather than a count. To the above options I'd like to add option 0: Dont worry about retrieving the past count so long as your arduino doesnt restart too often.  ( Every counter has an overflow point so your code just has to deal with a count that goes backward now and again) See my post on how to convert a counter into a rate at http://community.thingspeak.com/forum/thingspeak-plugins/converting-counter-values-to-rate-of-change/  Doubtless it can also be done in a Matlab visualisation nowadays.  Actually I have two goals:1. Report to the gas company my remote house monthly gas consumption. They don't have a remote meter reading option but receive values via Internet (I should enter them manually). But in that case I need to read the values from the meter and then enter them into their system at their web-site. But due to the remote location I'm not always at the site to read the values 🙂 Video surveliance is an option but it doesn't solve goal two.2. Try to get information about dependence of gas consumption, temperature and people presense on the site. Of cource there is a correlation: when it is -20C outside the consumption of gas is around 1000 sq.m. per month or even more. But I need more details. BTW I already have infromation from my electricity company. They have remote meter data collection and it is possible to download the data from their servers via a simple script. PS. I'm able with PHP, JS. I have a server under Ubuntu but I don't wan't to use it for temperature and gas data statistics. That is work for Arduino and I have a number of boards prepared for that (and for some other features of my house).", "num_user_post": " 28", "author": "kvv213"}, {"date": "July 26, 2016 - 1:14 pm", "content": "Video surveliance is an option but it doesn't solve goal two.or gprs/umts network with a cheap prepaid data SIM ??Anyway, it looks like an interesting project.daturach", "num_user_post": " 7", "author": "daturach"}, {"date": "July 26, 2016 - 3:49 pm", "content": "Hi kvv213,,With W10 via Chrome I send:http://api.thingspeak.com/channels/????/status.json?results=1and obtain this webpage:{'channel':{'name':'??????????','latitude':'0.000000','longitude':'0.000000','elevation':'00'},'feeds':[{'created_at':'2016-07-26T18:09:27Z','entry_id':205497,'status':null}]}where entry_id+amount-in-gas-meter-when-I-started-my-arduino to send 'the-pings' must be the actual reading in the gas meter ... Assuming your Internet Service Provider is infallible (arduino+UPS[nicad/LiFePO4] IS) you send every ping for sure So I can fill the text box to send my reading to the Gas Co. using 'manual internet' as I understood ... (so, from everywhere)3*60*24*30=129600 is about the performance you need in your 'winter observation' i.e. 3 pings/minute 20 seconds ... still in Thingspeak rangePeople presence (via PIR?) so 0/1 and temp can be sent with each Gas PingMy opinion as I am one in Hello everyone! in post 1Good luck !!H.S.", "num_user_post": " 91", "author": "piajola"}, {"date": "July 26, 2016 - 4:39 pm", "content": "daturach said  Video surveliance is an option but it doesn't solve goal two.  or gprs/umts network with a cheap prepaid data SIM ?? Anyway, it looks like an interesting project. daturach  The remote house has fiber-optic internet (that is in the country in Russia). So SIM is not required. Normal internet connection exists.I'm going to include also Metane gas sensor, CO sensor as the must options for this project. That is because Arduino is going to be installed at the gas heater room. It is also intresting to analyze these two data feeds.And if I have enough pins at Arduino board then I'll add two digital temperature and humidity meters.BTW I already implemented Option 1 with ThingSpeak library. During the implementation I found out that if I don't have internet connection when I receive impulse from Gas meter then the library caches it and upload to the server when the connection restores. That is a good feature because I was thinking about a workaround for this.", "num_user_post": " 28", "author": "kvv213"}, {"date": "July 26, 2016 - 4:47 pm", "content": "piajola said Hi kvv213,, With W10 via Chrome I send: http://api.thingspeak.com/channels/????/status.json?results=1 and obtain this webpage: {'channel':{'name':'??????????','latitude':'0.000000','longitude':'0.000000','elevation':'00'},'feeds':[{'created_at':'2016-07-26T18:09:27Z','entry_id':205497,'status':null}]} where entry_id+amount-in-gas-meter-when-I-started-my-arduino to send 'the-pings' must be the actual reading in the gas meter ... Assuming your Internet Service Provider is infallible (arduino+UPS[nicad/LiFePO4] IS) you send every ping for sure So I can fill the text box to send my reading to the Gas Co. using 'manual internet' as I understood ... (so, from everywhere) 3*60*24*30=129600 is about the performance you need in your 'winter observation' i.e. 3 pings/minute 20 seconds ... still in Thingspeak range People presence (via PIR?) so 0/1 and temp can be sent with each Gas Ping My opinion as I am one in Hello everyone! in post 1 Good luck !! H.S.  There is a library for ThingSpeak and it has some methods that can help in receiving values from ThingSpeak. And it works well in version 1.1.1 of the library.People presence can be implemented much easier than PIR. Everyone has a mobile phone. And if you have Wi-Fi at the site then you can track presence of people at the site by their mobile phones connected to your wi-fi. Of cource the mobile phone shouldn't switch off wi-fi module when the screen is off. I already implemented this at bash.PS. The link you mentioned works only for public channels. So if it is a private one you need to use Read API-Key (Write API-Key probably will work also). It is possible to send API-keys via from fields.", "num_user_post": " 28", "author": "kvv213"}, {"date": "July 27, 2016 - 2:41 pm", "content": "During long period testing - found out something not good. It seems that Arduino went to sleep somehow. I left the device with connected button (instead of gas meter for test purposes) overnight. I pressed the button several times in the morning and left it for almost 12 hours alone connected to Internet. The first press of the button woke the device up (it started Setup routine! I also calculate Arduino wakes up via code in Setup function) and the impulse was missed.... Next button press was collected well.I'm going to add blinkin LED that will show that the device works at least. Plus warning and error leds. So this should prevent the device from sleep. I hope.", "num_user_post": " 28", "author": "kvv213"}, {"date": "July 27, 2016 - 8:06 pm", "content": "Is it possible that your network card somehow lost connection due to inactivity so missed the first pulse while trying to reconnect?  ", "num_user_post": " 271", "author": "rw950431"}, {"date": "July 28, 2016 - 8:55 am", "content": "rw950431 said  Is it possible that your network card somehow lost connection due to inactivity so missed the first pulse while trying to reconnect?    By network errors it is not possible. By 'green' reasons it could be. But in that case it shouldn't call for set-up routine. Drop an exception or error is OK but not reset. I've found out the problem with Setup invoke after a long time period without any impulses. Arduino connected to my PC (test and developing mode). When I wake up my computer at some period of its loading USB ports are dropped. So Arduino goes to reboot also.But I have to confirm the problem with missing impulses after the long period of 'no impulses'. I see that Ethernet shield has connection to Internet and sometimes it receives packets. But it seems that something inside drops the connection.As you can see at the graph. After reboot ThingSpeak libraries couldn't get values even from the server. I need to think about a workaround for such a behaviour.PS. LED blinker is useful but didn't help with missing impulses 🙂", "num_user_post": " 28", "author": "kvv213"}, {"date": "July 28, 2016 - 9:52 pm", "content": "I guess its possible that your program or libraries leak memory or otherwise overflow after prolonged running time.You could add a section that writes an increasing counter to a a second channel regularly (every minute or hour) just to see if there is a problem with inactiivty or a long run time. (or maybe put in your temperature sensor for something useful)", "num_user_post": " 271", "author": "rw950431"}, {"date": "July 31, 2016 - 5:13 pm", "content": "rw950431 said I guess its possible that your program or libraries leak memory or otherwise overflow after prolonged running time. You could add a section that writes an increasing counter to a a second channel regularly (every minute or hour) just to see if there is a problem with inactiivty or a long run time. (or maybe put in your temperature sensor for something useful)  Yes, that could be the solution. I have plans to post temperature and humidity from two of my sensors DHT-22 (one inside of the gas heater room and and outside the building) every 30 minutes. Also I'm thinking about a simple web-server (ethernet arduino library allows to set-up a light web-server). That will be useful to enter remotely to the device (from local network of cource) and see its condition on-line. And I hope that it also help to prevent the device from loosing the connection. But I have less than 25% free memory for the program already. Probably I'll cut down some text strings and other debug output but there is a risk that something I should implement using one more Arduino board 🙂During the weekedn I found out that if the ethernet board is not connected to ethernet the procedure of init of ethernet can lasts for ever.  I did a number tests and only once I got a reasonable error that the shield couldn't connect to DHCP server. The rest of times just infinite initialization procedure. Also there can be a problem with the 15 seconds values upload interval. I didn't get in touch with it during my tests (when I pressed the button repeatedly). But looking after the speed of the Gas meter I think that a special procedure should be realized that accumulates impulses and post them with pace less than 1 upload per 15 second.", "num_user_post": " 28", "author": "kvv213"}, {"date": "August 2, 2016 - 5:07 pm", "content": "Current situation:1. I've realized Web-server at Arduino that shows simple values from the sensors I have. Will test if it help with Ethernet deep sleep.2. I've connected two MQ sensors to the board. *3. I've connected two DHT11 sensors to the board. *4. * I've found out that Ehternet shield doesn't work if I connect at least one MQ sensor. The board is feeded via USB and it is not enough. Ethernet shield doesn't connect to my network and stops the entire programm run (I wrote about this above). If I feed the board via external power source using this special round plug Ethernet shield doesn't work with all the symptomes above (I used 9V 1A power source). So it seems that Ethernet shields takes too much energy (and DC-DC step-down onboard converter is too weak) and I have to use external 5V power source that will be connected into 5Vin pin.So, the project is a little bit delayed due to point 5. Also I'm waiting for arrival DHT22 sensors.", "num_user_post": " 28", "author": "kvv213"}, {"date": "August 3, 2016 - 2:22 pm", "content": "The idea with Web-server works. After 12 hours of no activity (except blinking LED) the device received button event and post it to ThingSpeak succesfully.PS. Still struggle with not enough power for Ethernet Board :-/", "num_user_post": " 28", "author": "kvv213"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-projects/collect-the-temperture-and-humidity-data-by-dragino-lora-iot-kit/", "posts": [{"date": "December 11, 2016 - 10:42 pm", "content": "Over here,we will show how to use the Dragino LoRa IoT Kit to collect the temperature and humidity and send the data to the ThingSpeak server.The things we need to prepare:LoRa Gateway -- LG01-PLoRa Node -- LoRa ShieldSensor -- DHT11 Complete following operations:  Set up hardware Set up the hardware as below, the LoRa node will get sensor data from DHT11 and send these data to LoRa Gateway, when the Gateway get the data, it will pass the data to the IoT server.    Set up IoT Server account We choose ThingSpeak as the IoT server here, first sign up an account in ThingSpeak, then goto the Channels and create a Channel with Temperature and Humidity field. After create the channel, user can see the Channel ID and API key in the Channel Page. They are needed for upgrade data to this channel.     Upload sketches Step 1: Download the ThingSpeak Library and put it in the Arduino library directory.Step 2: Select the example from: IDE --> File --> Examples --> Dragino --> IoTServer --> ThingSpeak --> dht11_client And upload this sketch to the LoRa NodeStep 3: Select the example from IDE --> File --> Examples --> Dragino --> IoTServer --> ThingSpeak --> dht11_server Replace the myChannelNumber & myWriteAPIKey to your info And upload this sketch to the LoRa Gateway.  Check Result Check Result in ThingSpeak as below:     What is LoRa KiT?      Dragino Lora IoT Kit is designed to facilitate beginners and developers to quickly learn LoRa and IoT technology. It help users to turn the idea into a practical application and make the Internet of Things a reality. It is easy to program, create and connect your things everywhere. A number of telecom operators are currently rolling out networks, but because LoRa operates in the open spectrum you can also set up your own network. The LoRa IoT kit will show how to build LoRa network, and how to use the network to send data from a LoRa sensor node to the cloud server. When used as a private LoRa network, the LoRa gateway will connect your other LoRa nodes up to 5km however expect up to 10km range (when in line of sight) when connecting your LoRa node to a LoRa gateway!     Support us! For the past months we've worked hard to get the LoRa IoT Kit to the final stages of development. We have got some users to start using LoRa IoT Kit.To make the final step and start mass-production, we are rasing funds via a Indiegogo campaign,we need your help!!! If you back us, you will speed up the LoRa IoT Kit production and receive one of it in 01/2017, but you'll also receive one yourself in 03/2017. So to start to build your own LoRa Network and examine the IoT technology, we are trying to provide a full solution to connect LoRa to different cloud server there’s nothing like what Dragino LoRa IoT Kit can provide.The link of the Dragino LoRa KiT campaign is:https://www.indiegogo.com/projects/lora-kit-for-iot-applications/x/15237796#/ Please help us to promote this LoRa Kit,and let more people know the LoRa wireless technology ! Thank you!", "num_user_post": " 2", "author": "David Guo"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-projects/esp8266-and-thingspeak/", "posts": [{"date": "February 26, 2016 - 10:31 am", "content": "Hi everybody,Try to talk to my thingspeak channel via my esp8266, and the serial monitor arduino, everything seems to be ok but no change in my thingspeak graphic chanel.ATOKAT+CIPMUX=1OKAT+CIPSTART=4,”TCP”,”184.106.153.149”,80OKLinkedAT+CIPSEND=4,44> GET/update?KEY=(my api key)&FIELD1=20OKUnlinkAll the time ok but not visible on my thingspeak channel.Been buzy with this many days, please is there somebody who can give a hint.With kind regards aravind", "num_user_post": " 1", "author": "aravind0603"}, {"date": "February 26, 2016 - 2:40 pm", "content": "Hi aravind,I hope I can help you ... I have an Arduino with ESP8266 as 'wifi shield' sending data once per minute to a channel in Thingspeak with Si7005; sending temperature and relative humidity for now (planned more sensor data lux, UV, outside temp ...)So repeating YOUR way, only the ESP8266 with RS232 'orders' ie AT commands with Termite for the case same as using Serial from Arduino IDECopy - paste from my Termite-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-*-AT+GMRAT version:0.50.0.0(Sep 18 2015 20:55:38)SDK version:1.4.0compile time:Sep 18 2015 21:32:07OK------------------------------------------AT+CWMODE?+CWMODE:3OK------------------------------------------AT+CIPMODE?+CIPMODE:0OK------------------------------------------AT+CIPMUX?+CIPMUX:0OK------------------------------------------AT+CIPSTATUSSTATUS:2OK------------------------------------------AT+CIPSTART='TCP','api.thingspeak.com',80CONNECTOK------------------------------------------AT+CIPSEND=64OK>------------------------------------------GET /update?api_key=sixteenUPPERcase&field1=25.12&field2=55.31       << count 1 space after GET before slash totaling 62 plus [newline][return] =64Recv 64 bytesSEND OK+IPD,5:12825CLOSED------------------------------------------Note when I did------------------------------------------AT+CIPSTART='TCP','184.105.153.149',80ERRORCLOSED------------------------------------------ it DOES NOT worked!! (I do not know why ... IP?)Count spaces and follow UPPER/lower case ...  (use non proportional fonts  I use Notepad with CONSOLAS font)Stopped my Arduino to do this test and restarted and still sending to Thingspeak 🙂 🙂Anything missing? anything else? any questions? feel free to ask I will do what I can", "num_user_post": " 91", "author": "piajola"}, {"date": "October 24, 2016 - 2:49 am", "content": "Hi, all the commands works fine it showing results on serial monitor(COM port Putty), but thingspeak is not updating, no data is showing on thingspeak. we are converting temperature data as string and sending. ", "num_user_post": " 2", "author": "Karthikraja Nagendran"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-projects/data-not-send-in-own-website/", "posts": [{"date": "October 6, 2016 - 6:55 am", "content": "Hello Everyone, Nice to meet you all. i have successfully write Data in Thingspeak website using ESP8266 no problem with that but when i send data to my own website it can't write any data and same data i can write when i paste the link in my browser. For Data write i use GET method ,in Thingspeak also i use GET method. And in my website i don't use any API key is this is the reason or another please help me?", "num_user_post": " 2", "author": "Tejani"}, {"date": "October 6, 2016 - 4:02 pm", "content": "Hi Tejani,I have a couple of questions for you.What do you mean by 'my website'? is it local installation of ThingSpeak. Use write API key to POST to any private channel even for local/ custom installation of ThingSpeak. Perhaps you could share the REST API (hide keys and channel)/ steps you are using or any screenshots that may be helpful.Let us know if using API key made any difference.Thanks.", "num_user_post": " 8", "author": "Meenakshi"}, {"date": "October 7, 2016 - 12:18 am", "content": "Hey Meenakshi , Thanks for giving reply.' my Website ' means my own company website not Thinkspeak and it is global not local  .Beafore this i use Thinkspeak API to write data in Thinkspeak website and done it successfully. But in My own server i just create php file that receive data and put that data in Table format but in server problem is no API . Again Thanks for Answer...", "num_user_post": " 2", "author": "Tejani"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-projects/things-speak-for-monitoring-noise-and-air-pollution-to-create-smart-environmet/", "posts": [{"date": "August 9, 2016 - 7:51 am", "content": "Hello everyone,I want to read Noise&CO values using Arduino UNO and then send this to Thingspeak. I am coding it using the Arduino IDE 1.6.7 with the Ethernet add-in module. I have managed to write some code that reads and displays my data, and I have written some code that reads the data and sends it to Web Server,But in case of things speak my data not going to 'Things Speak' .Which I want use for analysis...please help me..Any suggestions?", "num_user_post": " 4", "author": "anjihanuma"}, {"date": "August 10, 2016 - 12:05 am", "content": "Did you check out the Arduino examples on the thingspeak website (under Support). I think there are some examples in https://github.com/mathworks/thingspeak-arduino", "num_user_post": " 271", "author": "rw950431"}, {"date": "August 20, 2016 - 5:09 am", "content": "HiThanks for ReplayYeah.....I have tried(checked) those example's, but not working properly in my case.....I have changed my MAC address, Things Speak Channel Number and writeAPI key, but my data not uploading into Things Speak.... Please...give me suggestions...what i do now???", "num_user_post": " 4", "author": "anjihanuma"}, {"date": "August 21, 2016 - 10:02 pm", "content": "can you post your code?", "num_user_post": " 271", "author": "rw950431"}, {"date": "August 24, 2016 - 5:54 am", "content": "Hai....Thank you ......@rw950431code: which i'm using....................................................................................................................................................................................................................................................................................................................................................................#ifdef SPARK #include 'ThingSpeak/ThingSpeak.h'#else #include 'ThingSpeak.h'#endif#ifdef ARDUINO_ARCH_AVR#ifdef ARDUINO_AVR_YUN #include 'YunClient.h' YunClient client; #else#ifdef USE_WIFI_SHIELD #include <SPI.h> #include <WiFi.h> char ssid[] = '<YOURNETWORK>'; char pass[] = '<YOURPASSWORD>'; int status = WL_IDLE_STATUS; WiFiClient client; #else #include <SPI.h> #include <Ethernet.h> byte mac[] = { 0xDE, 0xAD, 0xBE, 0xEF, 0xFE, 0xED}; EthernetClient client; #endif #endif #define VOLTAGE_MAX 5.0 #define VOLTAGE_MAXCOUNTS 1023.0#endif#ifdef ARDUINO_ARCH_ESP8266 #include <ESP8266WiFi.h> char ssid[] = '<YOURNETWORK>'; char pass[] = '<YOURPASSWORD>'; int status = WL_IDLE_STATUS; WiFiClient client; #define VOLTAGE_MAX 1.0 #define VOLTAGE_MAXCOUNTS 1023.0#endif#ifdef SPARK TCPClient client; #define VOLTAGE_MAX 3.3 #define VOLTAGE_MAXCOUNTS 4095.0#endifunsigned long myChannelNumber = XXXXX;const char * myWriteAPIKey = 'XXXXXXXXXXX';void setup() { #if defined(ARDUINO_ARCH_AVR) || defined(ARDUINO_ARCH_ESP8266) #ifdef ARDUINO_AVR_YUN Bridge.begin(); #else #if defined(USE_WIFI_SHIELD) || defined(ARDUINO_ARCH_ESP8266) WiFi.begin(ssid, pass); #else Ethernet.begin(mac); #endif #endif #endif ThingSpeak.begin(client);}void loop(){ float pinVoltage = analogRead(A0) * (VOLTAGE_MAX / VOLTAGE_MAXCOUNTS); ThingSpeak.setField(1,pinVoltage); #ifndef ARDUINO_ARCH_ESP8266 pinVoltage = analogRead(A1) * (VOLTAGE_MAX / VOLTAGE_MAXCOUNTS); ThingSpeak.setField(2,pinVoltage); pinVoltage = analogRead(A2) * (VOLTAGE_MAX / VOLTAGE_MAXCOUNTS); ThingSpeak.setField(3,pinVoltage); pinVoltage = analogRead(A3) * (VOLTAGE_MAX / VOLTAGE_MAXCOUNTS); ThingSpeak.setField(4,pinVoltage); pinVoltage = analogRead(A4) * (VOLTAGE_MAX / VOLTAGE_MAXCOUNTS); ThingSpeak.setField(5,pinVoltage); pinVoltage = analogRead(A5) * (VOLTAGE_MAX / VOLTAGE_MAXCOUNTS); ThingSpeak.setField(6,pinVoltage); pinVoltage = analogRead(A6) * (VOLTAGE_MAX / VOLTAGE_MAXCOUNTS); ThingSpeak.setField(7,pinVoltage); pinVoltage = analogRead(A7) * (VOLTAGE_MAX / VOLTAGE_MAXCOUNTS); ThingSpeak.setField(8,pinVoltage); #endifThingSpeak.writeFields(myChannelNumber, myWriteAPIKey);delay(15000);}", "num_user_post": " 4", "author": "anjihanuma"}, {"date": "August 24, 2016 - 10:26 pm", "content": "What happens if you only try and upload 2 or 3 voltages instead of 8?  I seem to recall reading that someone else had strange troubles when attempting to upload 8 fields at once.If its the case it must be a bug in the thingspeak arduino library since its definitely possible to upload all 8 fields.", "num_user_post": " 271", "author": "rw950431"}, {"date": "August 25, 2016 - 11:29 am", "content": "Hai...Thank You....=>rw950431It's working fine now......data uploading into my fields(Things Speak Channels),but i'm not getting channel updates(i.e ..in channel status updates)how to get it??? any suggestions....? Thanks in advance", "num_user_post": " 4", "author": "anjihanuma"}, {"date": "September 28, 2016 - 1:52 pm", "content": "Hi,  I don't see that you are updating the channel status field. You are only updating the fields in your channel. To update the status field you have to send a HTTP POST request to ThingSpeak (I am not sure if the ThingSpeak Arduino library support updating the channel status). For more details on how to format your POST request you can see here. ", "num_user_post": " 12", "author": "jvasudev"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-projects/thinkspeak-with-contiki/", "posts": [{"date": "February 26, 2015 - 10:27 am", "content": "Has anyone tried uploading data on thingspeak using contiki. Struglling to get a working code for it. Hardware platform i am using is cc2538.", "num_user_post": " 1", "author": "ruchik"}, {"date": "September 28, 2016 - 8:30 am", "content": "Hi Ruchik, did you make it work? I would like to use it with CC2650. Best, Rodri", "num_user_post": " 19", "author": "rodri"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-projects/esp8266-arduino-ide-and-thingspeak-with-webserver-for-debugging/", "posts": [{"date": "July 4, 2016 - 10:13 pm", "content": "Hello everyone,I wish to use an ESP8266 to send data to Thingspeak however I also want to use display information locally. Can anyone offer assistance on this? I can send data to Thingspeak, and I can display data using a webserver, however I can't work out how to combine both functions.Any ideas?Thanks,Ewan #include <ESP8266WiFi.h>#include <ESP8266WebServer.h>#include <WiFiClient.h>// WiFi Definitions#define SSID '*****' // WiFi SSID#define PSK '*****' // WiFi password// Thingspeak definitions#define SERVER 'api.thingspeak.com' // Thingspeak server address#define PORT 80 // Thingspeak port#define API '*****' // Thingspeak 'Write' key for this channelint i = 0;ESP8266WebServer server(80);WiFiClient client;void handleRoot(){ String message = 'hello from esp8266!'; message += i; server.send(200, 'text/plain', message); i ++;}void setup(void){ WiFi.begin(SSID, PSK);// Wait for connection while (WiFi.status() != WL_CONNECTED) { delay(500); }server.on('/', handleRoot); server.begin();}void loop(void){ server.handleClient();client.connect(SERVER, PORT); String postStr = API; postStr +='&field1='; postStr += String(i); postStr +='&field2='; postStr += String(i); postStr += '';client.print('POST /update HTTP/1.1 Host:'); client.print(SERVER); client.print('Connection: close'); client.print('X-THINGSPEAKAPIKEY: '); client.print(API); client.print('Content-Type: application/x-www-form-urlencoded'); client.print('Content-Length: '); client.print(postStr.length()); client.print(''); client.print(postStr); delay (10000);}", "num_user_post": " 7", "author": "dukbilt"}, {"date": "July 4, 2016 - 10:31 pm", "content": "What do you mean by 'display data using a webserver'?  Can you post the code that does that function?I'm guessing you want to POST data to thingspeak as a client but also act as a server for local clients..", "num_user_post": " 271", "author": "rw950431"}, {"date": "July 4, 2016 - 11:34 pm", "content": "Correct - ideally I want to be able to see what data is being sent to Thingspeak by accessing the ESP8266 webserver.The code above is my (unworking) version that is based on my very simple webserver example. I tried to add my very basic Thingspeak functionality with my very basic webserver example, however it doesn't work.One of the main reasons I want to do this is so I can debug easily without adding in a heap of serial print information. ", "num_user_post": " 7", "author": "dukbilt"}, {"date": "July 5, 2016 - 7:09 pm", "content": "Does it post data to Thingspeak properly if you remove the server.handleClient(); from the main loop?Does it serve local clients if you comment out the Thingspeak update section in the main loop? One of the issues you have is that the server will only check for incoming requests every 10 seconds so your local clients may timeout waiting.   You need to eliminate delay() so the clients get handled quickly.  See the Doing several things at once post on the arduino forum and the 'Blink without delay' example in the Arduino IDE. You should also be aware the 15 seconds is the min time between TS updates so at the moment every 2nd update would fail anyway.", "num_user_post": " 271", "author": "rw950431"}, {"date": "July 6, 2016 - 5:23 pm", "content": "Hello everyone,after much head scratching I have a functional solution (see below).If anyone has suggestions on how to improve it, I'm all ears. I have extensively commented it to assist in other people re-using it.Bye,Ewan /* Server and Client functionality for ESP8266Sends data to Thingspeak and also shows sent data and response on a web page hosted onthe ESP8266 for local information to aid in debugging.    Version: 1.0 (07 Jul 16)    Hardware: ESP8266 module (specifically the Sparkfun ESP8266 Thing)    IDE: Arduino 1.6.9        Author: Ewan Regazzo                    */#include <ESP8266WiFi.h>#include <ESP8266WebServer.h>#include <WiFiClient.h>// WiFi Definitions#define SSID 'myssid' // WiFi SSID#define PSK 'mypassword' // WiFi password// Thingspeak definitions#define SERVER '184.106.153.149' // Thingspeak server address (don't use 'api.thingspeak.com' - it doesn't work)#define PORT 80 // Thingspeak port#define API 'myapiwritekey' // Thingspeak 'Write' key for this channel/* NOTE 1 - The instance of ESP8266WebServer called 'server' uses port 81.   Port 81 must be used as Thingspeak uses port 80, so the web server by typing   XXX.XXX.XXX.XXX:81 into your browser window where XXX.XXX.XXX.XXX is the IP   address of the ESP8266 - ie, '192.168.0.5:81'   The '#include <ESP8266WebServer.h>' statement at the top of this code is   essential in allowing the 'server' instance to be created.*/ESP8266WebServer server(81); // Create instance of ESP8266WebServer called 'server' using port 81 (see note 1 above)WiFiClient client; // Create an instance of WiFiClient called 'client'// Global variables (usable by all functions)int x = 0; // Simple counter to show that something changesString message; // The information needed to update Thingspeak is kept in a string called 'message'String response; // Holds the response information from Thingspeak after data has been sent// The 'setup' function is called at startup only and sets up the ESP8266void setup(){  WiFi.begin(SSID, PSK); // Begin the WiFi connection using SSID and PSK definitions  // Pause for 0.5 seconds while WiFi is NOT connected  while (WiFi.status() != WL_CONNECTED)  {    delay(500);  }    // we've gotten to here so WiFi must now be connected  // Set up the web server  server.on('/', handleRoot); // If a client accesses the root page ('/') then process the 'handleRoot' function  server.begin(); // Start the server}// The main function that does everything.void loop(){  createData(); // Make the data message  server.handleClient(); // Take care of any client that accesses the web server  sendData(); // send data to Thingspeak  delay(5000); // Have a break}// This function takes care of a client accessing the root web server pagevoid handleRoot(){  server.send(200, 'text/plain', (message + '' + response)); // send a message to the web server}// This function sets the ESP8266 as a client to an external server (Thingspeak), sends data,// and receives a responsevoid sendData(){  if (client.connect(SERVER, PORT)) // If a successful connection occurs, then...  {    client.println(message); // ... send the information  }  if (client.connected()) // If we have connected...  {    response = client.read(); // ... read the response from the server        if (response == '48') // string value of '48' equals char '0' - which means data received ok    {      x ++; // increment x by 1 (just to show that something happened)    }  }  client.stop(); // We don't want the client to maintain a constant connection}// This function creates a simple GET message string to update Thingspeakvoid createData(){  message = 'GET /update?api_key=';  message += API;  message += '&field1=';  message += x;} ", "num_user_post": " 7", "author": "dukbilt"}, {"date": "July 6, 2016 - 9:38 pm", "content": "Its great that you got it to work.One improvement might be to eliminate the delay() call so you can serve clients in a more timely fashion. (You obviously need to declare the variables and initialise them in setup() void loop() {  now=millis();   createData(); // Make the data message   server.handleClient(); // Take care of any client that accesses the web server   //once every 15 seconds send to Thingspeak  if (now - last_mills > 15000) {     sendData(); // send data to Thingspeak     last_millis=now;  }   }", "num_user_post": " 271", "author": "rw950431"}, {"date": "July 7, 2016 - 12:09 am", "content": "Thanks for that - I have heard that using delays can cause issues with the ESP8266, so eliminating it will be useful.", "num_user_post": " 7", "author": "dukbilt"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-projects/esp8266-arduino-ide-send-data-to-thingspeak-as-well-as-displaying-data-on-a-local-webserver/", "posts": [{"date": "July 5, 2016 - 5:25 pm", "content": "Hello everyone,I want to decode RS-485 data and then send this to Thingspeak, as well as read this data from the ESP8266 (using something like a local webserver on the ESP8266). I am coding it using the Arduino IDE 1.6.9 with the ESP8266 add-in module. In essence, I want to be able to connect to the ESP8266 via a web browser to not only see the data but to also use it for debugging (once it's programmed it gets connected outside and it's difficult to connect via a serial cable - so if I can get this functionality working it's something I expect to use for any other ESP8266 project).I want to:  1. Check for data every 30 seconds (to keep it simple, we'll just call it 'x')  2. If a client connects to the local webserver, send them the value of 'x'  3. Send the value of 'x' to Thingspeak every 5 minutes  4. RepeatI have managed to write some code that reads and displays my data, and I have written some code that reads the data and sends it to Thingspeak. However, combining the two doesn't seem to work. The more I look at example code, the more confused I get - but at the same time I have a feeling that there is a much simpler way of doing things...Any suggestions? Ewan", "num_user_post": " 7", "author": "dukbilt"}]}]}