{"url": "https://community.thingspeak.com/forum/thingspeak-api/page-35/", "threads": [{"url": "https://community.thingspeak.com/forum/thingspeak-api/twitter-updates-problem/", "posts": [{"date": "May 19, 2014 - 5:56 am", "content": "I want to update my channel and then tweet it on twitter via tcp socket.tsData = 'field1=' +str(x_2) + '&'tsData += 'twitter=.......&'tsData += 'tweet=I just posted this from my thing'request = 'POST /update HTTP/1.1'request += 'Host: api.thingspeak.com'request += 'Connection: close'request += 'X-THINGSPEAKAPIKEY: ' + str(key.GetValue())request += 'Content-Type: application/x-www-form-urlencoded'request += 'Content-Length: ' + str(len(tsData))request += tsDataChannel is updated normally but I still dont get update on twitter. I have set up a twitter account and linked it to ThingSpeak account. What am I missing ?", "num_user_post": " 11", "author": "tester"}, {"date": "May 19, 2014 - 7:32 am", "content": "I found the error, just for the record : as it seems Twitter blocks dublicate posts so that was the problem.", "num_user_post": " 11", "author": "tester"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/send-data-via-embedded-system/", "posts": [{"date": "May 15, 2014 - 5:22 am", "content": "Hi, I am new to the platform. I have this question.Is there any guide on how can I connect and send data via tcp/udp sockets ?Thanks in advance !", "num_user_post": " 11", "author": "tester"}, {"date": "May 15, 2014 - 11:07 am", "content": "Hi,We don't support UDP connections, but if you use TCP there are a bunch of tutorials at https://thingspeak.com/docs/tutorials/ , is this what you're looking for?lee", "num_user_post": " 457", "author": "lee"}, {"date": "May 16, 2014 - 2:56 am", "content": "Ok I created the http request using this:key_value = 'xxxxxxxxxxx'data = 'field1=xxxx'data += '&field2=xxxx'request = 'POST /update HTTP/1.1  n';request += 'Host: api.thingspeak.com  n';request += 'Connection: close  n';request += 'X-THINGSPEAKAPIKEY: ' +key_value + ' n';request += 'Content-Type: application/x-www-form-urlencoded n';request += 'Content-Length: ' + len(data)+ ' n';My problem now is that after the first request I send (which is posted on the channel) my next request is not posted on the channel. First I create a tcp connection and then I loop the send requests with a 20 second delay.", "num_user_post": " 11", "author": "tester"}, {"date": "May 16, 2014 - 3:18 am", "content": "Ok I now tried to close tcp connection after sent the request and then make a new connection(inside the 20 sec loop) so it worked.", "num_user_post": " 11", "author": "tester"}, {"date": "May 16, 2014 - 11:26 am", "content": "Glad to hear you got it working!lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/rate-limit-on-read-operations/", "posts": [{"date": "April 16, 2014 - 1:14 am", "content": "Hi, I know that there is a rate limit of one update every 15 seconds. I assume 'update' means a write operation. Then, what is the rate limit for read? I have a controller to monitor the data from a sensor and act accordingly. Can I do better than polling the sensor? Thanks a lot for your help in advance!Jingzhao", "num_user_post": " 4", "author": "jingzhao.ou"}, {"date": "April 16, 2014 - 1:37 am", "content": "Hi,Yes there is a rate limit of one feed update per Channel every 15 seconds.  We currently do not impose rate limits on read operations.  Polling the sensor seems like it would be the best method for now.lee", "num_user_post": " 457", "author": "lee"}, {"date": "April 16, 2014 - 1:46 am", "content": "Thanks a lot for the quick reply. Any plan to add socket support in near future? That would be very helpful for my case with both monitor and control. We are using socket/websocket with Xively.com but would like to use Thingspeak due to its openness. Socket is a gating factor at this moment. Jingzhao", "num_user_post": " 4", "author": "jingzhao.ou"}, {"date": "April 16, 2014 - 11:27 am", "content": "Hi,We may consider adding websocket support in the future, but have no immediate plans for it.lee", "num_user_post": " 457", "author": "lee"}, {"date": "April 16, 2014 - 1:17 pm", "content": "Thanks for the info. In the near term, I guess the React app may work for me. If I plan on hosting Thingspeak myself, is the source code of the React app available? Or should I simply implement WebSocket myself? Wonder if you could give some advice to me. Thanks again!Jingzhao", "num_user_post": " 4", "author": "jingzhao.ou"}, {"date": "April 16, 2014 - 2:04 pm", "content": "Hi Jingzhao,The open source version of ThingSpeak does not contain the React app, so it would probably be best to implement websockets yourself if needed.lee", "num_user_post": " 457", "author": "lee"}, {"date": "April 16, 2014 - 2:41 pm", "content": "Sounds great, Lee. Maybe I can help contribute to this great platform. Thanks,Jingzhao", "num_user_post": " 4", "author": "jingzhao.ou"}, {"date": "April 19, 2014 - 12:08 pm", "content": "I use ThingSpeak in a similar way, for monitoring and controlling a machine.  There is a delay between when the data was collected, then sent to ThingSpeak, and finally downloaded and displayed.  It can approach 30 seconds at the 15 second update rate.  For the purpose of real-time monitoring, it would be nice if it was faster.  On the other hand, I recently downloaded my entire channel for the year, and it was 100MB!  That data resolution was valuable in real time, but for historical review is too large and slow to download.  I suggest a change to the ThingSpeak system to allow high rate 'last' update reading and writing, but average those values into the feed at 15 second periods.  Then, add an option to further compress/ average the feed for historical data.  For instance, the default setting for a new channel could be to average data into 5 minute periods for data older than 1 month.  This would lower your storage overhead, and accelerate historical data queries.", "num_user_post": " 70", "author": "turgo"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/chart-scaling-minor-bugs/", "posts": [{"date": "April 13, 2014 - 5:03 am", "content": "Hello, Firstly, I totally love thingspeak, but the more I use it the more I wish there were a couple of changes made to the way charts work.Feature request:  Allow fixed scaling to be set.  At the moment I have power consumption data with very wide dynamic range.  A baseline of about 80 watts at night, spiking to 3-4kw when various items turn on.  Especially on longer time bases, this causes the graph scale to auto adjust so that it shows -1 or sometimes even -2 kw.  There is no zero, or negative data in the chart.  I have tried using the min/ max functions to limit it, but this seems to affect what data is accepted rather than graph scaling.tldnr: Can you please add options for fixed graph scaling for min or max on at at least y axis.Minor bug:  this seems to be a visual bug with looking at public view when signed in.  The chart area is too large for its window, and the axis legends are superimposed on the top of the axis data value labels rather than on the side.  This fixes itself when you go to edit chart data, it suddently refreshes and works.  Also seems to not be a problem with the public charts in non signed in public view.(my channel is https://thingspeak.com/channels/11460 I have set public view on my electricity consumption to 1 day, to highlight the issue of chart scaling)", "num_user_post": " 3", "author": "etalon"}, {"date": "April 13, 2014 - 2:44 pm", "content": "Hi,We just added the ability to set min and max values for the Y-Axis of charts.I'm not able to see the visual error when viewing charts that you're describing, can you please send a screenshot to lee at iobridge dot com?lee", "num_user_post": " 457", "author": "lee"}, {"date": "April 13, 2014 - 6:00 pm", "content": "Sending email now.Turns out my recreation steps are not exactly as I thought.  It *might* have something to do with signing in.... Email sent with steps I took to create the bug.", "num_user_post": " 3", "author": "etalon"}, {"date": "April 13, 2014 - 6:04 pm", "content": "Also, awesome job on adding the feature, you guys dont hang around!", "num_user_post": " 3", "author": "etalon"}, {"date": "April 15, 2014 - 12:41 am", "content": "You may be interested in the Charting web page I created for Thingspeak.  It supports clicking and dragging on the chart to constrain the vertical axis to the selected range.http://community.thingspeak.com/forum/announcements/thingspeak-live-chart-multi-channel-second-axis-historical-data-csv-export/", "num_user_post": " 70", "author": "turgo"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/temporarily-unavailable-1/", "posts": [{"date": "April 8, 2014 - 4:28 am", "content": "Hi,it seems all the channels are down. Maybe is there some temporary problem?Thanks!", "num_user_post": " 63", "author": "vespapierre"}, {"date": "April 8, 2014 - 6:26 am", "content": "Same problem here. Already asked through twitter, no response... ", "num_user_post": " 1", "author": "Dezorian"}, {"date": "April 8, 2014 - 9:40 am", "content": "Hi,Sorry about that it seems one of our servers ran out of memory and crashed, it's back up and working now.lee", "num_user_post": " 457", "author": "lee"}, {"date": "April 8, 2014 - 10:08 am", "content": "Hi Lee,Seems now it is working fine! I have realised the response time is much better!Thanks!", "num_user_post": " 63", "author": "vespapierre"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/download-whole-channel-feed/", "posts": [{"date": "November 23, 2011 - 10:30 am", "content": "Hi, i tried to download the whole data-set from one channel as csv-file. I used this URL:http://api.thingspeak.com/channels/(channel_id)/feed.csvbut I get only the last 2666 Entries (i know 8000 entries are the maximum (2666*3 fields = 8000)) then i triedhttp://api.thingspeak.com/channels/(channel_id)/feed.csv&days=5but that does not work. i also tried, to download the whole data-set in small pieces:http://api.thingspeak.com/channels/(channel_id)/feed.csv&start=2011-11-20 00:00:00&end=2011-11-21 00:00:00but that also does not work. Can someone give me a hint how to use the 'Retrieving Channel Feeds Method' best regards Peter", "num_user_post": " 1", "author": "peewag"}, {"date": "November 24, 2011 - 11:16 am", "content": "There is no 'download' all option just yet. We are thinking of adding a button the web app that allows you to do that.The best way to get the data is to use time slices on the API.Time format is as follows: 2011-07-09 00:00:00 (%20 is an encoded space) – that's year, month, date, hours, minutes, seconds – all 2 digits long.Example: http://api.thingspeak.com/channels/627/charts/2?timescale=10&width=600&height=400&start=2011-07-08%2000:00:00&end=2011-07-09%2000:00:00", "num_user_post": " 402", "author": "Hans"}, {"date": "October 2, 2012 - 9:26 am", "content": "I'm struggling with this same problem...I can't figure out how to download data from my feed.  I've tried several combinations, but here's the most recent, which looks ok?   http://api.thingspeak.com/channels/(mychannelid)/field/(myfieldid).csv?start=2012-07-01%00:00:00&end=2012-07-09%00:00:00 It seems that no matter what I do, I get a -1 returned.  This includes clicking on the feed links in the 'Developer Info' tab in my channel's page...they all return -1.  Thanks in advance for any advice...", "num_user_post": " 3", "author": "jbowen"}, {"date": "October 2, 2012 - 9:33 am", "content": "As usual, the problem is with me.  And as usual, within minutes of asking for help, I found my error.  In my case, I needed to add a 'key' to the url to make it work (my feed is not public).  Here's a url that works (for me, at least):  http://api.thingspeak.com/channels/(mychannelid)/field/(myfieldid).csv?start=2012-07-01%00:00:00&end=2012-07-09%00:00:00&key=(myreadkey)", "num_user_post": " 3", "author": "jbowen"}, {"date": "March 12, 2014 - 11:01 pm", "content": "Hi,Great work you are doing!Has there been any update as far as downloading csv for the entire stored data?I noticed at least for me that the URL format has changed.'&start' seems replaced/changed to '&start_date' for example.Thanks.", "num_user_post": " 4", "author": "almarion"}, {"date": "March 13, 2014 - 5:36 pm", "content": "Hi almarion,I build a web page tool that makes repeated api downloads, graphs them, and can export the whole data set as csv.http://community.thingspeak.com/forum/announcements/thingspeak-live-chart-multi-channel-second-axis-historical-data-csv-export/", "num_user_post": " 70", "author": "turgo"}, {"date": "April 1, 2014 - 11:22 pm", "content": "Hi,We just released a new feature that allows you to download all of your Channel data.  To do so, open your Channel in a web browser, click on the 'Data Import / Export' tab, and you should see a button to download your data in CSV format.lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/cant-reset-channel-with-lots-if-entries/", "posts": [{"date": "February 25, 2014 - 5:51 pm", "content": "Hi, I have a channel 164266 Entries. The clear channel function doesn't work", "num_user_post": " 54", "author": "chrisjmears"}, {"date": "February 26, 2014 - 12:25 pm", "content": "Hi,I fixed one of our services on the backend responsible for clearing Channels, can you try again?  If it still doesn't work please let me know the Channel ID and I'll take a look at it.lee", "num_user_post": " 457", "author": "lee"}, {"date": "February 27, 2014 - 4:21 am", "content": "Thanks lee. now clearing beautifully.", "num_user_post": " 54", "author": "chrisjmears"}, {"date": "February 27, 2014 - 3:48 pm", "content": "Afraid the clearing channel problem is back again!", "num_user_post": " 54", "author": "chrisjmears"}, {"date": "February 28, 2014 - 4:19 am", "content": "Now working again. Seems a bit flakey?", "num_user_post": " 54", "author": "chrisjmears"}, {"date": "February 28, 2014 - 8:07 pm", "content": "Hi,This should be working again now, sorry about any problems.lee", "num_user_post": " 457", "author": "lee"}, {"date": "March 8, 2014 - 9:32 pm", "content": "Hi Lee,I have a similar problem running the latest Thingspeak from GitHub.After even I think 100 entries, I can't Clear Channel or Delete Channel.Is there any temporary workaround for this?  I am not so familiar with all the components, but I can surely reset a database given the Linux/Ubuntu shell command(s).Thanks.Redis::CannotConnectError in ChannelsController#clearError connecting to Redis on 127.0.0.1:6379 (ECONNREFUSED)Extracted source (around line #339): 337338339340341342    else      self.update_attribute(:clearing, true)      Resque.enqueue(ClearChannelJob, self.id)    end  endRails.root: /home/alan/thingspeakApplication Trace | Framework Trace | Full Traceapp/models/channel.rb:339:in `delete_feeds'app/controllers/channels_controller.rb:208:in `clear'RequestParameters:{'authenticity_token'=>'WEyg2etd6sxnEPn0jEgpzxnPNNTUgEHFhzz30MtByK0=', 'id'=>'1'}", "num_user_post": " 4", "author": "almarion"}, {"date": "March 9, 2014 - 12:02 am", "content": "Hi,In the open source version, for now you can increase the feeds limit in this line https://github.com/iobridge/thingspeak/blob/master/app/models/channel.rb#L329 from 1000 to something much higher.  I'll add in a more permanent solution for the open source version in the future, since the errors are caused by Resque/Redis requirements that don't exist.lee", "num_user_post": " 457", "author": "lee"}, {"date": "March 11, 2014 - 9:13 pm", "content": "Hi Lee,Thanks for your very impressive ThingSpeak.Making that minor change to the ruby channel script works fine.Keep up the great work!Alan", "num_user_post": " 4", "author": "almarion"}, {"date": "March 31, 2014 - 11:49 pm", "content": "You can pull the latest version of ThingSpeak from GitHub, where this issue has a more permanent fix now.", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/cannot-clear-channel-page-not-found-message/", "posts": [{"date": "March 26, 2014 - 6:34 pm", "content": "Hi,If I try to clear a channel, page cannot be found message appears right after pressing the Clear channel button!Thanks!", "num_user_post": " 63", "author": "vespapierre"}, {"date": "March 26, 2014 - 9:18 pm", "content": "Hi,This has been fixed now, thanks for notifying us of the problem!lee", "num_user_post": " 457", "author": "lee"}, {"date": "March 27, 2014 - 4:47 am", "content": "Thanks Lee!", "num_user_post": " 63", "author": "vespapierre"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/has-something-changed/", "posts": [{"date": "March 4, 2014 - 9:50 am", "content": "Hi, I have two channels running with three different Arduinos posting data that have been running for a few months great. Since last week none of them will stay connected for more than a day to the Thinkspeak server. After a few updates, I get the failed to connect to Thingspeak failed. If I reboot the Arduino, I am back up and running for a few more hours until they disconnect again. I am thinking it is not on my side since all six are doing this and have been working for months flawlessly with nothing changed on my side. Any help would be apreciated! Thanks.", "num_user_post": " 20", "author": "gerald"}, {"date": "March 4, 2014 - 11:31 am", "content": "Hi,We don't intentionally stop any devices from connecting to us.  Can you provide more details about the errors that occur when your device gets disconnected?lee", "num_user_post": " 457", "author": "lee"}, {"date": "March 4, 2014 - 3:04 pm", "content": "Hi Lee, thanks for looking into this. Basically I start out fine and my unit connects to the server, it prints back the usual every 5 minutesConnecting to ThingSpeak...HTTP/1.1 200 OKServer: nginx/1.5.7Date: Tue, 04 Mar 2014 19:53:39 GMTContent-Type: text/html; charset=utf-8Transfer-Encoding: chunkedConnection: closeVary: Accept-EncodingStatus: 200 OKX-Frame-Options: ALLOWALLAccess-Control-Allow-Origin: *Access-Control-Allow-Methods: GET, POST, PUT, OPTIONS, DELETE, PATCHAccess-Control-Allow-Headers: origin, content-type, X-Requested-WithAccess-Control-Max-Age: 1800ETag: 'c51ce410c124a10e0db5e4b97fc2af39'Cache-Control: max-age=0, private, must-revalidateX-Request-Id: 35be6690-39e9-402c-901c-b9adf8a7c6382130...disconnectedThen after awhile I get the Connecting to ThingSpeak failed (X)I can still ping the ip of my device, so it seems to have a live internet connection and able to communicate with the outside world but not connecting to the thingspeak server. As I said all have been working for months. I am now in the process of trying to eliminate the chance of a bad arduino causing conflict for the others but removing each one at a time.  Let's see. Just strange after all this time, the six units not connecting permanently anymore...", "num_user_post": " 20", "author": "gerald"}, {"date": "March 6, 2014 - 12:09 pm", "content": "Check to see if there is enough free memory inside the update thingspeak function.  My large data acquisition project has been plagued with memory limitations even on a Mega!", "num_user_post": " 70", "author": "turgo"}, {"date": "March 14, 2014 - 7:36 am", "content": "Yes, i have the same problem, ive tried with xively and device hub - same issues", "num_user_post": " 2", "author": "jasonvanwyk"}, {"date": "March 26, 2014 - 1:45 pm", "content": "I have found my problem. Nothing to do with Thingspeak. For some reason my network is dropping my connection. I added a watchdog that detect client disconnect and my arduino reset after 3 checks. Anyways I also install thingspeak on a linux server and almost have it working. I will create a new post for that. Thanks for the suggestions. ", "num_user_post": " 20", "author": "gerald"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/api-to-create-channel/", "posts": [{"date": "January 17, 2014 - 3:10 am", "content": "Hi,Is there an API to create a channel for a given user.   The outcome I'm shooting for is; the arduino able to create a channel then start uploading data to it.  As it currently stands I need to create the channel via the web interface and then config the arduino.    One answer I can think of would be to have the API key's positioned at the user level instead of channel,  then any update to an unknown channel (with correct API key) could create that channel - or have a separate API to create.Food for thought.Thanks", "num_user_post": " 7", "author": "turboencabulator"}, {"date": "January 17, 2014 - 12:09 pm", "content": "Hi,We currently don't have this feature, but we are planning on adding an API to allow Channels to be created, edited, deleted, etc in the next few weeks.  We'll probably be adding user API keys to, just as you suggested.lee", "num_user_post": " 457", "author": "lee"}, {"date": "January 19, 2014 - 8:51 pm", "content": "Awesome,  Thanks.  Can you let me know when you're ready,  happy to test if you need someone.", "num_user_post": " 7", "author": "turboencabulator"}, {"date": "March 26, 2014 - 11:16 am", "content": "Hi,We just added the ability to create Channels via the API using user-level API keys, as you suggested.  Here's the relevant documentation: https://thingspeak.com/docs/channels#create .lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/dynamic-chart-update-rate/", "posts": [{"date": "March 14, 2014 - 2:08 pm", "content": "On the Github version, where should I look to edit the dynamic update rate. It's currently set to 15sec. I'd like to speed it up a little on my server. Thanks!", "num_user_post": " 5", "author": "hank4stmb"}, {"date": "March 14, 2014 - 2:56 pm", "content": "Hi,You can change the rate limit here: https://github.com/iobridge/thingspeak/blob/master/config/initializers/constants.rb#L9 .  You can also turn the rate limit off by modifying line 6.lee", "num_user_post": " 457", "author": "lee"}, {"date": "March 14, 2014 - 3:43 pm", "content": "Lee,Thanks for getting back to me. I guess what I'm after relates to when I embed a chart on a web page. When I set dynamic=true in iframe, it still only updates the chart about every 15 seconds despite line 6 in constants.rb set to false. Is there anyway to speed that up? I can successfully post to my feeds at 1sec. I'd just like to see it plotted in real-time at that rate. Thanks!", "num_user_post": " 5", "author": "hank4stmb"}, {"date": "March 14, 2014 - 3:54 pm", "content": "I think I found what I'm after in show.html.erb.Thanks for your time.", "num_user_post": " 5", "author": "hank4stmb"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/posting-several-channels-from-one-arduino/", "posts": [{"date": "February 26, 2014 - 2:06 pm", "content": "Hello all,           This was somewhat discussed in this post:http://community.thingspeak.com/forum/thingspeak-api/can-i-update-multiple-channels-with-one-post/But the fix for them won't work for me.  I am needing to post to 5 channels with one Arduino.  I am monitoring 20 DHT sensors with an Arduino Mega.  Since the Arduino Ethernet only allows for 4 clients, I can't put the 5 channels on their own client.  If anybody wants to see my code I will be more than happy to display it, but I am using the Thingspeak example as a base, I just added the writeAPIKey variable to the function call so that I could pass both to the update function.Thanks for looking.Tim", "num_user_post": " 1", "author": "soundjudgement"}, {"date": "March 6, 2014 - 10:34 am", "content": "Hi,I am just trying to find also an answer for this.  I need to update 4 channels one after another. I think it can be made only step by step...Hope somebody will help, till that I am also trying to find the solution...", "num_user_post": " 63", "author": "vespapierre"}, {"date": "March 6, 2014 - 11:58 am", "content": "Hi folks,I update 8 channels every 15 seconds with the code shown below.  I found that calling the updateThingspeak() function repeatedly didn't work. I needed some delay between calls, and attention to client.stop() considerations.  Thingspeak will not receive date more often than every 15 seconds. Here's my some of my code:// Disconnect from ThingSpeakif (!client.connected() && lastConnected){Serial.println(F('…disconnected'));Serial.println();client.stop();}//if ((client.connected()==1) && ((long(millis()) – lastConnectionTime) > 60000))//{// Serial.println(F('…disconnected after 60 seconds.'));// Serial.println();// client.stop();//}// Update ThingSpeakSerial.print(F('Millis:'));Serial.print((millis()));Serial.print(F(' Last Connection:'));Serial.print((lastConnectionTime));Serial.print(F(' Time:'));Serial.print((long(millis()) – lastConnectionTime));Serial.print(F(' Client connected:'));Serial.println(client.connected());if(((long(millis()) – lastConnectionTime) > updateThingSpeakInterval))//deleted !client.connected() &//generate Custom Flow Channel String// Slab Flow Meterdouble FreqSum=0;int FreqCount=0;while (FreqMeasure.available()) {// average several reading togetherFreqSum = FreqSum + FreqMeasure.read();FreqCount = FreqCount + 1;}double frequency = F_CPU / (FreqSum / FreqCount);Serial.print('Frequency: ');Serial.println(frequency);double slabGPM = frequency / .53 / 3.8 ; //4.5 for 1 1/4 SEA flow meterSerial.print('Slab GPM: ');Serial.println(slabGPM);String slabGPMStr = dtostrf(slabGPM, 7,2,buffer);slabGPMStr.trim();String channelFlowStr = String('field1=') + slabGPMStr;//Runner RPMdouble Freq2Sum=0;int Freq2Count=0;while (FreqMeasure2.available()) {// average several reading togetherFreq2Sum = Freq2Sum + FreqMeasure2.read();Freq2Count = Freq2Count + 1;}double runnerRPM = F_CPU / (Freq2Sum / Freq2Count) * 60;Serial.print('Runner RPM: ');Serial.println(runnerRPM);String runnerRPMStr = dtostrf(runnerRPM, 7,2,buffer);runnerRPMStr.trim();channelFlowStr = channelFlowStr + String('&field8=') + runnerRPMStr;Serial.println('Flow: ' + channelFlowStr);updateThingSpeak(channelFlowStr,channelFlowAPIKey);delay(250);// Print Thingspeak Update Response to Serial Monitorwhile((client.available())){char c = client.read();Serial.print(c);}//generate Heat flux Channel Stringdouble slabFlux = slabGPM * 8.33 * 60 *(allSensors[14].averageTemp-allSensors[15].averageTemp);//(Slab Cooling In-Slab Cooling Out)slabFlux = round(slabFlux/100)*100; //round to hundredsSerial.print('Slab Flux: ');Serial.println(slabFlux);String slabFluxStr = dtostrf(slabFlux, 7,0,buffer);slabFluxStr.trim();String channelFluxStr = String('field1=') + slabFluxStr;Serial.println('Heat Flux: ' + channelFluxStr);updateThingSpeak(channelFluxStr,channelFluxAPIKey);delay(500);// Print Thingspeak Update Response to Serial Monitorwhile((client.available())){char c = client.read();Serial.print(c);}client.stop(); //stop after last connection is made}//custom Update Thingspeakvoid updateThingSpeak(String tsData,String writeAPIKey){client.stop(); //added this because updating a second channel failedif (client.connect(thingSpeakAddress, 80)){client.print('POST /update HTTP/1.1n');client.print('Host: api.thingspeak.comn');client.print('Connection: closen');client.print('X-THINGSPEAKAPIKEY: '+writeAPIKey+'n');client.print('Content-Type: application/x-www-form-urlencodedn');client.print('Content-Length: ');client.print(tsData.length());client.print('nn');client.print(tsData);if (client.connected()){Serial.println(F('Connecting to ThingSpeak…'));Serial.println();failedCounter = 0;}else{failedCounter++;Serial.print(F('Connection to ThingSpeak failed ('));Serial.print(String(failedCounter, DEC)+')');Serial.println();}}else{failedCounter++;Serial.print(F('Connection to ThingSpeak failed ('));Serial.print(String(failedCounter, DEC)+')');Serial.println();lastConnectionTime = millis();}}", "num_user_post": " 70", "author": "turgo"}, {"date": "March 11, 2014 - 4:23 am", "content": "Turgo,thanks for sharing this!", "num_user_post": " 63", "author": "vespapierre"}]}]}