{"url": "https://community.thingspeak.com/forum/thingspeak-api/page-30/", "threads": [{"url": "https://community.thingspeak.com/forum/thingspeak-api/twitter-update-string-general-questions/", "posts": [{"date": "February 4, 2012 - 5:53 pm", "content": "Hi;I've been playing with the Cannel updater and theTwitter updater and have some questions.1 )I found that I have to concatinate my 'field1='+analogPin0+'&field2='+analogPin1+'&3='+another string+'&4='... I have only 7 fields but it just won't work if I  concatinate in one shot(i.e send it as updateThingSpeak(list of stuff)) I have to concatinate the data one at a time then put it in the 'updateThingSpeak(channelString)' .I used Dtostrf() to get string values of temperatures like xx.xx - and it seems that I have to put them in 1 at a time or I get ' ' or it hangs up.I have it working but I think I must be doing something wrong. Any ideas?2) I'm updating twitter as well I found that I have to keep my message short as I concatinate my strings ,what is the largest length? I can go about 6o charactars safely otherwise I get an error returned from the twitter update.Thanks for your helpEd", "num_user_post": " 5", "author": "Faster_ed"}, {"date": "February 5, 2012 - 4:47 pm", "content": "Under your channel settings, you have to have each field enabled for the data to be displayed.Go to Channels, select your Channel, then Edit Channel. You should see each channel and a check box.Let us know if that works.", "num_user_post": " 402", "author": "Hans"}, {"date": "March 3, 2012 - 9:56 pm", "content": "Sorry I was away for a while. Yes the channel fields are enabled. The problem is I can't use  updateThingSpeak('field1='+fgTempS+'&2='+maxfgTempS+'&3='+minfgTempS+'&4='+....'&6= '+minfzTempS) where fgTempS and other elements are created from a float for example:maxfzTempS=dtostrf(maxfzTC,7,2,buffer);if I try to update it will not work. However if I do several lines of :tsData = 'field1='+fgTempS; tsData = tsData + '&2='; tsData = tsData+maxfgTempS;  . . . etc.  it works.So I used the same approach for Twitter updates and I found that I can't send a message updateTwitterStatus(twitter string) where twitter string = ('my fridge temperature ,min, max is' +fgTemps+minfgTempS+max fgTempS+'my Freezer temperature,min,maxis'+fzTempS+minfzTempS+maxfzTempS) .I can send only half that much - just fine. any more - no. I'm thinking the string is too long for twitter .what is the maximum length?Is there a better way to deal with foat to string? There must be something funny about the strings created by dtostr() so that you can't just concatinate them in 1 shot.Thanks!Ed", "num_user_post": " 5", "author": "Faster_ed"}, {"date": "March 10, 2012 - 8:17 pm", "content": "O.K anyone who has trouble with the ThingChannel tweet app should know that there is a limit on how long your string can be(I don't know what it is). I modified the code in 'update twitter ' to send the key first and the data second. I made tweetKey= 'key' + 'status'  a string in 'void Setup' and added the 2 lengths the 'tsData.length()+tweetKey.length()' for the data length then 'client.print(tweetkey)':client.print(tsData)'. Much more stable and tweets every time now. also the update response works as well and easier with 'while' instead of 'if'.best of luck all!Ed", "num_user_post": " 5", "author": "Faster_ed"}, {"date": "March 11, 2015 - 10:07 pm", "content": "Faster_ed, would you be so kind as to share the code you are using with me.  I am having the same exact problem and have been pulling my hair out trying to figure it out.  Thanks.", "num_user_post": " 1", "author": "swilson"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/is-there-some-sort-of-regular-server-outage-between-4-and-5am-gmt/", "posts": [{"date": "March 9, 2015 - 4:34 am", "content": "Ive been trying to track down the source of a regular problem. Almost every night between 4am and 5am for varying lengths of time I end up with a gap in my data. Last night it was from 4:06am to 4:29am. I just cant figure it. Theres nothing in my code per se which would cause it so I am assuming its something out of my control. either an outage from my ISP or perhaps some regular maintainance on the thingspeak servers.Hoping you can she some light on it.", "num_user_post": " 54", "author": "chrisjmears"}, {"date": "March 9, 2015 - 10:43 am", "content": "Hi Chris,Our hosting provider has been doing some datacenter network maintenance recently that has been causing these problems.  Hopefully everything will be stable again soon.  In the meantime, we're working on improving our services to better mitigate these types of problems in the future.lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/update-a-single-field-in-a-channel/", "posts": [{"date": "June 19, 2012 - 10:38 pm", "content": "Hi!It appears that when I write to a channel all the fields are always written, so that I cannot write to just one of the fields.  Is this right?For example, if I create a channel with two enabled fields, and post 'field1=1' then query it, the results are 'field1=1' and 'field2=null'.  If I then write 'field2=1' and query again, I get: 'field1=null' and 'field2=1'.Is this the desired behavior?  Or, is there an alternate way to write to a channel while preserves the contents of the unwritten fields? The two workarounds I've thought of both seem bad for ThingSpeak's bandwidth: I could read out all eight fields, change the one I want, and write the new set back.  Or I could create eight channels with eight keys and use one field in each, instead of creating a single channel and anynchronously accessing each of its fields.  Both seem much less desirable. Advice?Thanks,Bruce", "num_user_post": " 1", "author": "brucecannon"}, {"date": "March 6, 2015 - 1:11 am", "content": "I'm new to ThingSpeak too, though it's now 2015.Has this problem been resolved or is this still not possible to update a single field at a time without 'nulling' all the other 7 fields on my channel?Please reply ThingSpeak experts, even if it's just to confirm this limitation/bug.", "num_user_post": " 1", "author": "helidrone888"}, {"date": "March 6, 2015 - 12:29 pm", "content": "The orginal forum post might not apply to your situation.Here's what is possible... You can write to all of the fields in a single call. You do not have to send nulls to fields that you don't want to write to.You just have to make sure that the fields are enabled in your channel settings.What are you looking to do that prompted the question?Thanks,Hans", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/trouble-with-the-site/", "posts": [{"date": "March 2, 2015 - 9:57 pm", "content": "I've seen a lot of problems over the last couple days connecting to the site. Just over the last couple hours, probably a third of the attempts to send data have failed.Is anyone aware of any issues?", "num_user_post": " 35", "author": "JChristensen"}, {"date": "March 3, 2015 - 8:47 am", "content": "Hi,Our monitoring systems show that everything has been stable for a long time.  What kind of connection problems are you seeing?  Do you have any logs of the failed attempts to send data?lee", "num_user_post": " 457", "author": "lee"}, {"date": "March 3, 2015 - 9:17 am", "content": "Hello Lee,I see failures to connect to the ThingSpeak server at 184.106.153.149. I do have logs if specific times will help. Between 02:52 03Mar UTC and 03:36 03Mar UTC I had about 45 failures to connect. Since then it's been working better; although there were just a few failures around 04:50 03Mar UTC.This is an Arduino-based device using a WIZnet WIZ811MJ module. Code has been stable for months. Other similar devices that connect to different services do not experience problems. There is also no indication of local network issues on this end.Any light you can shed will be greatly appreciated.Jack", "num_user_post": " 35", "author": "JChristensen"}, {"date": "March 3, 2015 - 9:54 am", "content": "Hi Jack,I suspect that the problem may be wider ISP or internet issues during that time period.  Here's a device posting data at 15-second intervals during the time period you mentioned: https://api.thingspeak.com/channels/9/fields/1.json?start=2015-03-03%2002:50:00&end=2015-03-03%2003:40:00&timezone=UTC . Were your connection errors due to timeouts?  Can you paste an example error?lee", "num_user_post": " 457", "author": "lee"}, {"date": "March 3, 2015 - 10:19 am", "content": "Here is an example, a successful post followed by a failure. I've inserted comments to help indicate what's going on. The 8-digit number at the start of each line is milliseconds.Local: 2015-03-02 21:52:00 EST51374796 **P=3646 D=3569 CF=89 WD=77 R=051384737 MEM=61351384742 XB RX/ACK           <-- incoming message received to be sent to ThingSpeak51384742 MEM=52451384762 SVR CONNECT      <-- connected to ThingSpeak51384767 POST 68.1,1,3.079,-74,0    <-- http POST complete51384768 MEM=52451384828 SVR RESP               <-- response received from serverHTTP/1.1 200 OKServer: nginx/1.7.5Date: Tue, 03 Mar 2015 02:52:10 GMTContent-Type: text/html; charset=utf-8Transfer-Encoding: chunkedConnection: closeVary: Accept-EncodingStatus: 200 OKX-Frame-Options: ALLOWALLAccess-Control-Allow-Origin: *Access-Control-Allow-Methods: GET, POST, PUT, OPTIONS, DELETE, PATCHAccess-Control-Allow-Headers: origin, content-type, X-Requested-WithAccess-Control-Max-Age: 1800ETag: 'a080def7063e0830291475e783ce2e7a'Cache-Control: max-age=0, private, must-revalidateSet-Cookie: request_method=POST; path=/X-Request-Id: 623ecb00-8194-48dd-a293-0427feb6f35671133846051384977 SVR DISC      <-- server disconnected. 240ms elapsed since receipt of incoming data.51384994 Connect=051389717 MEM=613    <-- next incoming message51389722 XB RX/ACK51389722 MEM=52451421867 nConFail 90   <-- connection fails after about 32 seconds.51421868 ThingSpeak send failed", "num_user_post": " 35", "author": "JChristensen"}, {"date": "March 3, 2015 - 10:42 am", "content": "Hi,Since the second request didn't receive a reply from our server, I think this is due to an intermittent internet network issue, which will hopefully resolve itself.lee", "num_user_post": " 457", "author": "lee"}, {"date": "March 3, 2015 - 11:29 am", "content": "I suppose that is possible if I'm the only one seeing it. But it does seem odd since this has been a recurring problem for a very long time (with two different ISPs) and seems to be limited to ThingSpeak. It might work well for days or weeks, then I'll see a rough patch like the last couple days.I'll keep an eye on it and next time it happens, I'll try to do a tracert or something. Sometimes in the past, when the microcontroller could not connect, I've also been unable to access the web site from a web browser, but that was not the case this time.Just out of curiosity, where are the servers physically located?", "num_user_post": " 35", "author": "JChristensen"}, {"date": "March 3, 2015 - 11:34 am", "content": "Hi,The servers are located in the Chicago area (running on Rackspace).lee", "num_user_post": " 457", "author": "lee"}, {"date": "March 3, 2015 - 1:03 pm", "content": "Interesting. I use another service that I think is also in Chicago, but I don't think they use Rackspace.Thanks, Lee.", "num_user_post": " 35", "author": "JChristensen"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/url-to-return-time-and-timezone/", "posts": [{"date": "March 2, 2015 - 2:34 pm", "content": "Is there any thingspeak url which can return time and possible timezone? in my arduino and esp8266 , I want to get the current time. SO if there is any thingspeak url which can return current time, then it will be very useful.Thanks", "num_user_post": " 8", "author": "rkgarg"}, {"date": "March 2, 2015 - 5:10 pm", "content": "Hi,This functionality does not exist in the ThingSpeak application, although we'll discuss adding it in the future.lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/help-sending-push-notifications-via-pushbullet/", "posts": [{"date": "February 26, 2015 - 5:05 pm", "content": "Hello,I am trying to set up a ThingHTTP to initiate a push notification from PushBullet.I have Content Type set to 'application/json'HTTP Auth Username is set to my PushBullet API auth keyURL is https://api.pushbullet.com/v2/pushesbody will be json formatted according to the pushbullet api (https://docs.pushbullet.com/#http)Response I get is the following:{'error':{'type':'invalid_request','message':'Access token is missing or invalid.','cat':'(=^･ω･^)y＝'}}Maybe not passing the HTTP Auth header correctly?  Any ideas?  I am at the edge of my knowledge here...Thanks.", "num_user_post": " 3", "author": "mycowx"}, {"date": "February 27, 2015 - 8:38 am", "content": "Hi,I'm not familiar with the PushBullet API, but here are some things to check for:1) Are you able to send your request successfully using curl first?2) Are you using the correct access token (rather than API auth key, if they're different)?3) Are you doing this with a POST method?lee", "num_user_post": " 457", "author": "lee"}, {"date": "February 27, 2015 - 1:18 pm", "content": "Alright, I got it to work.  For others that may be interested...First off, you need to encode your PushBullet API key to Base64 (RFC2045-MIME Standard).  I just used the online tool at http://base64-encoder-online.waraxe.us/ to do this.Then, from the ThingHTTP setup you need to add a header named 'Authorization' with the value 'Basic *Encoded API Key*'.Finally, the body of your message needs to be in JSON format following the PushBullet API methods.Thanks for your help, Lee, although the solution was a bit trickier than expected.  Using the Base64 encoded key in the HTTP Auth field of ThingHTTP didn't work either... I needed to add my own authorization header.  Not sure if this is a bug in your system or a unique situation to PushBullet.", "num_user_post": " 3", "author": "mycowx"}, {"date": "February 27, 2015 - 3:02 pm", "content": "Hi,Just a followup to the problem you were experiencing: if Basic Auth is used, both the 'HTTP Auth Username' and 'HTTP Auth Password' must be present or it is ignored.lee", "num_user_post": " 457", "author": "lee"}, {"date": "February 27, 2015 - 4:12 pm", "content": "Aha.  Therein lies the problem.  PushBullet wants their API key as the Basic Auth Username but doesn't require a password.  Putting my unencoded Pushbullet API key to the Username field and any nonsense characters in the password field works too!Thanks, lee.", "num_user_post": " 3", "author": "mycowx"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/how-send-push-notifications-to-parse/", "posts": [{"date": "February 22, 2015 - 9:51 am", "content": "Hello,I save data on Thingspeak and now I want send push notification (plain text or json) with Parse.I have created an HTTP object using the ThingHTTP and I control the object with API commands.It's work fine but now I wold like change the message when I send the request.I'm trying to send request with:Content Type: application/x-www-form-urlencoded but I receive: 'This endpoint only supports Content-Type: application/json requests, not application/x-www-form-urlencoded.'Is It possible change the message when I send a request?Any response is much appreciated.Thanks for any help.Giovanni", "num_user_post": " 1", "author": "Gio"}, {"date": "February 23, 2015 - 9:48 am", "content": "Hi Giovanni,I'm not sure exactly what you're trying to do, but I'll look further into it.  What is the ID of the ThingHTTP that you are using?lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/display-a-string-on-web-what-came-from-arduino/", "posts": [{"date": "July 7, 2014 - 8:30 am", "content": "Hi,is it possible to display a string through/with your API what came from the microcontroller?For example: In a case the microcontroller send 'YES' to the API and I would like to display it somehow on the web( with iframe or so on...)Do you have a solution for this?Thanks!", "num_user_post": " 63", "author": "vespapierre"}, {"date": "July 7, 2014 - 10:48 am", "content": "Hi,You can store a status message when updating a Channel feed by specifying 'status=' as a parameter.  You can then use JavaScript to get the status messages ( https://thingspeak.com/docs/channels#get_status ), and display them on a webpage or in an iframe.  Our plugin system ( https://thingspeak.com/docs/plugins ) should enable you to write everything you need within ThingSpeak itself.lee", "num_user_post": " 457", "author": "lee"}, {"date": "July 9, 2014 - 2:01 pm", "content": "Hi Lee,thanks! Would you be so kind to show any example about this? I am not a professional about Javascripts.Br,vespapierre", "num_user_post": " 63", "author": "vespapierre"}, {"date": "July 9, 2014 - 5:37 pm", "content": "Hi,Here's a simple plugin I made: https://thingspeak.com/plugins/4444 .  View the source of it, and you should be able to see how you can make a similar plugin.  If you run into any issues, let me know and I'll help out.lee", "num_user_post": " 457", "author": "lee"}, {"date": "July 10, 2014 - 2:20 am", "content": "Hi,great, thanks! I will try this and will back to you!vp", "num_user_post": " 63", "author": "vespapierre"}, {"date": "February 21, 2015 - 12:16 pm", "content": "lee said Hi,Here's a simple plugin I made: https://thingspeak.com/plugins/4444 .  View the source of it, and you should be able to see how you can make a similar plugin.  If you run into any issues, let me know and I'll help out.leeThanks it works perfect to display my list.How would i go about reversing the order of the list and list the last item first??EDIT:I got it working the way i wanted it by adding '.reverse' in that line of code:From first entry to last:  $.each(response.feeds, function() {From last entry to first:  $.each(response.feeds.reverse(), function() {", "num_user_post": " 1", "author": "cotejean"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/editing-tags-and-something-more/", "posts": [{"date": "February 16, 2015 - 2:15 pm", "content": "Hi everybody,I am around for already one year and now, after long meditation and increasingly pressure, I decided to dig for some answer, here on forum, after I exhaust all my resources to figure out by myself what is going on. I am profoundly ashamed but I can live with this...First question:Why is not possible to add tags to my channel? I tried to add 'BMP180, ESP8266, Pressure, Temperature, Light' and the there are accepted only Pressure and BMP180. Because Thingspeak offered this appealing feature to 'see' your devices on Twitter I became Twitted addict only because of Thingspeak. While ago, when this was happening, the love between my Thingspeak channel and Twitter was so steamy, I was able to see my devices' twits at every five minutes. Long before somebody get annoyed with my my desk's 'radiation level' I changed the time from five to sixty minutes. It was really nice to see it on my Twitter. But a few month ago everything stopped. I changed my Twitter settings, my Thingspeak settings (api key in fact) but, after a few glorious twits, everything stops.Second question:Why?Your truly devoted,teo_kanpublic channel 9892not public, yet, channel 15699", "num_user_post": " 2", "author": "teo_kan"}, {"date": "February 17, 2015 - 9:07 am", "content": "Hi teo_kan,We had a slight problem with saving tags which is fixed now.  Your tags should save correctly if you try again, and thank you for alerting us to this issue.You may have to relink your Twitter account.  Please delete it under the 'ThingTweet' section, and then link it again.  If it stops working again after that, please make sure that the Tweets are unique -- Twitter will block some Tweets that are exact duplicates, so you may have to add some randomness to your Twitter posts.lee", "num_user_post": " 457", "author": "lee"}, {"date": "February 18, 2015 - 12:24 pm", "content": "lee said Hi teo_kan,We had a slight problem with saving tags which is fixed now.  Your tags should save correctly if you try again, and thank you for alerting us to this issue.You may have to relink your Twitter account.  Please delete it under the 'ThingTweet' section, and then link it again.  If it stops working again after that, please make sure that the Tweets are unique -- Twitter will block some Tweets that are exact duplicates, so you may have to add some randomness to your Twitter posts.leeHi Lee,Thank you for your quick action: now it works, indeed!For the Twitter stuff I have to take my shovel and start digging. Thanks a lot!", "num_user_post": " 2", "author": "teo_kan"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/add-yaxismin-yaxismax-to-multi-field-plugin/", "posts": [{"date": "February 13, 2015 - 6:11 pm", "content": "I've been trying unsuccessfully to add min & max to the multi field plugin.  If it is possible could someone please give me an explanation of how?Thanks", "num_user_post": " 7", "author": "Cyn"}, {"date": "February 17, 2015 - 8:47 am", "content": "Hi,Find the JavaScript section of the plugin that reads:yAxis: { title: { text: y_axis_title } },To change the yaxis min/max to 50/100, for example, change it to the following:yAxis: { title: { text: y_axis_title }, min: 50, max: 100 },lee", "num_user_post": " 457", "author": "lee"}, {"date": "February 18, 2015 - 10:50 am", "content": "That was easy, Thanks", "num_user_post": " 7", "author": "Cyn"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/blank-chart/", "posts": [{"date": "February 4, 2015 - 6:13 pm", "content": "I'm having start-up problems with the private chart - channel 25505 (great number).Used Rest Easy to load 5 values into field 1, but no line on the chart. JSON, XML & CSV all show good stuff. What have I done wrong? Thanks.", "num_user_post": " 2", "author": "slyguy"}, {"date": "February 5, 2015 - 8:49 am", "content": "Hi,It seems like your data is being added as '(144)' instead of '144'.  Please remove the parentheses when adding data, and the chart will then know how to interpret the data correctly and draw the lines.lee", "num_user_post": " 457", "author": "lee"}, {"date": "February 5, 2015 - 5:11 pm", "content": "I bet that'll do it. Thanks for your speedy response.And thanks for hosting a site like this.", "num_user_post": " 2", "author": "slyguy"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/http-return-values/", "posts": [{"date": "January 27, 2015 - 4:18 pm", "content": "... I'm using a GET to update values in my channel.  Information returned is as follows:HTTP/1.1 200 OKServer: nginx/1.7.5Date: Tue, 27 Jan 2015 21:09:25 GMTContent-Type: text/html; charset=utf-8Transfer-Encoding: chunkedConnection: keep-aliveVary: Accept-EncodingStatus: 200 OKETag: '37693cfc748049e45d87b8c7d8b9aacd'Cache-Control: max-age=0, private, must-revalidateX-Request-Id: 34317245-804d-403a-b9b4-6dd819eae19b2230There are five lines returned... the middle one 23 being the row number.  What are the other 2 ?  I thought there should only be one ie Row Number that is 0 if unsuccessful.Thanks", "num_user_post": " 1", "author": "arawire"}, {"date": "January 28, 2015 - 9:32 am", "content": "Hi,The '2' is the content length (since '23' has 2 characters), and the '0' signals the end of the HTTP message.  If you view your request in a web browser or other application that understands and parses HTTP, then only the '23' would be displayed.lee", "num_user_post": " 457", "author": "lee"}]}]}