{"url": "https://community.thingspeak.com/forum/thingspeak-projects/page-4/", "threads": [{"url": "https://community.thingspeak.com/forum/thingspeak-projects/update-rate-of-thingspeak/", "posts": [{"date": "June 28, 2016 - 2:25 pm", "content": "I know I should already know this but what is the update rate of the ThingSpeak when loading data?I originally set to 5 seconds and it worked fine, then I used 1 second and it doesn't grab every update.", "num_user_post": " 1", "author": "wher0001"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-projects/thingspeak-used-for-oil-and-gas-industry/", "posts": [{"date": "June 24, 2015 - 10:20 am", "content": "Most industrial electronic devices using Modbus protocol for data communication.No exception for the Oil and Gas Industry, the flow meter device like Emerson FloBoss, Omni Flow Computer, Actaris EVC, or Schneider ScadaPack also using Modbus Protocol.Then, How if we want the sensor data contained in these tools can be shown also in the ThingSpeak ? The answer is we need an gateway application that serves to read sensor data using the Modbus protocol and then send them to ThingSpeak by using the API.For a real example of this application, I used to read real-time data from the sensors like Temperature, Pressure, and Flow Gas used for Bontang City Gas at Kalimantan Timur, Indonesia and then send it to ThingSpeak. So.. Now we can monitoring via web at ThingSpeak Channel https://thingspeak.com/channels/41318If you have a Modbus Device and want send it data to ThingSpeak, you can download the application here https://dl.dropboxusercontent.com/u/3351822/HINET_IOT_GATEWAY.rarGood Luck.", "num_user_post": " 2", "author": "Heru Iqbal"}, {"date": "May 29, 2016 - 8:24 am", "content": "The link is not working ?", "num_user_post": " 9", "author": "MohanadOdema"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-projects/iot-channel-explorer-an-api-for-debugging-thingspeak-channels/", "posts": [{"date": "May 19, 2016 - 5:28 pm", "content": " Hi All,I recently got an opportunity to work on building an application that lets users interact with the ThingSpeak channels in a seamless way. This application is called IoT Channel Explorer. It is an intuitive webpage that allows users to generate random data and push this data into the ThingSpeak Channels, manually insert a specific data point to a channel and fetch the top data entries from the channel. The user can customize the channel parameters by giving it's own read and write api keys and the field number for the channel. The webpage has sufficient information at various places to help the user understand what exactly is going on upon clicking a particular button. The code for the application can be found here : https://github.com/afan31/iot-channel-explorer One can follow the steps in the README to quicky setup the application in their local. In order to let the users get started with using the application without going through the hassles of installation, I have also deployed the application here : https://iot-channel-explorer.herokuapp.com/  (please change the channel parameters by clicking on the wrench icon in the top-right before proceeding)Suggestions for improvement are more than welcome.Thank you,Afan", "num_user_post": " 3", "author": "afan"}, {"date": "May 20, 2016 - 9:30 am", "content": "Great project, thanks for sharing. The demo is working but the link to the source code is not working. I think an extra space is the the link.  Thanks, Hans ", "num_user_post": " 402", "author": "Hans"}, {"date": "May 20, 2016 - 11:45 am", "content": "Thanks Hans. Yes, an extra space is there in the original link. The updated link for the code is :https://github.com/afan31/iot-channel-explorer Thanks,Afan", "num_user_post": " 3", "author": "afan"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-projects/can-two-admins-access-and-edit-a-channel/", "posts": [{"date": "March 31, 2016 - 3:39 am", "content": "Can two admins access and edit a channel?I need to have to have access and edit rights to a channel, also I want to let my customer edit the channel, how can I do it?", "num_user_post": " 1", "author": "avebrahimi"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-projects/thingspeak-projects-on-hackster-io/", "posts": [{"date": "March 17, 2016 - 11:31 am", "content": "We have joined Hackster.io and added ThingSpeak as a platform.We already have 18 followers and 14 documented projects.https://www.hackster.io/thingspeakYou can help the community by following ThingSpeak on Hackster and sharing your projects.", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-projects/how-to-make-thingspeak-serve-binaries-as-response-2/", "posts": [{"date": "January 5, 2016 - 12:10 am", "content": "Hi all , i want the following to happen :Whenever a field value in Thingspeak Channel crossses a threashold , the THingspeak should push a binary as response , how do i do that.Take it in a way like a software update on a remote system , as a particular date passess the Thingspeak should push a binary to it.", "num_user_post": " 3", "author": "hkbiet"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-projects/pad-photovoltaic-automatic-dimmer/", "posts": [{"date": "December 19, 2015 - 11:13 am", "content": "hello folks, here is my Thingspeak Projecthttp://p-a-d.jimdo.com/iot/https://thingspeak.com/channels/67005I use a special embedded system & ESP8266-01...", "num_user_post": " 1", "author": "PAD"}, {"date": "December 19, 2015 - 12:34 pm", "content": "Cool! Is that a MATLAB visualization? What are your plans with this project?", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-projects/aquarium-monitoring/", "posts": [{"date": "December 8, 2015 - 6:25 am", "content": "hello folks, here is my Thingspeak Projecthttp://webx.dk/ak/I use this wireless 433MHz hardware and a PC programhttp://webx.dk/COMMAIL/index.htmA few questions :can I remove the dots ? and only show the lines ?can I : reset / clear / modify, only ONE field of a channel ?why can I only have 8 fields in one channel ?I need more curves, so I created more channels = more API codes = more work, feels like alot of unneeded problems.", "num_user_post": " 24", "author": "OZ2CPU"}, {"date": "December 10, 2015 - 4:48 pm", "content": "Hi OZ2CPU,Thanks for the post. I'm a user experience specialist on the development team for ThingSpeak. We're in the processes of researching customer workflows and collecting new requirements for ThingSpeak. Would you be interested in having a conversation over the phone so we could gather more information about your goals and process for building your Aquarium project?  Thanks,Jeff Goodwinjeff.goodwin@mathworks.com", "num_user_post": " 3", "author": "Jeff Goodwin"}, {"date": "December 10, 2015 - 4:56 pm", "content": "you are more than welcome to phone me 🙂I be honored to assist, I got a bunch of cool ideas, not just for me, but for all users.I live in denmark, so better check local time here is between 0900 to  2300my phone is not secret in anyway : +45 51 56 92 21I just updated my page again 🙂constantly adding features and sensors", "num_user_post": " 24", "author": "OZ2CPU"}, {"date": "December 11, 2015 - 3:45 pm", "content": "Great! Would it work if I and a colleague called you at 4:00 p.m. (Denmark time) on Tuesday 12/15?Thanks,Jeff", "num_user_post": " 3", "author": "Jeff Goodwin"}, {"date": "December 12, 2015 - 7:54 am", "content": "yes please 🙂", "num_user_post": " 24", "author": "OZ2CPU"}, {"date": "December 15, 2015 - 11:05 am", "content": "Hi again Jeff, nice talking to you..here a short summary of the mentionened features we discussed:reset one field, (edit data in one field) as it is now reset all fields in a channel is the only option.slow responce, sometimes curves apear empty and the circle turn for quite a while, reload page and it goes nice and fast again.easy way to scale / calibrate / offset measurements, usefull for many type of sensors, just transfer the raw adc value,and have thingspeak calculate the temperature in F and C for example, offset and slope is needed for this,it is often a hazzle to do floating point in a tiny small microcontroller, it takes many cycles, and battery time to perform,and also if you have many sensors with a little bit different readout they all needs to have different calibration factors.Signal Filter : remove bad samples, like low pass fiter, or running avarage, maybe even let the user pick a few different methodesor write a line of math to perform it.Easy way to look into old data, like first week of last may, I want to see lake water level.as it is now I can set number of days from today, or number of samples, I miss a start-stop dateI could offcourse export all data, and play with it externally.easy way to merge several fields into one, it is possible now using mathlab, write code and such, it is not that easy.only 8 fields in a channel, why not 80 ? if the user wants it ?remove dots ? or dots size variable ?curve smoothing variable ? the spline option allready do it a little bit,but maybe spline-extreame and spline-lowpass could be cool extra features to add", "num_user_post": " 24", "author": "OZ2CPU"}, {"date": "December 15, 2015 - 4:45 pm", "content": "ADD :I forgot to mention we also talked about EMAIL alarms,I suggest an easy way to apply alarm levels, like min and/or max levels, and simply send a mail to the users OWN configured email adr.like :Subject : Important message from ThingSpeakEmail : your channel name, field#, is over alarm level..keep it simple 🙂 and most important :  EASY to use and configure.", "num_user_post": " 24", "author": "OZ2CPU"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-projects/arduino-uno-hcsr-04-esp8266-4-direction-distance-data-upload/", "posts": [{"date": "November 5, 2015 - 9:32 am", "content": "I've successfully finished my project. Here is the my question:Is there any other way to visualize my 4 direction distance data in one graph on  3 dimensional surface (plane) ?If you want to be sure about what I mean by 4 direction, it would help you to watch progress of series videos right here:https://www.youtube.com/channel/UCOO4VRwjaLaE1g4mAj6JnQA", "num_user_post": " 1", "author": "ElCezeri"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-projects/request-assistance_max31855-data-to-thingspeak/", "posts": [{"date": "August 24, 2015 - 9:39 am", "content": "Hello...a newbie to the forum asking humbly for assistance. Objective is to have data from K-Type thermcouples via the MAX 31855 breakout board (for Raspberry Pi) push to Thingspeak. The Python script required to do so is beyond my current experience level.The RPi is gathering data at 1 second interval from the sensor. I've set up a Thingspeak channel and have API's .I would be soooo grateful for assistance in adding the necessary script to allow for data visualization / archiving via Thingspeak.Ohh..the data is part of broader stack of info supporting 'proof of concept' for new ultra-high performing wall system.", "num_user_post": " 1", "author": "akamin"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-projects/counting-cars-and-analyzing-traffic-with-a-raspberry-pi-a-webcam-and-thingspeak/", "posts": [{"date": "August 22, 2015 - 4:00 pm", "content": "In this IoT project, we use a Raspberry Pi, a web cam and ThingSpeak to count cars on a busy highway. We deploy a car-counting algorithm to the Raspberry Pi device, and we analyze and visualize the traffic patterns with ThingSpeak, a data aggregator.Check out the whole project at:http://www.mathworks.com/matlabcentral/fileexchange/52456-counting-cars-and-analyzing-traffic-using-a-webcam--a-raspberry-pi-and-thingspeak", "num_user_post": " 47", "author": "Rob Purser"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-projects/hmi-for-thingspeak-platform/", "posts": [{"date": "June 11, 2015 - 1:16 pm", "content": "HMI (Human Machine Interface) is the user interface in a manufacturing or process control system. It provides a graphics-based visualization of an industrial control and monitoring system. Previously called an 'MMI' (man machine interface), an HMI typically resides in an office-based Windows computer that communicates with a specialized computer in the plant such as a programmable automation controller (PAC), programmable logic controller (PLC) or distributed control system (DCS). Generally, data communication between This HMI and devices is using Modbus Protocol. But for ThingSpeak user, I changed this HMI program is to be requesting data from the API ThingSpeak.If friends here want to try this application, please download the program here -> https://dl.dropboxusercontent.com/u/3351822/HMIforThingSpeak.rarAfter download and extract files to your folder, run HINET.exe. You can change the channel that I use for this HMI, with the channel belongs to you by clicking the Configure button.Thank You", "num_user_post": " 2", "author": "Heru Iqbal"}]}]}