{"url": "https://community.thingspeak.com/forum/thingspeak-api/page-21/", "threads": [{"url": "https://community.thingspeak.com/forum/thingspeak-api/dynamic-chart-with-timescale-set/", "posts": [{"date": "June 22, 2016 - 8:08 am", "content": "Hi,I've embedded a chart on a web page, intending the chart to update dynamically. The chart is embedded in an iframe with the following source:https://api.thingspeak.com/channels/MY_CHANNEL_ID/charts/1?pi_key=MY_API_KEY&days=1&timescale=10&bgcolor=%23ffffff&color=%23d62020&type=line&dynamic=trueThe chart does not update dynamically.If I remove '&timescale=10', then the chart updates every 15 seconds or so, but with the timescale set, no update occurs.Should I expect the chart to update automatically (I DO expect it, but is that an unreasonable expectation)?I searched for posts regarding similar problems, but I have not found anything that solves my problem.", "num_user_post": " 5", "author": "uphillbattle"}, {"date": "June 22, 2016 - 11:16 am", "content": "'timescale=10' is taking your data in your channel and picking 1 point per 10 minutes. So, dynamic=true is updating when new 'raw' data comes in. A timescaled chart would only get a new point every 10 minutes.", "num_user_post": " 402", "author": "Hans"}, {"date": "June 23, 2016 - 1:43 am", "content": "Quite right, I'm trying to limit the amout of data in the chart (when plotting for an entire day, I don't need more data than every 10 minutes).But: The chart never updates. Not after 10 minutes, nor 20 or overnight, for that matter.So, I'm still wondering... 🙂EDIT: Ahh, maybe I misunderstood you, Hans. Are you saying that the chart won't update as long as I have the chart timescaled?", "num_user_post": " 5", "author": "uphillbattle"}, {"date": "June 24, 2016 - 6:06 pm", "content": "Exactly. Since the chart has to collect 10 minutes of timescaled data. If you really wanted the chart to update, you could either write a custom plugin or use MATLAB to collect / process (timescale) the data from your channel and write it to a new one. Then the charts would work without using timescale.", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/bug-found-number-of-days/", "posts": [{"date": "May 3, 2016 - 3:28 am", "content": "please, when will the old number of days bug be solved ?it makes me sad not to be able to see data change over a very long time,I got some battery voltage indicators, and need to see the value drop over a whole year.see webx.dk/ak", "num_user_post": " 24", "author": "OZ2CPU"}, {"date": "May 3, 2016 - 6:13 pm", "content": "The limitation is how many data points that you can pull at once. This is 8000 max. But, you can make calls using date and time stamps to keep pulling data over the past. Here's a forum post about how one user is plotting data over time. Maybe his library works for what you are looking for.http://community.thingspeak.com/forum/announcements/thingspeak-live-chart-multi-channel-second-axis-historical-data-csv-export/", "num_user_post": " 402", "author": "Hans"}, {"date": "May 10, 2016 - 4:31 am", "content": "yes hans, thanks for getting back to me, I know about the bug / limitation,but why not fix it ?I really like to upload data at my regular update interval, so I can see smaller changes too,but I also like to see the 'big-picture' over a year or two, in the regular web based curves,how about if your system simply skip every 2dn point in case a user setup the curve view for more days,If the total points is over 8000 but under 16000, the user will not be sad about missing points, but be happyabout the needed time span is now working.a similar fix can be used if the total is in the 16000-24000 range, then you just show every 3rd. point,and so forth, a very easy fix on your side, but a huge help for all users 🙂", "num_user_post": " 24", "author": "OZ2CPU"}, {"date": "June 20, 2016 - 9:18 am", "content": "I missed your reply, but here is something that you can try.http://api.thingspeak.com/channels/71167/charts/5?width=auto&height=auto&days=365&type=spline&average=dailyThe API parameter to notice is 'average=daily' - this will create a summary of your channel data so you can see it over a long span of time.", "num_user_post": " 402", "author": "Hans"}, {"date": "June 20, 2016 - 11:38 am", "content": "wow thanks, this is exactly what I need,how do I incorporate this ?into mt webpage ? (see link post 1)so it looks like the other curves, but just works over 365 days,it is for the battery indicators 🙂 offcourse, here it makes sense to show the value over very long time.", "num_user_post": " 24", "author": "OZ2CPU"}, {"date": "June 21, 2016 - 3:01 am", "content": "if anyone got a minute ? please see webx.dk/akthe bottom test curves battery voltages, are made with the avarage=dailythey dont seem to work ?? what is wrong ?", "num_user_post": " 24", "author": "OZ2CPU"}, {"date": "June 21, 2016 - 7:44 pm", "content": "Hi OZ2CPU,In your post you wrote  avarage=daily ...I tried in my browser as a webpage, filled ALL page:http://api.thingspeak.com/channels/58826/charts/1?width=auto&height=auto&start=2016-03-01&type=spline&average=daily&color=feaa55&bgcolor=335577&round=2In my machine W10-CHROME it worked (think still works) I took more than a minute, but it is Ok.Maybe this helpsHSRegards", "num_user_post": " 91", "author": "piajola"}, {"date": "June 22, 2016 - 3:15 am", "content": "thanks, yes I did spell wrong, but only in the forum post 🙂https://thingspeak.com/channels/71167/charts/8?days=5&type=spline&average=dailythis do not work.. WHY ?? please help..please also see original curve here:https://thingspeak.com/channels/71167/charts/8?days=5", "num_user_post": " 24", "author": "OZ2CPU"}, {"date": "June 22, 2016 - 2:53 pm", "content": "hello ??still no one can fix this ??", "num_user_post": " 24", "author": "OZ2CPU"}, {"date": "June 22, 2016 - 4:54 pm", "content": "It looks like it is working. There was a week were you didn't have any data, so days=5 is only going to give you the last 5 days of data and you have only 3 continuous days of the 5 last days. The days parameter is calendar days.Check out this link for 15 days - this might be a little clearer to see.https://thingspeak.com/channels/71167/charts/8?days=15&type=spline&average=daily", "num_user_post": " 402", "author": "Hans"}, {"date": "June 23, 2016 - 4:26 am", "content": "thanks for getting back to meyes correct, I got a few days now and then with no data.but days with no data, should just make a line from the other good days ?or at least be back to normal the day after again ?the day avarage is wrong ?the centre value is 0.04but my sensor run on 3 to 4 voltssee the curve with no day avarage for correct valueshttps://thingspeak.com/channels/71167/charts/8?days=5how to make it display the correct avarage value ?", "num_user_post": " 24", "author": "OZ2CPU"}, {"date": "June 23, 2016 - 11:17 am", "content": "Okay... I have a lot of things to try to explain / ask, so we can get to the bottom of the issue. We might need a few exchanges in order to get to the heart of the issue.1) Looking into your channel data, I see that Field 8 gets a lot of 'nulls' - and only every once in awhile I see actual values like '3.67'.You can see it with this API call: https://thingspeak.com/channels/71167/fields/8.json?days=5&timezone=America/New_YorkAre you updating your channel with separate requests? For example: /update?field1=100 and then another request like /update?field2=200 ? If you do the updates to a channel with separate requests, then the other fields get a null value. You should send requests that look like /update?field1=100&field2=200 (send multiple fields in one request). You might be sending all of the data at once, so you might want to look at what is causing the nulls in your channel.2) Nulls skew average calculations. You are getting very low averages since you are averaging null, null, null, 3.67, null, etc. The average is going to be really low.3) A median might be better suited for your data. Try this:https://thingspeak.com/channels/71167/charts/8?days=100&median=daily4) I would also like to suggest MATLAB Analysis - if you are not able to send cleaned up data to ThingSpeak, then you can use MATLAB Analysis to read in the raw data, process it, then write the processed data to a new channel. Then, you do not have to use the average / median filters that the API provides. average / median only solves some basic clean up use cases. MATLAB ANalysis is intended to be complete custom clean up and processing of IoT data.Let us know if this helps.Hans", "num_user_post": " 402", "author": "Hans"}, {"date": "June 24, 2016 - 5:39 am", "content": ">1) Looking into your channel data, I see that Field 8 gets a lot of 'nulls' - >and only every once in awhile I see actual values like '3.67'.yes sir correct, however, I am not the one who make the nulls 🙂>Are you updating your channel with separate requests?YES, correct again 🙂 so I am the one who make the null, simply due to another problem, I use several wireless sensors, they send data at different rates, but to the SAME database, just different curve, and to make it even worse, I send my battery voltages at a very low rate, simply due to the 8000 point limit, this way I tried to make the time span wider for voltage curves.>2) Nulls skew average calculations. You are getting very low averages >since you are averaging null, null, null, 3.67, null, etc. The average is going to be really low.BINGO !! I tottally dig it, finnally we understand the problem, and can find a solution 🙂>3) A median might be better suited for your data.YES perfect, it really works, I am super happy now.another solution is to create a new channel (new seperate database) for each voltage curve this way the avarage will work.PS: how about change the avarage calculator to skip null in the database ?PPS: now I made the changes, curves are now perfecthttp://webx.dk/ak/", "num_user_post": " 24", "author": "OZ2CPU"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/changed-alot-of-stuff-june-13/", "posts": [{"date": "June 20, 2016 - 6:20 am", "content": "what happened ??all my online stuff, is not online anymore ??no sensors deliver data since june 12 ??and all curves needed stuff to be changed online so old curves will display,I can access all sensors anymore, now I need to make new sensors and installwhat exactly is changed ?why ?and why did the system not email users about this ?", "num_user_post": " 24", "author": "OZ2CPU"}, {"date": "June 20, 2016 - 8:54 am", "content": "Can you tell us what device you are using? Can you tell us what you see on the charts? There is nothing on our side that changed on the day that you are asking about. We will dig into it.", "num_user_post": " 402", "author": "Hans"}, {"date": "June 20, 2016 - 11:43 am", "content": "maybe coincident, but my feed also stopped updating on the 12th after months of painless running.Seems now, with restarting the submitting deamon it started to work again.", "num_user_post": " 1", "author": "marcelrv"}, {"date": "June 20, 2016 - 11:50 am", "content": "I changed nothing 🙂no grapth was shown, so I logged in, and got new links from the puplic page,and I did see minor stuff changed in the links, then I got red curves again,so I am sure something was changed or improved.", "num_user_post": " 24", "author": "OZ2CPU"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/read-thingspeak-channel-using-arduinoesp8266-at-commands/", "posts": [{"date": "May 12, 2016 - 11:54 am", "content": "Good day gents,im able to send GET request to update a channel using arduino nano + esp8266 with AT commands and it works fine.But when i make a GET request to receive the last value in a channel(field), then i dont get any response.Can somebody please help? thankshere codeAT+CIPSTART='TCP','184.106.153.149',80AT+CIPSEND=(correct lengh calculated online)>GET /channels/10xxxx92/fields/1/last?api_key=xcxcxcxcxcxcSEND OK (but no rsponse)", "num_user_post": " 2", "author": "mamic2"}, {"date": "June 20, 2016 - 9:11 am", "content": "Does your GET request work in a browser tab?", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/name-of-the-fields/", "posts": [{"date": "May 10, 2016 - 12:04 pm", "content": "hello everyone,I need to change the name of the fields that appear in the excel/csv file of my channel, which are Field1 Field2...I tried to change field label from channel setting, but it didn't change...I'm using arduino+WiFi shield to send data to my ThingSpeak channel.", "num_user_post": " 5", "author": "most211"}, {"date": "May 10, 2016 - 11:08 pm", "content": "The names at the top of the CSV file are fixed to field1, field2, etc. The label changes the metadata in other parts of the API.", "num_user_post": " 402", "author": "Hans"}, {"date": "May 11, 2016 - 11:15 am", "content": "Hans said  The names at the top of the CSV file are fixed to field1, field2, etc. The label changes the metadata in other parts of the API.  I need to send the whole data list to someone who doesn't know the name of field1 field2...is there any way to view these data with a different field labels in other location/format ??", "num_user_post": " 5", "author": "most211"}, {"date": "June 20, 2016 - 9:10 am", "content": "The labels are returned in the JSON format. For example: https://api.thingspeak.com/channels/1417/feeds.jsonfield1: 'Last CheerLights Command',field2: 'CheerLights HEX Color',...", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/http1-1-connection-keep-alive/", "posts": [{"date": "June 1, 2016 - 2:33 am", "content": "I was wondering, does thingspeak do keep-alive connections? No matter what I try, thingspeak responds with a close connection. I am working with the TI CC3200 chip which thingspeak doesn't have much documentation on. I've successfully ran my code to connect with amazon web services and am able to connect and post to thingspeak with the only issue being it responds with connection: close even though I had specified in the headers for connection: keep-alive. Thanks", "num_user_post": " 1", "author": "chai.yang"}, {"date": "June 20, 2016 - 9:07 am", "content": "Are you using HTTP 1.1?", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/how-to-get-last-entry-by-javascript/", "posts": [{"date": "April 28, 2016 - 5:30 am", "content": "Can anyone write the full script in javascript to get last entry from channel?", "num_user_post": " 1", "author": "gnork"}, {"date": "April 21, 2016 - 8:58 am", "content": "Here is a full example using jQuery: http://community.thingspeak.com/tutorials/javascript/parse-thingspeak-last-entry-feed-with-jquery/Also, my CheerLights project has a jQuery example. http://cheerlights.com/build/", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/how-can-i-make-three-sensors-display-values-in-one-channel-with-three-chartsnewbie/", "posts": [{"date": "May 18, 2016 - 3:28 pm", "content": "Using one temp sensor and a channel with one field worked with the write API key created and inserted at the sensor IP adress (works over wifi).I then added a dual sensor for temp and humidity on another IP address in the LAN and gave that sensor a new write API key. This does not display correctly although I named two more fields.There hiatus in my understanding of how Thingspeak field charts work and connect to a specific API key.  Lets assume that the sensors are TempRoom1 (with one write API key), TempRoom2 and HumRoom2 (these share another write API key that i created in that channel with the API creator, i.e. the sensor web page only has a field for a common API key for temp and humidity). I create three charts and name them as the sensors.Did I do it wrong? Should there only be one API key for both sets of sensors? How is sensor data communicated to a specific chart since there is no logical link between a specific sensor and a chart. Does the name of a chart have any role?If I fouled up my channel, is it enough to create a new channel and give the sensors one or two new API keys?Is there any link between the note that can be saved and the name of the Field chart?I'm a total beginner with this and would appreciate your help.(Case: I rent a basement studio. During the summer while I'm absent for weeks, there is a risk that humid summer air will condense on the walls of the studio creating mold and discoloration. I can activate a heater fan remotely if relative humidity rises to risky levels. )", "num_user_post": " 2", "author": "jonasemote"}, {"date": "May 19, 2016 - 1:23 am", "content": "One possible problem you may have with 2 independent devices updating the same channel is that thingspeak only allows 1 update every 15 seconds so if your 2 devices attempt to update the same channel within 15 seconds of each other then the second update will fail.  It may be best to create separate channels then graph the combined data using the Matlab Visualisation app.You can use the same write API key for the two devices although you will still have the problem above.If you explain a bit more about how your graphs are broken it may help.", "num_user_post": " 271", "author": "rw950431"}, {"date": "May 20, 2016 - 5:42 pm", "content": "Thanks for your hints.It now works fine with the temp+humidity sensor, it shows correctly in two charts. However, when I add a second temp sensor, it writes to the same chart as the first one. I then used the same write key for both sensors. I did separate update times like for the first sensor every 60 second, for the second one every 327 seconds so as to minimize update collisions. This did not help. Nothing is written to the third chart that I created, although the sensor web page says that it is connected to thingspeak,  So it seems that I need to use a second API write key for the second temp sensor. However, I am not sure if one channel allows for several write keys. Also, I can' find how to create a second channel within my present account.  Maybe one has to start with a second account.It seems that the Thingspeak channel system can not separate between sensors if they have the same function, although their MAC adresses and device IDs are distinct. How can I make the channel system differentiate between two sensors of the same type within the same channel? PS I created a second account with a new channel and a separate write API key for the second temp sensor. This works, but it would be better to be able to have several sensors of the same type but with different device IDs within one channel. The problem seems to be that one can not assign a specific device ID to a specific field. Edit: The second account excluded the first in spite of the two accounts having different user names and email addresses (but the same password). When I type in the URL for the first channel https://thingspeak.com/channels/xxxxxx/private_show I get the message that the page can not be found. This problem was only solved with using different browsers for the two accounts (safari and chrome on Iphone).", "num_user_post": " 2", "author": "jonasemote"}, {"date": "June 20, 2016 - 8:56 am", "content": "You should send one update with multiple values. For example, /update?field1=20&field2=30And, make sure on the channel settings tab that you have the fields enabled (checked).Let us know what you discover.", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/xml-http-request-for-clear-a-channel/", "posts": [{"date": "April 5, 2016 - 6:36 pm", "content": "Hi, I have a dashboard with many plots and button plugins for a domotic IoT project. I would create an html button connected to an image that allows me to clear all my data from a thingspeak channel.I'm having a problem to send an http DELETE to https://api.thingspeak.com/channels/CHANNEL_ID/feeds.xml for clear all data from a channel (how is explained here http://it.mathworks.com/help/thingspeak/clear-a-channel.html).I use this script for the XML GET requests, and it has always worked. But if i try to use it for the DELETE request it doesn't work. <button id='buzzerButton' style='border:none; background-color:transparent' onclick='loadDoc('https://api.thingspeak.com/channels/xxxxxx/feeds.xml.','api_key=xxxxxxxxxxxxx');'> <img width='20%' height='20%' src='http://www.app-trailer.com/appicons/android/100x100/com.androidlord.cacheclear.png'></button><script>function loadDoc(uri,post_data) { var xhttp = new XMLHttpRequest() ; xhttp.onreadystatechange = function() { window.alert('Command Sent'); }; xhttp.open('DELETE', uri, true); xhttp.setRequestHeader('Content-Type', 'application/xml; charset=utf-8'); xhttp.setRequestHeader('Accept', 'application/xml; charset=utf-8'); xhttp.setRequestHeader('Content-Length', post_data.length); xhttp.send(post_data);}</script>  Is there anyone that could help me? Thanks.", "num_user_post": " 1", "author": "MG11"}, {"date": "April 11, 2016 - 6:31 am", "content": "Hi MG11, I'm facing the same problem, but with no luck. I've tried, firstly, type the http command in the browser, but nothing worked.", "num_user_post": " 1", "author": "zasx007"}, {"date": "April 15, 2016 - 10:26 am", "content": "Hi, I'm trying the same thing from within python 3  but clearing data from a channel does not work. Has it worked in the past ?Dirk", "num_user_post": " 2", "author": "dirkdm"}, {"date": "April 18, 2016 - 12:36 pm", "content": "Have you tried POST?", "num_user_post": " 402", "author": "Hans"}, {"date": "April 20, 2016 - 8:15 am", "content": "When I use DELETE, I get Status: 302 Found, but the data is not cleared.When I use POST, I get Status: 401 Unauthorized.I'm using the USERAPIKEY in stead of the CHANNELAPIKEY as stated on https://nl.mathworks.com/help/thingspeak/clear-a-channel.htmlthanks,Dirk", "num_user_post": " 2", "author": "dirkdm"}, {"date": "May 16, 2016 - 7:36 am", "content": "I'm seeing the same as dirkdm, anything involving DELETE methods fails on a private channel:Clearing a channel feed (standard): curl -i -X DELETE 'https://api.thingspeak.com/channels/12345/feeds?api_key=XXXXX results in a 302 Found and a redirection to https://api.thingspeak.com/loginClearing a channel feed (JSON): curl -i -X DELETE 'https://api.thingspeak.com/channels/12345/feeds.json?api_key=XXXXX results in a 401 UnauthorizedClearing a channel feed (XML): curl -i -X POSDELETE 'https://api.thingspeak.com/channels/12345/feeds.xml?api_key=XXXXX results in a 502 Bad GatewayDeleting a channel: curl -i -X DELETE https://api.thingspeak.com/channels/12345?api_key=XXXXX  results in a 302 Found and a redirection to https://api.thingspeak.com/loginAll basic troubleshooting (eg wrong key) passes; this is a private channel and GET work successfully when an API key is passed and other POSTs to update the data are fine.How does one officially 'report' all these issues with the API?", "num_user_post": " 1", "author": "davidjb"}, {"date": "June 16, 2016 - 2:54 pm", "content": "I have created a bug report on our side. Thanks for sharing.", "num_user_post": " 402", "author": "Hans"}, {"date": "June 16, 2016 - 3:00 pm", "content": "I took a look and noticed that you need to send the User Account API key, not the channel's key.http://www.mathworks.com/help/thingspeak/clear-a-channel.htmlapi_key (string) - User's API key. Note that this is different from a channel API key, and can be found in your Account details. (required).", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/cloud-data-missing-on-thingspeak-chart/", "posts": [{"date": "June 7, 2016 - 4:28 pm", "content": "Hello!I have a project that has been successfully collecting and posting data to the ThingSpeak website for the last month via this channel: https://thingspeak.com/channels/62784 . My system posts data on average once every 13 minutes. However, over the last few days, posted data has been omitted from the public graphs- usually in the afternoons. What's odd is that I can download the data and see that it is actually making it into the cloud, but it's just not showing up on the graph (?). This is a relatively recent development, and I have not changed anything in my graph settings to merit this . Here is an example of the data downloaded from ThingSpeak that is not shown on the graph for June 6:created_atentry_idfield1field2field3  2016-06-06 13:32:26 UTC599240680013:37:07graph suggest data is dropped past this point2016-06-06 13:44:36 UTC5993406800  2016-06-06 13:56:47 UTC5994407300  2016-06-06 14:08:58 UTC5995407900  2016-06-06 14:21:08 UTC5996409000  2016-06-06 14:33:18 UTC5997409500  2016-06-06 14:45:28 UTC5998410600  2016-06-06 14:57:39 UTC5999413400  2016-06-06 15:09:49 UTC6000417300  2016-06-06 15:21:59 UTC6001417300  2016-06-06 15:34:10 UTC6002417300  2016-06-06 15:46:20 UTC6003417300  2016-06-06 15:58:31 UTC6004417300  2016-06-06 16:10:41 UTC6005417300  2016-06-06 16:22:51 UTC6006417300  2016-06-06 16:35:01 UTC6007417300  2016-06-06 16:47:12 UTC6008417300  2016-06-06 16:59:22 UTC6009417300  2016-06-06 17:11:32 UTC6010417300  2016-06-06 17:23:42 UTC601141730017:11:37graph suggests data is picked up after this pointAny ideas or suggestions are greatly appreciated.", "num_user_post": " 2", "author": "biod101"}, {"date": "June 9, 2016 - 11:21 pm", "content": "Am noticing something similar but not sure if its the same exactlyAnd I think its taken me about 2 weeks to actually catch it in the act.AM using an MKR1000 and I thought it was the board that was pooched but I changed my debug output method and noticed it has sent some data on two occasions but that TS was reporting last connected (x) amount of time which was behind the sent data connection by an hour or so.Also seeing a very sluggish site too often not refreshing properly and wonder if that is linked somehow ?", "num_user_post": " 19", "author": "BSB"}, {"date": "June 14, 2016 - 11:11 pm", "content": "Thanks for the reply. Regarding:changed my debug output method and noticed it has sent some data on two occasions but that TS was reporting last connected (x) amount of time which was behind the sent data connection by an hour or so.Sometimes when I check the site, TS notes that the page was last updated hours ago. Then I refresh the browser, and everything is back to normal (updates a few minutes ago) (?)Anyway, I am able to download the full dataset, but this is odd. I may try another IOT site to see if it's related to the board, my code, or the site itself. The fact that I have the full dataset downloading makes me think it is something with the site itself not talking properly to the database. The data is there after all, and TS makes this so easy that it's kind of hard to break this as a user on the graphing side of things.", "num_user_post": " 2", "author": "biod101"}, {"date": "June 16, 2016 - 2:44 pm", "content": "The time on the ThingSpeak channel does not update automatically with new data. That is a feature that we have logged and will consider doing that in the future.", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/posted-data-missing-when-calling-the-script-through-cron/", "posts": [{"date": "June 11, 2016 - 12:25 am", "content": "Hi!I'm new here, but thoroughly stumped after a hours of fiddling... I'm using a python script to read out temperature sensors and then send that data to Thingspeak. I followed this tutorial to setup the communication to Thinkgspeak: http://www.instructables.com/id/Esay-IoT-Weather-Station-With-Multiple-Sensors/It worked well for a while, but recently it stopped. I did a data export from Thingspeak and found that there are date entries for each time my python script is called, but no data.Here comes the 'crazy' part: When I call the script from the command line, data is posted. If the script is called through a cron job, just the date is posted, no data. ??!? Anyone have an idea what's going on?Andrew", "num_user_post": " 1", "author": "jimidmb"}, {"date": "June 11, 2016 - 1:55 am", "content": "You are not alone.Different set up but I get a confirmed connection to the server and no errors on posting but the data doesn't seem to actually get into TS.TS itself seems slow to respond to channel changes too.I love how TS is so easy to work with but not seeing much by way of support or responses in the forums any more either.", "num_user_post": " 19", "author": "BSB"}, {"date": "June 11, 2016 - 2:26 am", "content": "When a script works from the command line but not from cron the problem is often due to different environment variables, particularly PATH.Try this exersize run this from the command lineenv >/tmp/cli_env And a similar command as a cron job (once is enough)* * * * *  env >/tmp/cron_envthen check out what is different between the two files", "num_user_post": " 271", "author": "rw950431"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/how-connect-arduino-with-iot-hub/", "posts": [{"date": "June 7, 2016 - 9:02 am", "content": "Hi Guys ,I'm started to work with internet of things recently, and try to walk a few steps with Iot Hub, someone here knows how connect a Arduino in a IOT platform?I wanna a practical lesson ou steps to do that, Thanks !", "num_user_post": " 2", "author": "felipefmendes"}, {"date": "June 7, 2016 - 9:18 am", "content": "I wanna connect a YUN with it , can I ? How ?", "num_user_post": " 2", "author": "felipefmendes"}, {"date": "June 9, 2016 - 3:13 am", "content": "Does the IoT Hub have an API or other documentation?   If you are using Yun its most likely possible to send data from the linux side via the internet although you may have to figure out the http calls yourself.", "num_user_post": " 271", "author": "rw950431"}]}]}