{"url": "https://community.thingspeak.com/forum/thingspeak-api/page-26/", "threads": [{"url": "https://community.thingspeak.com/forum/thingspeak-api/use-of-gzip-in-http-request/", "posts": [{"date": "August 25, 2015 - 9:53 am", "content": "HelloI would like to 'gzip' the content before sending it to Thingspeak server.I am already sending data using plain text like this:params = urllib.urlencode({'field1': MyField1,'field2': MyField2,'key':thingSpeakKey})headers = {'Content-type': 'application/x-www-form-urlencoded', 'Accept': 'text/plain'}conn = httplib.HTTPConnection('api.thingspeak.com')conn.request('POST', '/update', params, headers)Question: what do I need to do to compress the content?Will this work and will the server understand that request?params = urllib.urlencode({'field1': MyField1,'field2': MyField2,'key':thingSpeakKey})headers = {'Content-type': 'application/x-www-form-urlencoded', 'Accept-encoding': 'gzip'}conn = httplib.HTTPConnection('api.thingspeak.com')conn.request('POST', '/update', params, headers)Thanks for your help.WalterMy pub channel: https://thingspeak.com/channels/45572", "num_user_post": " 7", "author": "daturach"}, {"date": "August 29, 2015 - 11:03 am", "content": "Hi,We currently don't have a way to accept the compressed content, but we are internally discussing how to handle this and hope to have a solution in the future.  Akhila", "num_user_post": " 21", "author": "akhila"}, {"date": "November 24, 2015 - 2:52 pm", "content": "Hi, Gzip is currently enabled for ThingSpeak. ThanksAkhila", "num_user_post": " 21", "author": "akhila"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/update-channel-with-created_at/", "posts": [{"date": "December 19, 2014 - 10:17 am", "content": "Can I add entries asynchronous? After they happened? Can I use the 'created_at' field to set a entry in the past? According to the documentation https://thingspeak.com/docs/channels#update_feed that should be possible. But in what timezone must I send the data? And what about the format?", "num_user_post": " 4", "author": "powtac"}, {"date": "December 19, 2014 - 11:24 am", "content": "Seems to work!The problem was that date() with 'date.month' returns 0-11 (January = 0) and I didn't '+1' to match the correct date for created_at!", "num_user_post": " 4", "author": "powtac"}, {"date": "January 13, 2015 - 6:00 am", "content": "Hi everyoneI wonder that an entry update in the past also counts into the 16 second limit, correct? If I had a network outage for example several hours, is there a way to push all data to ThingSpeak once the network is available again? Otherwise I wonder how to get all these data in if everytime Ill push something I have to wait for another 16 seconds, while still new data is coming in. Any suggestions?", "num_user_post": " 1", "author": "71ag"}, {"date": "January 13, 2015 - 9:35 am", "content": "Hi,Yes any update counts towards the 15 second rate limit.  We are aware of this problem, and may add the ability to perform batch updates in the future via the API.lee", "num_user_post": " 457", "author": "lee"}, {"date": "November 19, 2015 - 11:51 pm", "content": "Help.The above does not work.http POST      &f1=hi    &created_at=2011-07-18T01:02:03Zcreates a record with todays date and time (now())  and not the above date.Advice?", "num_user_post": " 4", "author": "geetee"}, {"date": "November 20, 2015 - 10:12 am", "content": "Hi,That POST looks correct, are you encoding the values correctly?  You can also perform an update with GET and URL encode the timestamp.lee", "num_user_post": " 457", "author": "lee"}, {"date": "November 21, 2015 - 10:37 am", "content": "Well the docs list an invalid format for the date string.Can you send  me working code that updates the CREATED_AT correctly?I need to to a POST and not a GET.Thanks.", "num_user_post": " 4", "author": "geetee"}, {"date": "November 23, 2015 - 9:48 am", "content": "Hi,Here's an example of  the raw request payload from an update that works for me:api_key=XXXXXXXXXXXXXXX&field1=testing&created_at=2015-11-23T01%3A51%3A17ZThis created_at time corresponds to 2015-11-23T01:51:17Z .If you're not seeing your data, try setting the 'start' and 'end' dates in the request, since only the past 24 hours are shown by defaultlee", "num_user_post": " 457", "author": "lee"}, {"date": "November 23, 2015 - 5:35 pm", "content": "I need an example that works via post. not via get.Seems the bug is with a POST onlyThanks.", "num_user_post": " 4", "author": "geetee"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/rfe-minimum-for-feed-api/", "posts": [{"date": "November 19, 2015 - 12:09 pm", "content": "The API already has:sum=x (get sum of x minutes, valid values: 10, 15, 20, 30, 60, 240, 720, 1440)average=x (get average of x minutes, valid values: 10, 15, 20, 30, 60, 240, 720, 1440)median=x (get median of x minutes, valid values: 10, 15, 20, 30, 60, 240, 720, 1440)I'd love to also see:minimum=x (get minimum of x minutes, valid values: 10, 15, 20, 30, 60, 240, 720, 1440)maximum=x (get maximum of x minutes, valid values: 10, 15, 20, 30, 60, 240, 720, 1440)Any chance for this enhancement?  Obviously I could retrieve all points and do it myself, but the above would be extremely handy for my use case.Thanks,-Eric", "num_user_post": " 8", "author": "sandeen"}, {"date": "November 19, 2015 - 4:26 pm", "content": "Hi Eric,We already have min/max parameters that function differently from what you're suggesting, so we're unlikely to add 'minimum' and 'maximum' as parameters in this way since it would create some confusion.  I would suggest looking into the MATLAB analysis app to modify your raw data stream and write out the results to a new channel, that way you can leverage ThingSpeak to do the conversion rather than performing it yourself after you've retrieved the data.lee", "num_user_post": " 457", "author": "lee"}, {"date": "November 19, 2015 - 5:37 pm", "content": "Thanks, yes, I saw the other min/max parameters with a different meaning, and had considered that it might cause confusion - on the other hand, not offering the functionality due to mere semantics is unfortunate.  😉But sure, I can just create a new stream I suppose - that makes sense.Thanks for the suggestion!-Eric", "num_user_post": " 8", "author": "sandeen"}, {"date": "November 19, 2015 - 6:56 pm", "content": "Now I'm stuck.  Trying something like this:[Watts, timeStamp] = thingSpeakRead(readChannelID, 'numMinutes', 1440, 'Readkey', readAPIKey);[minWatts, minWattsIndex] = min(Watts);timeMinWatts = timeStamp(minWattsIndex);so far so good, I have minimum for each field over the past 24h, and a timestamp for each.  But now I'd like to update each field in the new channel with the value and the timestamp.This doesn't work, because apparently the timestamp is for the whole vector: thingSpeakWrite(writeChannelID, minWatts, 'timestamp', timeMinWatts, 'Writekey', writeAPIKey);and I can't loop, because there's a 15 second delay between writes, and I can't delay 15s and carry on because then the whole thing times out.Is there some format in which I can update i.e. 8 fields with 8 values and 8 different timestamps in 1 thingSpeakWrite call?", "num_user_post": " 8", "author": "sandeen"}, {"date": "November 20, 2015 - 11:06 am", "content": "Hi,You can perform batch updates via thingSpeakWrite (we'll update the documentation on that in our next release).You'll have to perform some data formatting – get the data and time vectors into this format:dataVector =[Value_field1, NaN, NaN, …;NaN, Value_field2, Nan,…;::NaN, ….., NaN, Value_field8]timeVector =[time_field1;time_field2;time_field3;::Time_field8]Then call:thingSpeakWrite(channelID, dataVector, ‘timestamps’, timeVector, ‘writeKey’, writeAPIKey)Here is a MATLAB Code snippet illustrating this:[data, time] = thingSpeakRead(12397)dataVec = NaN(8,8);n = size(dataVec,1);dataVec(1:(n+1):end) = datatimeVec = repmat(time, n, 1);thingSpeakWrite(channelID, dataVec, 'timestamps', timeVec, 'writeKey', writeAPIKey)", "num_user_post": " 457", "author": "lee"}, {"date": "November 20, 2015 - 11:37 am", "content": "Perfect, thanks.  I had started with a matrix of zeros(), but I didn't actually want the zeros as datapoints.I definitely need to brush up on my Matlab but that looks like what I wasn't quite smart enough to do.  😉Thanks again!-Eric", "num_user_post": " 8", "author": "sandeen"}, {"date": "November 20, 2015 - 12:31 pm", "content": "For posterity, this is the core of what I did for my use case:% Get all datapoint for all fields for past 24h[Watts, timeStamps] = thingSpeakRead(readChannelID, 'numMinutes', 1440, 'Readkey', readAPIKey);% Find the minimum wattage for each field[minWatts, minWattsIndex] = min(Watts);% Choose the timestamps at which the minimum wattage was measuredtimeMinWatts = timeStamps(minWattsIndex);% Make a matrix of NaN so the updates happen only for set values (n fields in use)n = numel(minWatts);M = NaN(n,n);% Set the minimum values (on the diagonal)M(1:(n+1):end) = minWatts;thingSpeakWrite(writeChannelID, M, 'timestamps', timeMinWatts, 'Writekey', writeAPIKey);", "num_user_post": " 8", "author": "sandeen"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/do-multiple-devices-require-multiple-channels/", "posts": [{"date": "November 12, 2015 - 6:12 pm", "content": "Hello,I have a dozen devices sending in temperature readings from various locations every 30 minutes.  I had setup one channel to log this information from all devices but I am finding that the when devices post their update to ThingSpeak, sometimes these updates occur at the same time and only one of the updates is logged.  I assume this has to do with the 15 second rate limit on ThingSpeak.  I was thinking I would need some sort of synchronization between devices to ensure they don't send updates within 15 seconds of each other...however, this is proving a bit difficult.  To overcome this problem, perhaps I should create 12 different channels, one per device?  But before I do this, does ThinkSpeak limit the update rate to 15 seconds per channel or per IP address of the sender?  Or do you know of a better option to make this work with only the one channel?  Thanks!", "num_user_post": " 4", "author": "moballa"}, {"date": "November 15, 2015 - 6:34 am", "content": "AFAIK the rate limit is per-channel, not per account.  you should be able to test it easily but loading the API URL's in a couple of browser tabs and refreshing them both together.The only other way would be to have some kind of central collector service that takes the sensor readings then makes a single update to thingspeak.", "num_user_post": " 271", "author": "rw950431"}, {"date": "November 16, 2015 - 8:41 am", "content": "'ThinkSpeak limit the update rate to 15 seconds per channel or per IP address of the sender?'rw950431 is correctly. The rate limit only applies to individual Channels. Please see the following documentation section:https://thingspeak.com/docs/channels#rate_limits", "num_user_post": " 4", "author": "hans"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/get-last-entry-in-a-channel-feed-add-information-in-response/", "posts": [{"date": "October 26, 2015 - 10:56 am", "content": "Hi, I have thingspeak on my own server. I need to add some additional informations in response for GET request (Get Last Entry in a Channel Feed). Can someone from admins navigate me, in which class  I can  find this function,which is dealing with it ? thanks", "num_user_post": " 5", "author": "morten"}, {"date": "October 26, 2015 - 1:58 pm", "content": "Hi,You should be able to find the relevant code here: https://github.com/iobridge/thingspeak/blob/master/app/controllers/feed_controller.rb#L178-L183 .lee", "num_user_post": " 457", "author": "lee"}, {"date": "November 10, 2015 - 3:57 pm", "content": "Thanks for reply.   I checked code.  I need to add channel id into json response.So in JSON string I get   last channel's feeds and channel_id. How can I do it ? morten.", "num_user_post": " 5", "author": "morten"}, {"date": "November 11, 2015 - 9:41 am", "content": "morten,The following lines of  ThingSpeak source code are responsible for providing a response for a request made in a given format. For example, if the request was made as xml, the response on line 227 is returned. Note that all of the response formats render the variable 'output'. Any custom modifications to the response would involve adding data to the 'output' variable.https://github.com/iobridge/thingspeak/blob/master/app/controllers/feed_controller.rb#L223-L230", "num_user_post": " 4", "author": "hans"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/select-only-a-field-value/", "posts": [{"date": "November 9, 2015 - 12:33 pm", "content": "Hello.Is there any way to get only a value in a field in a csv http request?.When you call a csv http url,you get:created_id,entry_id,field1,field22015-10-22 19:30:00,14878,18,5,what i am trying to get is only the value in field2:5without headers.Thanks.", "num_user_post": " 7", "author": "patricio_74_"}, {"date": "November 9, 2015 - 9:50 pm", "content": "According to https://thingspeak.com/docs/channels#get_fieldthis should extract just a single valuehttps://api.thingspeak.com/channels/9/fields/1/last", "num_user_post": " 271", "author": "rw950431"}, {"date": "November 10, 2015 - 5:18 am", "content": "Thanks for your reply.Such is almost what i was looking but adding a period not working:https://thingspeak.com/channels/(channel_id)/fields/field2/last?key=***&start=2015-11-02%2020:48:42&end=2015-11-02%2020:48:42,the result in this case is 18 and it must be 14.", "num_user_post": " 7", "author": "patricio_74_"}, {"date": "November 10, 2015 - 9:23 am", "content": "patricio_74_ said Thanks for your reply.Such is almost what i was looking but adding a period not working:https://thingspeak.com/channels/(channel_id)/fields/field2/last?key=***&start=2015-11-02%2020:48:42&end=2015-11-02%2020:48:42,the result in this case is 18 and it must be 14.patricio_74_,Note the example from the linked documentation page (https://thingspeak.com/docs/channels#get_field)Example GET:GET https://api.thingspeak.com/channels/9/fields/1?results=2try doing the following:1. adding 'api.' before 'thingspeak.com'2. replacing 'field2' with the actual field number '2'3. replacing '/last?' with just just '?'4. replace '(channel_id)' with the actual channel id number '1234' for example5. replace 'key=***' with 'api_key=API_KEY' (if the channel is private)from:https://thingspeak.com/channels/(channel_id)/fields/field2/last?key=***&start=2015-11-02%2020:48:42&end=2015-11-02%2020:48:42to:https://api.thingspeak.com/channels/CHANNEL_ID/fields/2?api_key=API_KEY&start=2015-11-02%2020:48:42&end=2015-11-02%2020:48:42", "num_user_post": " 4", "author": "hans"}, {"date": "November 10, 2015 - 12:46 pm", "content": "Thanks for your reply. I have tried your changes. It give me :{'channel':{'id':***,'name':'TPl','description':'cont','field1':'N','field2':'sum','field3':'dif','created_at':'2014-08-01T14:24:17Z','updated_at':'2015-11-06T18:14:10Z','last_entry_id':1049712},'feeds':[{'created_at':'2015-11-02T20:48:42Z','entry_id':1049709,'field2':'14'}]}, if i add 'last' before api_key then the result is the last of all values not for the selected period.", "num_user_post": " 7", "author": "patricio_74_"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/arduino-update-to-thingspeak-is-stalling-after-sometime-arnd-4hrs/", "posts": [{"date": "October 29, 2015 - 6:03 am", "content": "Hi AllI am facing a weird issue with Arduino and Thingspeak. My setup is as follows:I am using a Arduino Mega 2560 with a SIM900 based GPRS module connected over serial port (Software Serial).The module is able to connect to Thingspeak server and is able to update the channel every two minutes. I have two channelsand for now I am posting only randoms numbers between 0 - 500. After around 4 hours of continuous update to channel,the communication with the Thingspeak stalls. I do not see new values being updated on my channel. I ran the testfor twice or thrice and found this value of 4hrs. I have also checked whether the communication between SIM900 and Arduino stops, but it is not so.I have wrote a simple program (within the above program) to send me a SMS if i give a miss call to the GSM module.So this works even after updating stalls.Does Thingspeak has any such limitation?? Any suggestions hints will help.ThanksAmey", "num_user_post": " 4", "author": "Amey"}, {"date": "October 29, 2015 - 11:16 pm", "content": "No such limitation on Thingspeak.   I would guess that your program is leaking memory somewhere.   You could try some things like1. Increase your update frequency to 1 min- if updates cease in 2 hours instead of 4 then its likely to be leaking memory.2.  Unfortunately thingspeak doesnt have a way of looking at incoming requests so you could try posting your data to a service like http://requestb.in/ instead in order to view whats being sent.3. Are you sure its not just thingspeak web interface weirdness?   Did you try restarting your browser after the updates stop?", "num_user_post": " 271", "author": "rw950431"}, {"date": "October 29, 2015 - 11:18 pm", "content": "Hi AmeyI had similar issues with ethernet shields and Arduinos but my time periods were about two hours.My first fix was a power supply (an old cell phone charger) that would reach thermal overload almost like clockwork.After replacing that my results were a bit more consistent but still failing after about 2 hrs.A more permanent fix for me was to watch the serial output and make sure it was sending out the correct messages and getting the correct responses.  That was sort of my clue as it tended to stop even earlier with all the debug enabled.In my cases it simply stopped sending out any data but was still trying to connect and I combed my program looking for some simple error.It took me a while but I traced it down to delay statements and serial print statements causing a timing issue.Still not 100% sure just what it was as I did a blanket remark '//' on almost all the print statements apart from one that reads thingspeak responses 1 character at a timeI also reduced some of the delay statements or even remarked them out too where they were not actually required. The millis statements are not always as accurate as I would expect and to that aim I have some RTC's on order to add in to my setups.One of my channels ( 60110) has run pretty much perfect since then and any data anomalies I see are almost always ones I caused by testing with such as lighters on my temprature probes and lighter gas on my gas sensor etc.Just  brought another channel online  (62674) that is also pretty stable. as I learned a lot of lessons. I even have my reconnect time down to about 8 seconds because it always takes more than the 15/16 seconds they recommend just for my stuff to get the readings before it posts them.Maybe post your code to see if anyone can spot something obvious.Hopefully you are better than me at keeping you live code separate from the rest of the Arduino sketches.P.S. you may want to move this to the Arduino sectionSample of my ethernet responses FROM thingspeak below copied from coolterm--------------------------------------------------Connecting Arduino to network...Arduino connected to network using DHCPConnecting to ThingSpeak...HTTP/1.1 200 OKContent-Type: text/html; charset=utf-8Transfer-Encoding: chunkedConnection: closeStatus: 200 OKX-Frame-Options: ALLOWALLAccess-Control-Allow-Origin: *Access-Control-Allow-Methods: GET, POST, PUT, OPTIONS, DELETE, PATCHAccess-Control-Allow-Headers: origin, content-type, X-Requested-WithAccess-Control-Max-Age: 1800ETag: '470e7a4f017a5476afb7eeb3f8b96f9b'Cache-Control: max-age=0, private, must-revalidateSet-Cookie: request_method=POST; path=/X-Request-Id: d90b6677-2f88-447c-8cee-8cba4a8c8081X-Runtime: 0.017518X-Powered-By: Phusion Passenger 4.0.57Date: Fri, 30 Oct 2015 02:52:40 GMTServer: nginx/1.9.3 + Phusion Passenger 4.0.5737570--------------------------------------------------", "num_user_post": " 19", "author": "BSB"}, {"date": "October 30, 2015 - 4:36 am", "content": "Hi GuysThanks for reply.@rw950431:1. Increase your update frequency to 1 min- if updates cease in 2 hours instead of 4 then its likely to be leaking memory.--> Tried this. Even at update rate of 1 min interval, the Thingspeak update stalls after 4 hours.2. Unfortunately Thingspeak doesn't have a way of looking at incoming requests so you could try posting your data to a service like http://requestb.in/ instead in order to view whats being sent.--> Will try out this.3. Are you sure its not just thingspeak web interface weirdness? Did you try restarting your browser after the updates stop?-->Yes. I refreshed the page and even logged out and logged in again. I downloaded the data and observed the CSV file. Its showingthe same issue. around 4 hours stalling period.@BSB:I am using a 12V 2A power supply. So doesn't look like power issue. Plus i have commented all the serial output code.I use a #ifdef statement to enable disable serial debugging.I am using the GPRS library from http://www.gsmlib.org/ website v307. I wil try to post my code soon.RegardsAmey", "num_user_post": " 4", "author": "Amey"}, {"date": "October 30, 2015 - 11:23 am", "content": "Although unusual in Arduinos strings can cause memory leaks as pointed out by RW.Took a peak at the libs you use...more so the examples and they look like they could be string intensive. but without seeing code its a little hard to tell. May also depend on board you are using too and the sensors involved. If you can clear a string (or its buffer / array) after it has done its job that may help.For every file you open in your sketch be it string or otherwise for input or output you need to close it somewhere too.Make sure you have corresponding statements if you use that approach.As for connect time mine is currently set for every 3 seconds in the connection timer but it works out at 3 minutes in real time using a 2560 or almost 5 minutes using a leonardo.Some sensors have warmup times that can throw things off  as I found out with an MQ2 and a PIR. If you use anything that has a start / read delay try move that up before your main loop or treat it as a separate routine/loop.", "num_user_post": " 19", "author": "BSB"}, {"date": "October 30, 2015 - 1:54 pm", "content": "Are you using the ThingSpeak Connectivity library for Arduino?  We've done a lot of testing to make sure that is stays stable and up for long periods.  Learn more:http://community.thingspeak.com/2015/10/official-thingspeak-library-for-arduino-and-particle/", "num_user_post": " 47", "author": "Rob Purser"}, {"date": "November 4, 2015 - 12:22 am", "content": "How did you get on ?Just if anyone else has similar issues its nice to get an idea of the various fixes.", "num_user_post": " 19", "author": "BSB"}, {"date": "November 6, 2015 - 5:45 am", "content": "Hi@BSB:I tried setting the update interval to one entry every 1 min, 2min and even 15min. It always get stalled after 4hrs of logging. So right now i am checking the GSM code if there is any timer or something.I have stripped down the sketch (hoping to reduce memory consumption). I have just kept the bare minimum part in code wherein the Arduino connects to network using GPRS and log data on Thingspeak server. I still get same issue of stalling after 4 hours.ThanksAmey", "num_user_post": " 4", "author": "Amey"}, {"date": "November 6, 2015 - 11:10 pm", "content": "Do you have another Arduino to swap it out Amey ?And is it a copy / clone / or a real Arduino ?Asking because I have suddenly got two 'true' arduinos (Leonardo and a UNO) that don't play nice anymore but all my clones work perfect ?@#$Have the cause of my issues down to three possible causes1. Updated Java a few days ago2. New release of Arduino IDE 1.6.63. Updated Avast antivirusPossible 4th cause is that the newer clones use the 340 USB chipset as opposed to the real ones that the manufacturer has seemingly started to brick / semi brick some chipsets but that's speculation.I can program one of my Chinese  clone Leonardo's but once the sketch is up it seems to stall on serial outputs after a while.", "num_user_post": " 19", "author": "BSB"}, {"date": "November 9, 2015 - 4:47 am", "content": "Hi BSBI will try out swapping Arduino as suggested. Today.. I replaced the httpPOST request by httpGET request. Same issue.. stalling after 4 hours update.I am using a Arduino Mega 2560 clone (its a low cost version I guess) and a SIM900 (chip by SIMcomm) module.I am using arduino-1.0.5-r2 IDE. After programming I disconnect the USB cable from Laptop. It runs on it own witha separate 12V,2A SMPS power supply. So I guess no PC interference.ThanksAmey", "num_user_post": " 4", "author": "Amey"}, {"date": "November 10, 2015 - 1:59 am", "content": "Hey there AmeyOnly thing we have in common is the clone.Do you know if its the 340 usb chipset or an FTDI clone (small chip just behind the USb connector)I have a picture of the differences but cant post it as an attachment on this limited forum.  ", "num_user_post": " 19", "author": "BSB"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/get-timestamp-from-thingspeak/", "posts": [{"date": "November 6, 2015 - 12:09 pm", "content": "Hey There! My project needs a timestamp (something needs to be turned on at a specific time) and I was wondering if there was a way to take the time from Thingspeak. The code I'm currently using reads some lines from Thingspeak and one of the lines is the date and time and I wanted to know if there was a way to take specific line out.So the format is Fri, 06 Nov 2015 HH:MM:SS GMTI need to have the program on from 5pm to 2am. Is there a way I can break the line up so I can just use the hour?Is there an easier way to do this??Thanks a ton!!", "num_user_post": " 9", "author": "abhishekjacob21"}, {"date": "November 7, 2015 - 12:45 am", "content": "What platform/language are you using?   If you split the line up into words based on spaces , get the 5th word, split that word on : then you have hours, minutes & seconds.  You may have to handle timezone conversions yourself, tricky if you have daylight savings.The exact means of doing this depends on which language you use.", "num_user_post": " 271", "author": "rw950431"}, {"date": "November 8, 2015 - 6:22 pm", "content": "I'm using the Arduino IDE platform", "num_user_post": " 9", "author": "abhishekjacob21"}, {"date": "November 8, 2015 - 9:39 pm", "content": "Perhaps this will help : https://arduino.stackexchange.com/questions/1013/how-do-i-split-an-incoming-string", "num_user_post": " 271", "author": "rw950431"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/updating-multiple-series-in-a-chart/", "posts": [{"date": "November 1, 2015 - 1:21 pm", "content": "I have a created a chart with multiple series and it works fine reading my different temperature sensors. Only problem I have is having it update on its own without having to hit the refresh button like the other charts do. Is there something I have to change in the code to have it update real time?Thanks ", "num_user_post": " 4", "author": "npatel023"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/http-post-using-gsm-module/", "posts": [{"date": "October 26, 2015 - 10:56 am", "content": "Hi All ! I try to post data to the cloud using a GSM module (Telit865 Quad V3) and AT commands.When is send the data with Content-Type: application/x-www-form-urlencoded, I get a nice '400 bad request' from the server :  AT#SSLEN=1,0OKAT#SSLEN=1,1OKAT#SSLCFG=1,1,1000,90,100,50,0,0,0,0OKAT#SSLSECCFG=1,0,1OKAT#SSLSECDATA=1,1,1,1382>-----BEGIN CERTIFICATE-----MIIDxTCCAq2gAwIBAgIQAqxcJmoLQJuPC3nyrkYldzANBgkqhkiG9w0BAQUFADBsMQswCQYDVQQGEwJVUzEVMBMGA1UEChMMRGlnaUNlcnQgSW5jMRkwFwYDVQQLExB3d3cuZGlnaWNlcnQuY29tMSswKQYDVQQDEyJEaWdpQ2VydCBIaWdoIEFzc3VyYW5jZSBFViBSb290IENBMB4XDTA2MTExMDAwMDAwMFoXDTMxMTExMDAwMDAwMFowbDELMAkGA1UEBhMCVVMxFTATBgNVBAoTDERpZ2lDZXJ0IEluYzEZMBcGA1UECxMQd3d3LmRpZ2ljZXJ0LmNvbTErMCkGA1UEAxMiRGlnaUNlcnQgSGlnaCBBc3N1cmFuY2UgRVYgUm9vdCBDQTCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBAMbM5XPm+9S75S0tMqbf5YE/yc0lSbZxKsPVlDRnogocsF9ppkCxxLeyj9CYpKlBWTrT3JTWPNt0OKRKzE0lgvdKpVMSOO7zSW1xkX5jtqumX8OkhPhPYlG++MXs2ziS4wblCJEMxChBVfvLWokVfnHoNb9Ncgk9vjo4UFt3MRuNs8ckRZqnrG0AFFoEt7oT61EKmEFBIk5lYYeBQVCmeVyJ3hlKV9Uu5l0cUyx+mM0aBhakaHPQNAQTXKFx01p8VdteZOE3hzBWBOURtCmAEvF5OYiiAhF8J2a3iLd48soKqDirCmTCv2ZdlYTBoSUeh10aUAsgEsxBu24LUTi4S8sCAwEAAaNjMGEwDgYDVR0PAQH/BAQDAgGGMA8GA1UdEwEB/wQFMAMBAf8wHQYDVR0OBBYEFLE+w2kD+L9HAdSYJhoIAu9jZCvDMB8GA1UdIwQYMBaAFLE+w2kD+L9HAdSYJhoIAu9jZCvDMA0GCSqGSIb3DQEBBQUAA4IBAQAcGgaX3NecnzyIZgYIVyHbIUf4KmeqvxgydkAQV8GK83rZEWWONfqe/EW1ntlMMUu4kehDLI6zeM7b41N5cdblIZQB2lWHmiRk9opmzN6cN82oNLFpmyPInngiK3BD41VHMWEZ71jFhS9OMPagMRYjyOfiZRYzy78aG6A9+MpeizGLYAiJLQwGXFK3xPkKmNEVX58Svnw2Yzi9RKR/5CYrCsSXaQ3pjOLAEFe4yHYSkVXySGnYvCoCWw9E1CAx2/S6cCZdkGCevEsXCS+0yx5DaMkHJ8HSXPfqIbloEpw8nL+e/IBcm2PN7EeqJSdnoDfzAIJ9VNep+OkuE6N36B9K-----END CERTIFICATE-----OKAT#SSLD=1,443,'api.thingspeak.com',0,0CONNECTPOST /update HTTP/1.1Host: api.thingspeak.comUser-Agent: curl/7.45.0Accept: */*Content-Length: 64Content-Type: application/x-www-form-urlencodedkey=MyKey&field1=1&field2=100&field3=$230&field4=0.70HTTP/1.1 400 Bad RequestContent-Type: text/html; charset=utf-8Transfer-Encoding: chunkedX-Cnection: closeStatus: 400 Bad RequestX-Frame-Options: ALLOWALLAccess-Control-Allow-Origin: *Access-Control-Allow-Methods: GET, POST, PUT, OPTIONS, DELETE, PATCHAccess-Control-Allow-Headers: origin, content-type, X-Requested-WithAccess-Control-Max-Age: 1800Cache-Control: no-cache[...]Any idea why this happens ?  Thank you.", "num_user_post": " 2", "author": "pierrelc"}, {"date": "October 26, 2015 - 11:44 am", "content": "Ok it's working now : POST /update HTTP/1.1Host: api.thingspeak.comUser-Agent: curl/7.45.0Accept: */*Content-Length: 64Content-Type: application/x-www-form-urlencodedkey=MyKey&field1=1&field2=100&field3=$230&field4=0.70HTTP/1.1 200 OKContent-Type: text/html; charset=utf-8Transfer-Encoding: chunkedX-Cnection: closeStatus: 200 OKX-Frame-Options: ALLOWALLAccess-Control-Allow-Origin: *Access-Control-Allow-Methods: GET, POST, PUT, OPTIONS, DELETE, PATCHAccess-Control-Allow-Headers: origin, content-type, X-Requested-WithAccess-Control-Max-Age: 1800ETag: 'f74909ace68e51891440e4da0b65a70c'There was 3 ''  after the 'Content-Type: application/x-www-form-urlencoded'. The right syntax is only two ''. Regards, Pierre", "num_user_post": " 2", "author": "pierrelc"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/how-to-use-daterange-in-thingspeakread-api/", "posts": [{"date": "October 25, 2015 - 1:31 am", "content": "Hi Community,I tried to find the proper way to use daterange in ThingspeakRead API. For example, how can I use ThingspeakRead API to get data from2015/9/25 - 04:00:00  to 2015/9/25 - 04:30:00 daterange?I tried the following syntax in Matlab code, but it seems like not working. Does anybody have some comments about my question? Really appreciate the help from community.[data, time1] = thingSpeakRead(readChannelID1, 'Fields', 1, 'ReadKey', 'SomeKey', 'DateRange',[datetime('Sep 25, 2014 04:00:00'),datetime('Sep 25, 2014 04:30:00')]);Thanks.Jimmyjiangyq", "num_user_post": " 5", "author": "jimmyjiangyq"}, {"date": "October 25, 2015 - 7:58 pm", "content": "I suspect that you might need to format datetime in the thingspeak API format eg(From https://thingspeak.com/docs/channels#get_feed)start (datetime) Start date in format YYYY-MM-DD%20HH:NN:SS (optional)end (datetime) End date in format YYYY-MM-DD%20HH:NN:SS (optional)Let us know if that works..", "num_user_post": " 271", "author": "rw950431"}, {"date": "October 26, 2015 - 9:12 am", "content": "Hi Jimmyjiangyq,Check out the MATLAB documentation for datetime -- there are a lot of options:http://www.mathworks.com/help/matlab/ref/datetime.htmlBy default, the function expects strings to be in the format YYYY-mm-dd hh:MM:ss >> datetime('2015-10-26 09:10:00') ans =     26-Oct-2015 09:10:00 >>", "num_user_post": " 47", "author": "Rob Purser"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/what-is-the-maximum-number-of-data-that-i-can-retrieve-from-single-get-http-request-1/", "posts": [{"date": "October 17, 2015 - 11:50 am", "content": "I am adding an entry into my channel for every 15 minutes, and I have been doing this since a year.I want to retrieve for the last six months data i.e. around 20000 entries in a single GET request, but I am getting only for the last 2 months data.Is this a limitation set ?", "num_user_post": " 5", "author": "cherry"}, {"date": "October 18, 2015 - 7:26 pm", "content": "From https://thingspeak.com/docs/channels#rate_limits   results (integer) Number of entries to retrieve, 8000 max, default of 100 (optional)S0 you will need to break you request into at least 3 chunks in order to retrieve 20000 points.", "num_user_post": " 271", "author": "rw950431"}, {"date": "October 24, 2015 - 2:57 am", "content": "Thanks a lot for the reply.", "num_user_post": " 5", "author": "cherry"}]}]}