{"url": "https://community.thingspeak.com/forum/thingspeak-apps/page-12/", "threads": [{"url": "https://community.thingspeak.com/forum/thingspeak-apps/react-too-similar-wtf/", "posts": [{"date": "November 20, 2015 - 3:02 pm", "content": "Got this error : 'You have a React with similar Test Frequency, Action, and Option settings. Delete that React to save this one.'Channel is different. Test criteria is different. Action Matlab script is different.So when does Thingspeak consider the reacts to be too similar?", "num_user_post": " 3", "author": "Ulvis"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/multiple-react-apps-similar-triggers/", "posts": [{"date": "October 15, 2015 - 7:45 am", "content": "I've got a number of different channels with fields updating anywhere from once every 30 seconds to a few times/day.  I've created Matlab apps that do some basic math on a few of those fields and write new values to other channels.In an effort to not be wasteful with resources, I had tried to set up multiple React triggers that would  only launch the Matlab apps when specific fields were updated.  Each field has a maximum rate of 1/minute but they could also see hours or days between updates.  The problem is I couldn't save the 2nd React because the trigger was 'too similar' to the first one (though different channel/field entirely).  I could create just the one React but then I'd have to trigger it on the most frequently updated field (every 30-60 seconds, 24/7).Just wondering if I've missed something or if anybody has any suggestions?Thanks,Brad", "num_user_post": " 9", "author": "AYAduino"}, {"date": "November 20, 2015 - 2:41 pm", "content": "Same problem here.", "num_user_post": " 3", "author": "Ulvis"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/update-the-react-app-through-talkback-app/", "posts": [{"date": "November 19, 2015 - 2:38 am", "content": "Is it possible to change the condition in the React app through smartphone application by using the Talkback app? If possible, can anyone give some suggestion on how to do it? Thanks in advance", "num_user_post": " 1", "author": "shironawa"}, {"date": "November 19, 2015 - 9:47 am", "content": "Hi,Unfortunately this is not possible, the React app's condition can only be changed via the website.lee", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/parsing-data-from-tweetcontrol/", "posts": [{"date": "November 11, 2015 - 5:59 pm", "content": "I tried the tutorial from TweetControl and ThingHTTP using api_key=THINGSPEAK_WRITE_KEY&field1=%%trigger%%&status=%%status%%. However this doesn't seem to write the data into a field in my channel. It writes instead to a 'Channel Status Update' field. I want to parse the tweet and discard the words leaving only numbers. Anyone got any idea how to do it? I can't seem to be able to get the data using MATHLAB analysisMy channel : https://thingspeak.com/channels/65186Thanks", "num_user_post": " 1", "author": "bobthesheep"}, {"date": "November 12, 2015 - 9:24 am", "content": "bobthesheep,'I can't seem to be able to get the data using MATHLAB analysis'Can you please clarify what you are trying to do using the MATLAB Analysis app?'I tried the tutorial from TweetControl and ThingHTTP using api_key=THINGSPEAK_WRITE_KEY&field1=%%trigger%%&status=%%status%%. However this doesn't seem to write the data into a field in my channel. It writes instead to a 'Channel Status Update' field.'I first want to make sure I understand what you are trying to achieve. It sounds like you want to do the following:1. Listen to twitter for a specific tweet to occur. The tweet will contain some unknown value and the known trigger.2. You want to be able to find the unknown value in the tweet and extract the unknown value3. Once the unknown value is extracted from the tweet, you want to write the unknown value to a specific Channel Field.If I understood the intention correctly, it is possible to do something similar in a slightly different way. TweetControl is currently limited to only triggering ThingHTTP requests when a tweet matches a trigger condition. TweetControl can 'pass' values to ThingHTTP via 'substitution keys' in a ThingHTTP request.Currently, TweetControl nor ThingHTTP cannot parse or alter the substitution values. Given the example scenario above, it is currently not possible, for TweetControl to modify the substitution values prior to passing the values to ThingHTTP. Likewise, it is not currently possible for ThingHTTP to alter or modify substitution values once the have been provided to ThingHTTP. This does not mean it is not possible to accomplish the same end objective within the given framework. It is possible to create a TweetControl to listen for a specific trigger value. The entire tweet may be 'written' to a Channel using ThingHTTP. Once the full tweet is in a Channel, a React app may trigger a MATLAB Analysis app to execute whenever data is inserted to this 'intermediate' Channel. The MATLAB Analysis app would then read the last value written to the channel, parse the value that was written to that channel, perform a transformation, and write a new, transformed value, to a different channel.", "num_user_post": " 4", "author": "hans"}, {"date": "November 18, 2015 - 4:49 pm", "content": "I did what you ask for the https://thingspeak.com/channels/66116 channel.I could not get the tweet in to a channel using Thingspeak (probably not doing it right...) so I used Zapier for this.After that a REACT trigger a MATLAB script which parses the text and writes the desired values to a destination channel.A typical tweet (variable text): 'Prisoppdatering: Bensin 95: 13,48 Diesel: 12,48 #St1Vestby  2015-11-18 09:21:18'.Script below. Full of scrap - but you get the idea.Script: (just replace the zzzz, xxxxx , yyyyy below)%--------------------------------------------------------------% TODO - Replace the [] with channel ID to read data from:readChannelID = zzzzzzzzzzzzzz;% TODO - Enter the Read API Key between the '' below:readAPIKey = 'xxxxxxxxxxxxxxxx';% TODO - Replace the [] with channel ID to write data to:writeChannelID = 66116;% TODO - Enter the Write API Key between the '' below:writeAPIKey = 'yyyyyyyyyyyyyyy';%% Read Data %%%data = thingSpeakRead(readChannelID, 'ReadKey', readAPIKey);%data = thingSpeakRead(readChannelID, 'ReadKey', readAPIKey);colors = thingSpeakRead(readChannelID, 'numDays', 1, 'outputFormat', 'table');[data,time] = thingSpeakRead(readChannelID, 'outputFormat', 'table');%k = strfind(data, 'Diesel')%% Analyze Data %%% Add code in this section to analyze data and store the result in the% analyzedData variable.analyzedData = colors.content;%display(analyzedData);%display(data.summary);%summary(data);erik = data.content(1);display(erik);%whos erik;ola = char(erik);%whos ola;ola = strrep(ola, ',', '.'); %replacing commadisplay(ola);%posDIESEL = strfind(ola, 'Diesel:')%posHASH = strfind(ola, '#')strDieselValueTxt_Ary = strsplit(ola,'Diesel:')%display(strDieselValueTxt_Ary{2});txtSecondPart = strtrim(char(strDieselValueTxt_Ary{2}));%display(txtSecondPart);%whos txtSecondPart;%posNEWLINE = strfind(txtSecondPart, '');%display(posNEWLINE);%strDieselPart = strfind(txtSecondPart,'#');txt_Ary2 = strsplit(txtSecondPart,'')txtDieselValue = txt_Ary2{1};%display(txtDieselValue);numDieselValue = str2num(txtDieselValue);%-------------------------% BENSIN%posBENSIN = strfind(ola, 'Bensin 95:');strBensinValueTxt_Ary = strsplit(ola,'Bensin 95:');%display(strBensinValueTxt_Ary{2});txtSecondPart = strtrim(char(strBensinValueTxt_Ary{2}));%display(txtSecondPart);txt_Ary2 = strsplit(txtSecondPart,'')txtBensinValue = txt_Ary2{1};display(txtBensinValue);numBensinValue = str2num(txtBensinValue);% WRITEdisplay(numBensinValue);display(numDieselValue);%% Write Data %%thingSpeakWrite(writeChannelID, [numDieselValue,numBensinValue], 'WriteKey', writeAPIKey);%=========================================", "num_user_post": " 3", "author": "Ulvis"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/timecontrol-stop-time/", "posts": [{"date": "November 3, 2015 - 11:32 pm", "content": "I would like to turn a light on at a specific time, which is trivial using TimeControl app (thanks for that), but i would also like it to turn off at a specific time... I 'could' make it send a single on command, then another to send an off command at a different time, but would like a little more in the way of error control/reliability.Ideally i would like to send the 'ON' command every 5 minutes starting at a certain time and then stop sending the 'ON' command either at a certain time or a way to set it up so it keeps sending the 'ON' command until it receives a confirmation that it was received successfully (though an http get/post). Any ideas on how to accomplish this with TimeControl or do the equivalent in any other manner would be appreciated.", "num_user_post": " 4", "author": "redWall22"}, {"date": "November 4, 2015 - 5:49 am", "content": "So i also went with the matlab analysis, first time ever using it so it's kinda cobbled together and probably really, really bad, but it does seam to work so far... Although i don't need/want to the whole 'data' part, it just kept throwing errors when i tried to only do 'webwrite(offCMD)' or 'webwrite(offCMD, options)'.onCMD = 'http://myAddy.com/lightON';offCMD = 'http://myAddy.com/lightOFF';onTime = '20:00' ;% 8 pmoffTime = '06:00';% 6 amdata = 42;data2 = 100;data = struct('api_key',data2,'field1',data);options = weboptions('MediaType','application/json');t = datetime('now','TimeZone','local','Format','HH:mm');light = thingSpeakRead(myChannel,'Fields',3,'ReadKey','myReadKey');  %get the most recent data from field3 ('light' 1=ON / 0=OFF)if t >= onTime && t <=  offTime         %if it's during the time the light should be off'off time'    if light == 1        % if its onresponse = webwrite(offCMD, data, options)        % turn it off    end% and notify me somehow(TBD, probably push notification through ifttt)else% the light should be on    'on time'    if light == 0% if its offresponse = webwrite(onCMD, data, options)% turn it on and notify me (device has probably reset)    endendif anyone knows how to improve this, like just sending 'webwrite(onCMD)', or can see any issues i might run into doing it this way then please let me know.", "num_user_post": " 4", "author": "redWall22"}, {"date": "November 4, 2015 - 6:03 am", "content": "What is it that you are trying to turn on/off?    Are you operating in push mode (that is thingspeak does a get/post to the device) or waiting for the device to poll (that is device does get/post to thingspeak)?  If the second case did you look at the talkback app?   Although the timecontrol -> talkback path seems to only support appending a command whereas you may be looking to update.For more complex logic you may have to try coding a Matlab analysis [ edit- looks like you already did ]", "num_user_post": " 271", "author": "rw950431"}, {"date": "November 4, 2015 - 6:20 am", "content": "rw950431 said For more complex logic you may have to try coding a Matlab analysis [ edit- looks like you already did ]Trying to anyway  ...i can't figure out how to edit my post right now but the (hopefully) corrected if statement is: if (t < onTime) && (t >=  offTime)", "num_user_post": " 4", "author": "redWall22"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/time-based-react/", "posts": [{"date": "October 30, 2015 - 10:38 pm", "content": "Hello,I would like to have a react based on my local time.The condition shall be something like thisIf time is between 9 pm and 6 am , check the Garage channel and notify based on channel value between this time. I don't care the value of the channel outside this time. I did not find any way to write such reach.", "num_user_post": " 8", "author": "rkgarg"}, {"date": "October 31, 2015 - 10:12 pm", "content": "Well, Never mind. I got it done through Matlab analysis. It is awesome.Thanks", "num_user_post": " 8", "author": "rkgarg"}, {"date": "November 4, 2015 - 1:38 am", "content": "Can you post your Matlab code? I am trying to do something similar and am having no luck.Edit: So i also went with the matlab analysis, first time ever using it so it's kinda cobbled together and probably really, really bad, but it does seam to work so far... Although i don't need/want to the whole 'data' part, it just kept throwing errors when i tried to only do 'webwrite(offCMD)' or 'webwrite(offCMD, options)'.onCMD = 'http://myAddy.com/lightON';offCMD = 'http://myAddy.com/lightOFF';onTime = '20:00' ;% 8 pmoffTime = '06:00';% 6 amdata = 42;data2 = 100;data = struct('api_key',data2,'field1',data);options = weboptions('MediaType','application/json');t = datetime('now','TimeZone','local','Format','HH:mm');light = thingSpeakRead(myChannel,'Fields',3,'ReadKey','myReadKey');  %get the most recent data from field3 ('light' 1=ON / 0=OFF)if t >= onTime && t <=  offTime         %if it's during the time the light should be off'off time'    if light == 1        % if its onresponse = webwrite(offCMD, data, options)        % turn it off    end% and notify me somehow(TBD, probably push notification through ifttt)else% the light should be on    'on time'    if light == 0% if its offresponse = webwrite(onCMD, data, options)% turn it on and notify me (device has probably reset)    endend", "num_user_post": " 4", "author": "redWall22"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/is-possible-to-tweet-with-image-using-thingtweet/", "posts": [{"date": "November 3, 2015 - 4:57 am", "content": "hi all,this is my first post from newbie..i have an idea to make project using Arduino and Web Cam/IP Cam.i want to monitor the traffic of street.every one hour i want to tweet the condition of traffic with image captured by camera.is possible to tweet with media (image) using ThingTweet or other Twitter app?thanks all", "num_user_post": " 1", "author": "wirog"}, {"date": "November 3, 2015 - 10:20 am", "content": "We do not support image sending via our ThingTweet app. You can send status update messages up to the normal Twitter character limit.Here's a blog post about a project using Raspberry Pi and MATLAB to do car counting.... http://community.thingspeak.com/2015/09/counting-cars-and-analyzing-traffic-with-thingspeak/Let us know if you need anything else.Have fun with your project,Hans", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/how-to-send-emoji-using-thingtweet/", "posts": [{"date": "November 1, 2015 - 7:39 am", "content": "UPDATE:The character i was trying to send was removed (&#55356;) by this forum post &Hi I'm working with thingTweet for one my projects, but I ran into an issue. The issue is that I can't send any emoji characters. The one I tried is: ' ' I know that twitter supports these characters.When I tried to send these characters they were removed and the text in the thingTweet  message that was after the  symbol was removed from the message entirely.So is there any workaround I could use to send these by using unicode codes?P.S I tried to send emoji in this form: &#55356; It was not converted", "num_user_post": " 2", "author": "hermes"}, {"date": "November 1, 2015 - 11:36 pm", "content": "Did you try to urlencode the emoji string? The form you quote probably contains characters which are illegal in a URL.", "num_user_post": " 271", "author": "rw950431"}, {"date": "November 2, 2015 - 11:00 am", "content": "I want to remind that I am using TimeControl + thingTweet in order to send emoji. I tried to send the URL encoded message on advice you gave me. Heres the message I sent:'emojo URL ENCODED DECIMAL: %26%2355356  URI: %F0%9F%8C%B1 JS escaped: uD83CuDF31'. On twitter i received exact same message: 'emojo URL ENCODED DECIMAL: %26%2355356  URI: %F0%9F%8C%B1 JS escaped: uD83CuDF31'", "num_user_post": " 2", "author": "hermes"}, {"date": "November 2, 2015 - 7:27 pm", "content": "So at least you know that the urlencoded version doesnt truncate the rest of the message..  I notice you appear to have omitted the trailing ; in your encoded version- not sure if that makes a difference or not.Perhaps the twitter emoji github https://github.com/twitter/twemoji might have some clues as to the format expected. Otherwise you may have to try and find another webservice that can post emoji to twitter and try to figure out how its encoded.", "num_user_post": " 271", "author": "rw950431"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/i-want-a-web-page-to-show-my-channels-data-in-nice-html-table/", "posts": [{"date": "October 30, 2015 - 7:31 pm", "content": "How can i see my datta from channel in a table format?", "num_user_post": " 4", "author": "geetee"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/parsing-data-from-the-url-in-matlab-analysis-and-visualizations/", "posts": [{"date": "October 5, 2015 - 11:52 pm", "content": "Hello All,I am collecting a small amount of data (50 records) from many (>100) moisture sensors and storing it all in one channel. This is working well.I then use one MATLAB Visualization to create a customised visualization about each sensor. As an example the first line of the MATLAB code is:SensorID = 'ID1234';    % change this Sensor ID value onlyThe problem is I need to manually change the SensorID in code to view the visualization for that sensor.QUESTION:Is there any way to include in the URL the sensor ID and then grab this in the MATLAB code?Example URL:https://thingspeak.com/apps/matlab_visualizations/26703?SensorID=ID7654   (or some other format)Code becomes:SensorID = GetURLdata('SensorID');This would make the MATLAB Analysis and Visualizations code far more flexible as it would allow inputs from the user via the URL.An external website could then embed multiple visualizations on page that all based on the same visualization code. I'm guessing this feature doesn't yet exist (I'd love to be proved wrong).Does anyone know of another way to provide inputs to the MATLAB code via the URL?I could modify data in another channel (eg. set the Sensor ID to be viewed) then check for it in the visualization  code but this is not a very scalable solution when multiple people view the visualization at the same time.Any ideas?Cheers,Matthew Driver", "num_user_post": " 6", "author": "Matthew Driver"}, {"date": "October 6, 2015 - 10:45 am", "content": "Matthew Driver,Thank you for posting your question on the ThingSpeak forum.The functionality requested in your post is not currently available in the form described.To better understand your request, can you describe your setup in a little more detail? For example, what convention are you using to differentiate data points from various sensors in a single Channel? MATLAB provides a function 'subplot' to create multiple axes in a figure. The 'subplot' function works with static MATLAB plots and does not work with dynamic plotting functions (thingSpeakPlot ect..). More information on the 'subplot' function is available on the following Documentation center page:http://www.mathworks.com/help/matlab/ref/subplot.html?searchHighlight=subplotIt is also possible to plot multiple series in a single MATLAB plot. The syntax and examples for how to do so are available in the following Documentation center page:http://www.mathworks.com/help/matlab/ref/plot.html?searchHighlight=plot", "num_user_post": " 4", "author": "hans"}, {"date": "October 13, 2015 - 4:20 am", "content": "Hello,Thank you for responding. I should have checked back sooner:-).My channel has fields at:datetimeSensorID (alphanumeric) Examples: Oats1, Oats2, OnionsLayer1, value options: 'R', 'G', 'B'Layer2 as aboveLayer3 as aboveLayer4 as aboveMy visualisation code filters out all but one SensorID and does some coloured rectangle drawing to get the output I need.At the moment I'm making one visualisation app per SensorID but this is not scalable.Please see the examples:https://thingspeak.com/apps/matlab_visualizations/27998https://thingspeak.com/apps/matlab_visualizations/27999https://thingspeak.com/apps/matlab_visualizations/28000So my problem is not how to plot. I've got that sorted.My problem is how to make one visualisation app reusable based on the SensorID as an input?This same concept could be used for any kind of data.Example - IoT temperature sensors:I plan to build a large number of temperature data logging devices (using 1-wire temperature sensor and an ESP8266 wifi module.Each temperature sensor has an 64bit ID.Proposed ThingSpeak solution:Code all the micro-controllers identically with the same thingspeak write key.Store the data for all sensors in a single channel.Fields: datetime, SensorID, temperatureCreate a single visualisation  that has the SensorID as an input.Embed on a web page multiple lines like this:[iframe src='https://thingspeak.com/apps/matlab_visualizations/27986?SesnorID=A5D4c4EE62' width='100%' height='220'][iframe src='https://thingspeak.com/apps/matlab_visualizations/27986?SesnorID=EE62A5D4c4' width='100%' height='220']etc.End result you have a data storage and visualisation system for any number of temperature sensors without requiring the micro controller to have customised writekeys. You only need to configure one thingspeak channel and one visualisation app.All the above solution is missing is the ability to provide an input to visualisation apps via the URL.I hope I have explained myself well enough for other to see the power of a feature like this.Cheers,Matthew.Cheers,Matthew Driver", "num_user_post": " 6", "author": "Matthew Driver"}, {"date": "October 14, 2015 - 12:10 am", "content": "Matthew/    I wonder if the URL query string is available in the thingspeak  MATLAB via getenv() ?   This stack overflow question lists how to enumerate the environment variables https://stackoverflow.com/questions/20004955/list-all-environment-variables-in-matlabBut I'm too much of a MATLAB newbie to know how to return any such list..", "num_user_post": " 271", "author": "rw950431"}, {"date": "October 14, 2015 - 7:44 pm", "content": "Thanks rw950431,Interesting idea to use getenv().I have tried getenv() inside of a visualisation and this the available content:code used:map = java.lang.System.getenv();disp(map);The output is below but unfortunately it doesn't appear to contain the URL query string.The query string was: https://thingspeak.com/apps/matlab_visualizations/28323/editCheers,Matthew.Output:{MATLAB_CONNECTOR_AUTOSTART_ENABLED=false, AUTOMOUNT_MAP=, SHLVL=2, MATLAB_PREFDIR=/tmp/matlabpref, OSG_LD_LIBRARY_PATH=/opt/mlsedu/matlab/R2015b/sys/openscenegraph/lib/glnxa64, XFILESEARCHPATH=/opt/mlsedu/matlab/R2015b/sys/java/jre/glnxa64/jre/lib/locale/%L/%T/%N%S::/usr/dt/app-defaults/%L/Dt, PROXY_SERVER_PORT=3128, MATLABPATH=/opt/mlsedu/matlab/R2015b/toolbox/local, DEBIAN_FRONTEND=noninteractive, LC_NUMERIC=C, GFORTRAN_STDOUT_UNIT=-1, MAIL=/var/mail/mlsedu, HOSTNAME=6c3e2f72fd93, MLSEDU_ROOT=/opt/mlsedu/mdcsserver/latest, PWD=/opt/mlsedu/mdcsserver/latest/m, MKL_DOMAIN_NUM_THREADS=, LOGNAME=mlsedu, KMP_HANDLE_SIGNALS=0, TOOLBOX=/opt/mlsedu/matlab/R2015b/toolbox, NLSPATH=/usr/dt/lib/nls/msg/%L/%N.cat, LD_LIBRARY_PATH=/opt/mlsedu/matlab/R2015b/sys/opengl/lib/glnxa64:/opt/mlsedu/matlab/R2015b/sys/os/glnxa64:/opt/mlsedu/matlab/R2015b/bin/glnxa64/mvm:/opt/mlsedu/matlab/R2015b/bin/glnxa64:/opt/mlsedu/matlab/R2015b/extern/lib/glnxa64:/opt/mlsedu/matlab/R2015b/runtime/glnxa64:/opt/mlsedu/matlab/R2015b/sys/java/jre/glnxa64/jre/lib/amd64/native_threads:/opt/mlsedu/matlab/R2015b/sys/java/jre/glnxa64/jre/lib/amd64/server, KMP_STACKSIZE=512k, OLDPWD=/opt/mlsedu/matlab/R2015b, SHELL=/bin/bash, MATLAB=/opt/mlsedu/matlab/R2015b, MW_CRASH_MODE=exit, LANGUAGE=en_US:en, BASEMATLABPATH=, PATH=/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin:/usr/games:/usr/local/games, GFORTRAN_STDIN_UNIT=-1, PROXY_SERVER=ec2-50-17-204-167.compute-1.amazonaws.com, HOST_IP_ADDRESS=10.203.202.175, WORKER_GATEWAY_WEB_SERVER_PUBLIC_PORT=10000, LM_LICENSE_FILE=13501@motw-flexlm-15b-a.wsroute.mathworks.com:13501@motw-flexlm-15b-d.wsroute.mathworks.com, DISPLAY=:1.0, USER=mlsedu, HOME=/tmp/matlabpref, ARCH=glnxa64, DOCKER_CONTAINER_NAME=trusting_wilson_0, KMP_BLOCKTIME=1, WORKER_CONFIG=/tmp/worker.properties, GFORTRAN_STDERR_UNIT=-1, MKL_NUM_THREADS=, INITRD=no, HTTP_MATLAB_CLIENT_GATEWAY_PUBLIC_PORT=8000, LANG=en_US.UTF-8}", "num_user_post": " 6", "author": "Matthew Driver"}, {"date": "October 15, 2015 - 12:14 am", "content": "Shame about that...  Did you try to append some parameters just to be sure? I notice you are using the edit URL rather than the straight viewer- wonder if that makes any difference?  Were you were able to see the result of 'disp(map)' on the thingspeak console when you called the URL?  (Maybe thats why you used the edit URL) Useful to know for debugging.", "num_user_post": " 271", "author": "rw950431"}, {"date": "October 15, 2015 - 2:58 am", "content": "Hi Hi rw950431,I have rewritten the code so I can include the text in an actual visualisation.Please visit this URL to see the output:https://thingspeak.com/apps/matlab_visualizations/28323?xxx=AAAAAAAAAAAAAAAAAAAAAAAAAAAAAResult:Unfortunately the extra parameters are not present.Here is my visualisation code (if your interested). It's not very elegant but does the job for this test.map = java.lang.System.getenv();figure('position', [0, 0, 1000, 500])drawtext = char(map);num = 100;textlength = length(drawtext);numlines = ceil(textlength/num);for k=1:numlines    frompos = 1+(k-1)*num;    topos = num+(k-1)*num;    if (topos>textlength)        topos=textlength;    end    drawtext_part = drawtext(frompos:topos);    text('units','pixels','position',[10 400-k*12],'fontsize',10,'string',drawtext_part);endCheers,Matthew.", "num_user_post": " 6", "author": "Matthew Driver"}, {"date": "October 15, 2015 - 7:30 pm", "content": "Awesome!  Thanks for the code. Wonder if theres any way to use a 3rd-party webservice as a wrapper..  then your visualisation would call an external URL which does the filtering, supplies the filtered data via webread()  and returns the image ..   not sure if its possible, just thinking out loud..", "num_user_post": " 271", "author": "rw950431"}, {"date": "October 15, 2015 - 11:23 pm", "content": "Hi rw950431,The trouble with any kind of solution like:We first store the input parameter (for example into another matlab channel) and then the visualisation code goes off to find that valueIf multiple hits to the visualisation happen at the same time the results returned may not be what are expected.It all gets rather messy.I'm starting to the think I need to drop using the matlab visualisation solution and rewrite the visualisation as a javascript plugin. This will be a pain but at least I'll have access to the URL parameters.This is a real shame as the matlab visualisation code is very powerful (and I've already written it (except for URL input parameters).Thanks for your thoughts.Cheers,Matthew", "num_user_post": " 6", "author": "Matthew Driver"}, {"date": "October 18, 2015 - 7:32 pm", "content": "After thinking about it some more I came to much the same conclusion..  Simpler to use one of the javascript graphing libs to do it all in-browser.Perhaps the thingspeak guys will take it as a feature request?", "num_user_post": " 271", "author": "rw950431"}, {"date": "October 20, 2015 - 4:56 am", "content": "Hi rw950431,I've just finished porting my MatLab visualisation to a javascript plugin. It still hosted with ThingSpeak as a plugin.As it's not a tradition chart, I just coded it using javascript canvas drawing functions.I used jsbin.com as my development editor. The best feature is it redraws in real time as you code and displays syntax errors in a useful way.http://jsbin.com/lelode/edit?html,css,js,outputExamples:The URL for the new plugin is in the format:https://thingspeak.com/apps/plugins/29169?SensorID=oats1https://thingspeak.com/apps/plugins/29169?SensorID=Oats2https://thingspeak.com/apps/plugins/29169?SensorID=mustardYou can see I have my SensorID input parameter in the URL.Let's hope URL input parameters are added to thingspeak in the future.Cheers,Matthew.", "num_user_post": " 6", "author": "Matthew Driver"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/thingtweet-esp8266-400-bad-request/", "posts": [{"date": "April 27, 2015 - 5:50 pm", "content": "Its been at least 400 this afternoon.. It took me 4 days to get the ESP8266 to talk to my Arduino then it took another 3 days to solve the 64 character buffer limit issue preventing me from sending any data greater than 64 characters to a URL.  Now at least I am getting data to ThingSpeak but No matter how I format the POST I get an error.  Can somebody provide an example of a POST from an ESP8266 that actually reaches Twitter?I send the POST statement exactly the way I copied if off the documentation page:POST +Space+URL + CR+LF+Tab+api_key+CR+LF+Tab+Status+CR+LF+CR+LFHere is the output I am getting from my program:AT+CIPSTART='TCP','184.106.153.149', 80AT+CIPSEND=121>DebugMsg: Everything looks good so far... sending command..:-) POST https://api.thingspeak.com/apps/thingtweet/1/statuses/updateapi_key=MYLONGKEYHEREstatus=Arduino Tweet 001SEND OK+IPD,172:400 Bad Request400 Bad Requestnginx/1.7.5OKOKUnlinkDebugMsg: Another Error message! Start over ", "num_user_post": " 3", "author": "2BitBot"}, {"date": "April 27, 2015 - 8:02 pm", "content": "Ha!   Found another code example on GitHub and it works!  It's Alive!  The Correct format is:POST /apps/thingtweet/1/statuses/update HTTP/1.1Host: api.thingspeak.comConnection: closeContent-Type: application/x-www-form-urlencodedContent-Length: 49api_key=MYLONGKEYHERE&status=Arduino Tweet 001", "num_user_post": " 3", "author": "2BitBot"}, {"date": "April 28, 2015 - 10:22 am", "content": "Hey theirI am interested to do the same as you did but never get the correct code I'm getting errors for that , may you please show me hoe you wrote your code for this part , Thanks", "num_user_post": " 4", "author": "Mona_kh"}, {"date": "April 28, 2015 - 1:05 pm", "content": "If by 'Part' you mean the HTTP code format here you go....This is the Arduino sketch code I used.The variable 'request' holds the text I  am sending to Twitter.. Oh the ' n' at the end of several lines is the line feed character.. I don't know how to put that in here without it turning into a an actual line feed...  just remove the space between the  and the n in your code.     //create the request string     request = 'api_key=MYLONGKEYHERE&status='+request;     String sendcommand = 'POST /apps/thingtweet/1/statuses/update HTTP/1.1 n';     sendcommand += 'Host: api.thingspeak.com n';     sendcommand += 'Connection: close n';     sendcommand += 'Content-Type: application/x-www-form-urlencoded n';     sendcommand += 'Content-Length: ';     sendcommand += request.length();     sendcommand += ' n n';     sendcommand += request;First you connect to Thingspeak.com using CIPSTART     String startcommand = 'AT+CIPSTART='TCP','184.106.153.149', 80';Then you tell it how many characters of data to send wtih CIPSEND     Serial.print('AT+CIPSEND=');     Serial.println(sendcommand.length()+2);Finally you send the 'sendcommand' string 64 characters at a time pausing to wait for ESP8266 to echo back the substring just sent before sending the next substring.     Serial.print(sendcommand.substring(t,i));     t=i; i+=64;     while (Serial.available()) {dbugMon.print(Serial.read())}Keep Looping until all sendcommand characters are sent. where i >sendcommand.length()and if you don't make any syntax errors like usually do  it works!Once I pretty up my code I'll post it online as part of my Tweeting Dehumidifier that tweets when it needs to have it's bucket emptied.  I'll be looking for funny suggestions for the tweet text..Hope this helps!  Good Luck!", "num_user_post": " 3", "author": "2BitBot"}, {"date": "October 14, 2015 - 2:07 pm", "content": "2BitBot said Ha!   Found another code example on GitHub and it works!  It's Alive!can you please give me that GitHub link where you find that example or please send me your code.Thanks!!!", "num_user_post": " 2", "author": "asadujjaman"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/react-or-thinghttp-to-send-tweet-or-all/", "posts": [{"date": "September 25, 2015 - 4:20 pm", "content": "I'm trying to send a tweet when certain conditions are met in the data in my feed.  However I'm stymied by the fact that Twitter will only show a given Tweet once.  React works well to send a tweet but if it sends it twice I only see the first one on Twitter.   Variables such as %%Date%% will not work in a React.Can anyone help?Thanks", "num_user_post": " 2", "author": "patman"}, {"date": "September 25, 2015 - 4:59 pm", "content": "Hi,If you use %%trigger%% in your React, does that help to avoid sending the same tweet?https://thingspeak.com/docs/react#replacementslee", "num_user_post": " 457", "author": "lee"}, {"date": "September 25, 2015 - 7:17 pm", "content": "I tried that but the data doesn't change enough, it's an on/off switch.", "num_user_post": " 2", "author": "patman"}, {"date": "September 29, 2015 - 7:54 pm", "content": "Perhaps this will work for you?1. Set up your thingTweet and get the key.2. Create a Matlab analysis with the code shown below, adding your channel ID, read api key and thingTweet key where shown.3. Set up a React that triggers your matlab analysis.You can customize the message  by changing fmtstr% add timestamp to data in order to bypass twitters 'no duplicates' policy% TODO - Replace the [] with channel ID to read data from:readChannelID = [YOUR_CHANNEL_ID];% TODO - Enter the Read API Key between the '' below:readAPIKey = 'YOUR_READ_KEY';%% Read Data for field 1 of given channel %%data = thingSpeakRead(readChannelID, 'ReadKey', readAPIKey, 'Fields',1);%% uncomment below to debug data% disp(data)thingTweetURL = 'https://api.thingspeak.com/apps/thingtweet/1/statuses/update';thingTweetApiKey = 'YOUR_THINGTWEET_KEY';fieldName = 'status';fmtstr='Sensor reading %0.1f at %s';fieldValue = sprintf(fmtstr,data,datestr(datetime('now')));response = webwrite(thingTweetURL,'api_key',thingTweetApiKey,fieldName,fieldValue)", "num_user_post": " 271", "author": "rw950431"}]}]}