{"url": "https://community.thingspeak.com/forum/thingspeak-apps/page-10/", "threads": [{"url": "https://community.thingspeak.com/forum/thingspeak-apps/api-for-thingspeak-apps/", "posts": [{"date": "February 24, 2016 - 3:25 am", "content": "Is there an API to create a new React or ThingHTTP?", "num_user_post": " 2", "author": "Sam"}, {"date": "February 24, 2016 - 4:29 pm", "content": "Hi Sam, There is no API today to create a new React or ThingHttp app. You will need to create it on Thingspeak.com. Tell us more about your use case that requires these APIs.Thanks,Adarsh", "num_user_post": " 62", "author": "Adarsh_Murthy"}, {"date": "March 2, 2016 - 10:57 am", "content": "Hi AdarshThanks for your answer.Ok  I will try, but my English is not very good…I do a diploma thesis in the field of IoT. The main goal is to register sensors as simple as possible, which then send data to ThingSpeak. The whole registration process should be able with a mobile app (without a need of Thingspeak.com). So I create new channels through the API, and it would be nice also create React or ThingHttp app. For example to send always the newest value to Firebase, which I also use for that project.GreetingsSam", "num_user_post": " 2", "author": "Sam"}, {"date": "March 3, 2016 - 2:01 pm", "content": "Thanks for sharing Sam. We will consider adding support for creating React or ThingHttp app programmatically for a future release. - Adarsh", "num_user_post": " 62", "author": "Adarsh_Murthy"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/can-an-app-receive-parameters-from-a-url/", "posts": [{"date": "March 1, 2016 - 7:38 am", "content": "Is it possible for a web browser to send parameters to a visualization app via the URL?I have a Matlab visualization that users will view with a web link  (e.g. https://thingspeak.com/apps/matlab_visualizations/xxxxx).  When the app generates the graph for that user, I need to set the location of a reference line based on a piece of information from the user.  Is there an easy way to do that?For example, maybe the user could use a URL such as:   https://..../xxxxx&mydata=15Maybe there's some other way to do what I need.Thanks!", "num_user_post": " 2", "author": "mvyctf"}, {"date": "March 1, 2016 - 7:45 am", "content": "My bad ... this topic has already been discussed here:http://community.thingspeak.com/forum/thingspeak-apps/parsing-data-from-the-url-in-matlab-analysis-and-visualizations/ For me, porting to javascript is not an option because the code is too complex.", "num_user_post": " 2", "author": "mvyctf"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/talkback-post-problem/", "posts": [{"date": "February 26, 2016 - 2:50 pm", "content": "I am not able to issue a POST command to my private Talkback channel.  I have successfully executed and deleted commands. I am sending the following post to Talkback but I am not sure of the syntax.  Can anyone tell me what I am doing wrong?'POST /talkbacks/2864/commands.json?api_key=MYAPIKEY&command_string='ON'&position='I have tried replacing the ? and the & characters with (carriage return line feed) escape chars but still get 400 errors also tried removing the single quotes from the command string field.Thanks ", "num_user_post": " 4", "author": "Souperman"}, {"date": "February 26, 2016 - 2:51 pm", "content": "this works!'GET /talkbacks/2864/commands/execute.json?api_key=MyKey followed by crlf crlf'", "num_user_post": " 4", "author": "Souperman"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/my-react-does-not-work-properly/", "posts": [{"date": "April 19, 2015 - 4:23 pm", "content": "I have some channels and established react trigger for tweeting when channel temperature above some level... the react only worked once and sent a tweet when value got over level... later it does not send tweets although temperature is over specified level... Not to mention I checked to trigger everytime value goes higher than specified level...  pls help...", "num_user_post": " 1", "author": "borsaci06"}, {"date": "April 20, 2015 - 8:35 am", "content": "Hi,Twitter will not allow multiple Tweets to be posted that are identical.  Try adding the time or some random value to your Tweet, and it will probably work correctly.lee", "num_user_post": " 457", "author": "lee"}, {"date": "June 12, 2015 - 7:50 pm", "content": "Is there any random replace item like %%DATETIME%% or similar that can be used to make different posts to twitter from react twitter. If not this feature become unusable - works only the first time Just imagine a case you have channel field for door open or closed an you want to tweet the status... this will work once for close and once for open because of twitter limitation", "num_user_post": " 4", "author": "ndinev"}, {"date": "February 1, 2016 - 7:01 pm", "content": "https://www.mathworks.com/help/thingspeak/react-app.htmlReplacementsIf you specify, %%trigger%% in your ThingHTTP request or ThingTweet message, %%trigger%% will be replaced with the value that triggered your React. Your tweet could be, 'It is way too hot in here at %%trigger%%C'. You can also add the Channel ID attached to the React by using %%channel_id%% as a replacement.", "num_user_post": " 8", "author": "homerruma"}, {"date": "February 1, 2016 - 10:50 pm", "content": "ndinev said Is there any random replace item like %%DATETIME%% or similar that can be used to make different posts to twitter from react twitter. If not this feature become unusable - works only the first time Just imagine a case you have channel field for door open or closed an you want to tweet the status... this will work once for close and once for open because of twitter limitationTwitter only blocks identical tweets next to each other-  you should be able to tweet ON/OFF/ON/OFF indefinitely, you just cant tweet ON/ON/ON/ON etc.If the above is still not working for you then maybe you need some matlab analysis code between your react and your thingtweet.  (matlab's webwrite() function can be used to post data to thingtweet URL)", "num_user_post": " 271", "author": "rw950431"}, {"date": "February 20, 2016 - 4:22 pm", "content": "Twitter only blocks identical tweets next to each other-  you should be able to tweet ON/OFF/ON/OFF indefinitely, you just cant tweet ON/ON/ON/ON etc.Is this rule verified?", "num_user_post": " 8", "author": "homerruma"}, {"date": "February 23, 2016 - 6:49 pm", "content": "You can test it from the twitter web interface or your favorite appSee also https://twittercommunity.com/t/duplicate-tweets/13264  or search for 'twitter duplicate tweet'", "num_user_post": " 271", "author": "rw950431"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/how-many-days-or-month-possible/", "posts": [{"date": "February 11, 2016 - 9:31 am", "content": "I have a problem,I can not get my entire data curve shown !my data gets truncated to unly show the last month of dataWHY ?Where is december data ?https://thingspeak.com/channels/71167it does not matter if I ask for 99 days, or 999 days, december data is still gone,", "num_user_post": " 24", "author": "OZ2CPU"}, {"date": "February 12, 2016 - 12:43 am", "content": "A single API call can only return 8000 points- is that likely to be a problem for you?", "num_user_post": " 271", "author": "rw950431"}, {"date": "February 12, 2016 - 4:05 am", "content": "thanks, I think this explain my problem,this means if I want to make a curve over several years, I need to figure out how often I can upload dataso my total points is still inder 8000OK lets do the math together :8000 / 2 years = 4000 points pr year4000/ 365 = 11 points pr day.in other words, only upload every 2nd or 3rd hr", "num_user_post": " 24", "author": "OZ2CPU"}, {"date": "February 12, 2016 - 8:49 am", "content": "All the data points that you send to ThingSpeak are still stored and available. However, as you have noticed, the default charts allow you to visualize only the last 8000 points. If you want to visualize data for a specific period of time then you can do that by specifying the 'start' and 'end' parameters as described on this page (under Feeds Parameter section):https://www.mathworks.com/help/thingspeak/create-a-chart.htmlIf you want to visualize more than 8000 points at a time, you can create a MATLAB Visualization and add the visualization to your channel page. Here is a simple code snippet that I created to visualize data for the last 8 days (about 11500 points):% The first data segment - note that this should contain less than 8000 pointsend1 = datetime('now');start1 = end1 - days(4);% Second data segment - note that this should contain less than 8000 pointsend2 = start1;start2 = end2 - days(4);% Read the first data segment[data1, time1] = thingSpeakRead(12397, 'DateRange', [start1, end1], 'Fields', [3, 4]);% Read the second data segment[data2, time2] = thingSpeakRead(12397, 'DateRange', [start2, end2], 'Fields', [3, 4]);% join the two data setsdata = [data2; data1];time = [time2; time1];% Plot the datathingSpeakPlot(time, data)Find more information about the MATLAB Visualization app at this link:https://www.mathworks.com/help/thingspeak/matlab-analysis-and-visualization.html", "num_user_post": " 62", "author": "Adarsh_Murthy"}, {"date": "February 14, 2016 - 12:26 pm", "content": "Thanks for the info, I realized the problem must be with year change ??since my curves show fine all data from january until now, when I ask for it using days or points,but nothing from december, no matter how many points or days I ask for !!!to check this is true, I downloaded all my data into a CSV file, and bingo 🙂all my december 2015 data is perfectly there, just impossible to show it.please fix the bug ThingSpeak 🙂", "num_user_post": " 24", "author": "OZ2CPU"}, {"date": "February 15, 2016 - 5:11 am", "content": "I keept playing with this, since it keep driving me nuts,I see it is possible to show a curve from dec 2015 and continue the curve to feb 2016since other of my channels do work !here you can see the ones that workand the ones with error, dont show dec..http://webx.dk/ak/test.htmplease help ??", "num_user_post": " 24", "author": "OZ2CPU"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/check-if-device-is-alive/", "posts": [{"date": "February 11, 2016 - 3:14 am", "content": "Hello,I need to detect if a device is alive respectively online. I thought of adding some kind of watcher to a ThingSpeak channel. The watcher should alert me if there is now data added to the channel for a predefined time.Is there some existing plugin, or how could I realize this?Best regards,wewa", "num_user_post": " 2", "author": "wewa"}, {"date": "February 11, 2016 - 6:48 am", "content": "Check out the React app. One of the options is No Data Inserted.", "num_user_post": " 402", "author": "Hans"}, {"date": "February 12, 2016 - 3:26 am", "content": "Oh, thank you, I didn't notice that option first.", "num_user_post": " 2", "author": "wewa"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/how-to-add-talkback-command-by-using-thinghttp/", "posts": [{"date": "January 19, 2016 - 3:41 pm", "content": "Following settings does not work:URL:https://api.thingspeak.com/talkbacks/3635/commandsHTTP Auth Username:ThingSpeak userHTTP Auth Password:ThingSpeak passwordMethod:POSTContent Type:MIMEHTTP Version:1.1Host:api.thingspeak.comHeaders:Body:api_key=B1UBYTU4IREGTX8U&command_string=LED04=1Any ideas?", "num_user_post": " 2", "author": "umami"}, {"date": "January 19, 2016 - 4:58 pm", "content": "I would try changing the Content Type to the following:Content Type: application/x-www-form-urlencoded", "num_user_post": " 402", "author": "Hans"}, {"date": "January 20, 2016 - 2:01 am", "content": "It works!", "num_user_post": " 2", "author": "umami"}, {"date": "February 6, 2016 - 5:01 am", "content": "I am trying to do exactly the same but I get a return that the page doesn't exist. So this must mean that my ThingHTTP is not set up correctly.Also, what should I type in the HTTP Auth Username/Password? The channel is private.This is my setting:Name:Request 15128API Key:F5A4M44UPU6I309WRegenerate API KeyURL:https://thingspeak.com/apps/talkbacks/5728/commandsHTTP Auth Username:HTTP Auth Password:Method:POSTContent Type:application/x-www-form-urlencodedHTTP Version:1.1Host:api.thingspeak.comHeaders:Body:api_key=LOWE6CYCQ2KCCJF4&command_string=LED&position=1", "num_user_post": " 1", "author": "MartinV"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/how-to-show-column-charts/", "posts": [{"date": "February 1, 2016 - 6:47 am", "content": "Hi guys,I successfully displayed some datas from arduino on my personal webpage using HTTP post and thingspeak with the standard chart code available.However I'd like visualize integer numbers (whole numbers) instead of using analogue datas on charts (like temperatures).How can I do this?Another thing that I'd like to know is:To be better visualized, how can I extend the charts to it's horizontal sides  to cover more it's historical information ? Thank you very much!", "num_user_post": " 1", "author": "Modus"}, {"date": "February 3, 2016 - 11:43 am", "content": "Hi Modus, You can use MATLAB Visualization App to create custom visualizations of your sensor data.  To convert decimal values to integers you can use the 'round' function in MATLAB. For e.g.:If your data looks like this:data = 9.1519Call the round function to convert it to an integer.>> round(data)ans =     9 There are other options depending on how you want to convert the data: 'ceil', 'floor' functions.Regarding extending the charts horizontal sides, if you are using the default visualization on ThingSpeak, then click on the 'pencil' symbol in the top left corner of the chart. This opens a new window with options that you can set to change the data being displayed. Play with the Days or results options to find the appropriate display.Thanks,Adarsh", "num_user_post": " 62", "author": "Adarsh_Murthy"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/how-to-delete-a-visualization/", "posts": [{"date": "February 2, 2016 - 5:58 pm", "content": "Hello, I have searched a while in the forum but cannot find the answer i'm looking for.I have a channel, via MATLAB Visualization, i've added 5 visualizations with a 'template'.Some of them don't work. Okay, no problem. Others i don't need. At the bottom shows the Delete option.i got a warning dialogbox telling me that i'm sure to delete the code. Yes.There was also a checkbox in this warning box to confirm that this dialogbox was no futher needed.I checked the box, but now i cannot delete any visualizations.I don't know how to turn on the safety warning box again.Looked in my profile etc. Perhaps a stupid thing i looked over. Anybody help?Oh, Windows 10 with Chrome, apps for Chrome installed: Adblock and GhosteryRegards Denniske.", "num_user_post": " 2", "author": "Dennniske"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/email-react-support-in-the-future/", "posts": [{"date": "June 19, 2015 - 12:09 pm", "content": "Hi,Thingspeak is great if the end  device talks HTTP requests.  What about email support with REACT, so ideally if a certain datapoint condition is met one can be alerted by email, and with IFTTT basically all possibilities open up. Seems like IFTTT does not have plans to supprt HTTP.Thanks", "num_user_post": " 7", "author": "joefly"}, {"date": "June 22, 2015 - 8:42 am", "content": "Hi,This is something we have discussed internally, and will consider implementing in a future update to ThingSpeak.lee", "num_user_post": " 457", "author": "lee"}, {"date": "July 13, 2015 - 7:33 am", "content": "This email function would be a VERY nice to have option. Auto alerts on my prototype power meter with PIC and ESP ", "num_user_post": " 11", "author": "rayellam"}, {"date": "July 23, 2015 - 2:13 am", "content": "https://zapier.com  has some support for HTTP Post -> Email.  Paid service though.Theres also this (somewhat dated) post https://www.marcus-povey.co.uk/2012/11/07/using-webhooks-with-ifttt-com/ which uses wordpress as middleware between a HTTP post and IFTTT but I dont know if it still works.", "num_user_post": " 271", "author": "rw950431"}, {"date": "January 28, 2016 - 12:19 pm", "content": "rw950431 said https://zapier.com  has some support for HTTP Post -> Email.  Paid service though.Theres also this (somewhat dated) post https://www.marcus-povey.co.uk/2012/11/07/using-webhooks-with-ifttt-com/ which uses wordpress as middleware between a HTTP post and IFTTT but I dont know if it still works.How to thingspeak to zapier?Please tutorial for step by step for our beginners.thank you", "num_user_post": " 8", "author": "homerruma"}, {"date": "January 28, 2016 - 6:10 pm", "content": "Since my original post IFTTT have introduced the Maker channel which avoids the above work-around.See this thread http://community.thingspeak.com/forum/thingspeak-apps/thinghttp-ifttt-maker/ for some details on how to use it.", "num_user_post": " 271", "author": "rw950431"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/react-problems/", "posts": [{"date": "December 10, 2012 - 1:16 pm", "content": "Hi, I am a happy user of Thingspeak for many months. I was also pleased to see the possibility to use the REACT app as an addition to get informed of important data events. However my REACT calls (mail and android notifry) are not arriving at all anymore since last night. They have been working fine for months and I do see the data arriving at the Thingspeak channels properly. Also the REACT rules are still in tact, Ive tested sending a message from for instance a linked HTTPPOST event and that still was working. So it looks as data from my side arrives at the server and the server is able to inform me but the REACT app seems to not send its events anymore ... regardsCorBee", "num_user_post": " 37", "author": "CorBee"}, {"date": "December 12, 2012 - 2:20 am", "content": "This morning the system seems to have been functioning shortly ... but its again stopped. Anybody working on it ? regardsCorBee", "num_user_post": " 37", "author": "CorBee"}, {"date": "December 14, 2012 - 7:17 am", "content": "And its working again as planned ... odd that we never hear if this was done by some kind of mystic powers or someone behind a keyboard ... Hope they read this message too .... Thanks !!", "num_user_post": " 37", "author": "CorBee"}, {"date": "December 16, 2012 - 10:00 pm", "content": "Whoops, I missed your posts about React. On on of the Reacts server we were running low on RAM. This caused some odd behavior. We addressed the issue and everything should be back to normal.", "num_user_post": " 402", "author": "Hans"}, {"date": "December 17, 2012 - 2:14 am", "content": "HI, Well the issue has indeed been resolved. Unfortunately I could not find a clear adress where I could send in my error-report. Is there something like a thingspeak helpdesk mailadress ? cheersCor", "num_user_post": " 37", "author": "CorBee"}, {"date": "December 18, 2012 - 12:09 am", "content": "Glad it's working again!Please use support@thingspeak.com for support email.", "num_user_post": " 402", "author": "Hans"}, {"date": "April 26, 2013 - 6:59 am", "content": "Hi CorBee,can you help please how to send e-mail ( and/or notify android ) like you do?Thanks!", "num_user_post": " 63", "author": "vespapierre"}, {"date": "April 30, 2013 - 3:10 am", "content": "Managed to do this with NMA. Thanks.", "num_user_post": " 63", "author": "vespapierre"}, {"date": "May 15, 2013 - 3:57 am", "content": "I am using NotiFry in combination with Pushingbox (so Thingspeak sends a message to Pushingbox and Pushingbox sends notifactions and/or emails accordingly that I can receive on my android using Notifry and a normal mailprogram (Gmail in my setup)cheersCOr", "num_user_post": " 37", "author": "CorBee"}, {"date": "May 15, 2013 - 10:37 am", "content": "Unfortunately since yesterday I have the feeling the REACT server is again giving problems. Anybody else that sees this also ? I tried tested the THINGhttp links and they were working still as planned but REACT does not seem to fire requests or so. Ive posted several mails also to support@thingspeak.com but have no answer yet. regardsCorBee", "num_user_post": " 37", "author": "CorBee"}, {"date": "May 15, 2013 - 1:50 pm", "content": "We got your support messages and we are looking into the issue. As of right now all services are up and running properly. I will get back to you shortly.Thanks,Hans", "num_user_post": " 402", "author": "Hans"}, {"date": "May 15, 2013 - 2:48 pm", "content": "Hi HansThanks for the action, I dont see any messages appearing yet.regardsCor", "num_user_post": " 37", "author": "CorBee"}, {"date": "May 16, 2013 - 5:57 am", "content": "Hi,I have the same problem like CorBee. No messages arriving to my Android Device using REACT. In case of using the link manually to test, it is working, but seems REACT do not send the request automatically.", "num_user_post": " 63", "author": "vespapierre"}, {"date": "May 17, 2013 - 12:47 am", "content": "Hi vespapierre,When did this problem start for you ? With me it started somewhere during last tuesday. Unfortunately my problems also have not been solved.regardsCor", "num_user_post": " 37", "author": "CorBee"}, {"date": "May 17, 2013 - 1:03 am", "content": "Hi,last push message came on 14th of May 15:46 local time (Budapest). And still no message arrived except the test ones on 16th of May 12:47 and 12:52 local time.", "num_user_post": " 63", "author": "vespapierre"}, {"date": "May 17, 2013 - 1:11 am", "content": "HiThat fits to my scheme, I saw my last message coming in at 930 (Netherlands)  on the 14th of may. I should have had messages later that day at around 2000 or so but none arrived. Since then I have tested many options. I created an additional thinghttp scheme that uses another notification system NMA. But both my original setup using PushingBox and the new one still have not delivered any of the reacts. The data is streaming well and my graphs show that I should have had reacts but something seems to be wrong.Cor", "num_user_post": " 37", "author": "CorBee"}, {"date": "May 17, 2013 - 1:34 am", "content": "I thinks Thingspeak guys will solve the problem Netherlands, great! Looking for contacts about importing used bicycles and Vespa scooters:):)", "num_user_post": " 63", "author": "vespapierre"}, {"date": "May 17, 2013 - 1:59 am", "content": "We found a possible issue that might cause REACTs to stop in certain cases. I will update you as soon as we have a fix. Thanks for reporting this.", "num_user_post": " 4", "author": "hans"}, {"date": "May 17, 2013 - 2:13 am", "content": "Hi vespa,I can inform you about using bicycles but not about how to import them  ) Cor", "num_user_post": " 37", "author": "CorBee"}, {"date": "May 17, 2013 - 2:18 am", "content": "Hi Hans,I think it would be interesting to know which type of REACT you think should be working still. Cor", "num_user_post": " 37", "author": "CorBee"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/thinghttp-twitter-string/", "posts": [{"date": "January 12, 2016 - 1:19 pm", "content": "So I'm brand new to the IoT world. I'm using an Adafruit Huzzah board to connect up, with a stepper motor (and driver board of course) being driven from the Huzzah. I'm trying to get my ThingHTTP setup so that when I post a Tweet (see TipsEZ on twitter) the Thing HTTP will input the entire Tweet string into Field 1 or Field 2; then I'll use the ThingSpeak header on the Huzzah and perform a readStringField(myChannel, 2, myAPI). However, I cannot seem to get it to post what I want into the fields. It triggers, and updates my channel feed with my Tweet, but it does not post to fields.Please someone help me. I've tried all the documentation I could find, but with my limited knowledge of HTTP and such I'm just sucking right now. This is my latest road block after spending about a week trying to get connected directly to Twitter.Thank you folks.", "num_user_post": " 7", "author": "TipsEZ"}, {"date": "January 12, 2016 - 6:26 pm", "content": "You are using TweetControl?   Have you read the documentation at https://au.mathworks.com/help/thingspeak/tweetcontrol-app.html?Would seem to allow the whole text of the tweet (%%status%%) to be inserted into a field (the example shows it being added to the status field of the channel but you can change that)", "num_user_post": " 271", "author": "rw950431"}, {"date": "January 12, 2016 - 10:08 pm", "content": "I have indeed read through this a couple of times, I have mine setup like this:api_key=myWriteAPIKey&field1=%%status%%&status=%%status%%which to me would seem to mean that I'm going to read the Status and place it into field1, and also place it into my Channel feed. It shows up in my channel feed but not in my field1 for me to pull with the Arudiono code and the ThingSpeak header.", "num_user_post": " 7", "author": "TipsEZ"}, {"date": "January 13, 2016 - 7:19 pm", "content": "Thats how I would have done it..Have you done some manual testing trying to insert strings into a field and retrieve them?  I'm wondering if there is an undocumented limit on string lengths or if spaces within the string screw up the insert..If you dont have access to command-line tools like 'wget' or 'curl'  you can use https://www.hurl.it/ to make web requests.", "num_user_post": " 271", "author": "rw950431"}, {"date": "January 14, 2016 - 10:00 am", "content": "When you say manually input the data into the field, what do you mean? I apologize, I'm brand new to this world. I've read some stuff about cURL and PhP, but none of it has really made much sense to me.", "num_user_post": " 7", "author": "TipsEZ"}, {"date": "January 14, 2016 - 6:12 pm", "content": "From what I read it seems you are having trouble extracting the data rather than putting it it..  So I'll try to explain the data extraction side.Under the hood of whatever library you are using the code has to deal in HTTP requests and responses (the same kind of thing you use to access a website from your browser).For example to access the last data from a public channel put this URL into your browser (2102 is the channel number)http://api.thingspeak.com/channels/2102/feeds/last.jsonIf its not a public channel add your read API key like sohttp://api.thingspeak.com/channels/2102/feeds/last.json?api_key=YOUR_READ_KEY(logon to thingspeak and visit https://thingspeak.com/channels/CHANNEL_ID/api_keys to see your keys)To try these with hurl.it  choose the GET method and enter the URL's above.See the docs at https://au.mathworks.com/help/thingspeak/get-a-channel-feed.html for more information and examples- to add more than one parameter separate them by & like sohttp://api.thingspeak.com/channels/2102/feeds.json?api_key=YOUR_READ_KEY&results=2This will allow you to see what your Huzzah is seeing- hopefully it helps figure out whats wrong.If you find the data is being updated properly let me know and I'll try to explain the updating side (slightly more complicated)", "num_user_post": " 271", "author": "rw950431"}, {"date": "January 15, 2016 - 8:55 am", "content": "Great! Thank you. Work looks to be rather busy today, but I'm hoping to swipe a few minutes on lunch to have a go at this. It'd would be great to find out if I'm just not updating or not pulling properly.", "num_user_post": " 7", "author": "TipsEZ"}, {"date": "January 15, 2016 - 1:54 pm", "content": "So I set my channel to public, and input the string for a public channel into hurl.it as a GET, below is what I got back:{'created_at': '2016-01-12T16:42:13Z','entry_id': 17,'field1': '#Thingspeak testing #FlagsHalfStaff','field2': null}So it looks like my recent change to post my Twitter string to Field one is functional. Next I input the following string to use as a GET after I sent a new Tweet.http://api.thingspeak.com/channels/78204/feeds/last.json?api_key=MYAPI KEYI received back in the body:{'created_at': '2016-01-15T18:50:41Z','entry_id': 18,'field1': 'Testing Thingspeak TweetControl for #FlagsHalfStaff','field2': null}So I'm guessing there is something I'm missing in the Thingspeak Arduino library. It looks like the data is indeed updating properly. Any further thoughts before I open up the Thingspeak header to try to figure out what parameters I may be missing?", "num_user_post": " 7", "author": "TipsEZ"}, {"date": "January 15, 2016 - 4:40 pm", "content": "I did some more reading and testing after I got some work stuff done, and I'm getting this to my serial monitor Error reading message.  Status was: -303using this code String message = ThingSpeak.readStringField(myChannelNumber, 1);  int resultCode = ThingSpeak.getLastReadStatus();  if(resultCode == 200)  {     Serial.print('Latest message is: ');     Serial.println(message);  }  else  {     Serial.print('Error reading message.  Status was: ');     Serial.println(resultCode);  }So I did a quick Google search and found this thread (below) that had some information, I updated my library (Git download) and renamed the old ThingSpeak library to *_old and it works! Phew. Now to try to integrate all this into my code for my current project.I'd still appreciate learning anything else you have to offer. This whole IoT world excites and interests me, but is a bit overwhelming for a newbie.http://community.thingspeak.com/forum/arduino/error-code-303-err_bad_response-unable-to-parse-response/", "num_user_post": " 7", "author": "TipsEZ"}]}]}