{"url": "https://community.thingspeak.com/forum/thingspeak-api/page-42/", "threads": [{"url": "https://community.thingspeak.com/forum/thingspeak-api/retrieval-of-minmax-values-via-api/", "posts": [{"date": "July 14, 2011 - 5:57 am", "content": "Is it possible to retrieve the min/max (total min/max or even min/max in a certain time period) via the API?", "num_user_post": " 3", "author": "marten"}, {"date": "July 19, 2011 - 11:43 pm", "content": "Not from the API. But, you can use a plugin and write your own client side processing of returned data.", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/what-is-the-start-and-end-date-format/", "posts": [{"date": "July 12, 2011 - 6:04 pm", "content": "The ThingSpeak API page athttp://community.thingspeak.com/documentation/api/#thingspeak_api mentions that you can request data with a 'start' and 'end' parameter, which take a 'date' argument. I cannot find an example of the format for the date, and there are many possibilities, some of which I think would not be valid in a URL. Can someone post an example of a valid start date format? For example, how would I properly complete this url? http://api.thingspeak.com/channels/627/charts/2?timescale=10&width=600&height=400&start= ???", "num_user_post": " 7", "author": "jbeale"}, {"date": "July 12, 2011 - 8:02 pm", "content": "Time format is as follows: 2011-07-09 00:00:00 (%20 is an encoded space) - that's year, month, date, hours, minutes, seconds - all 2 digits long.Example: http://api.thingspeak.com/channels/627/charts/2?timescale=10&width=600&height=400&start=2011-07-08%2000:00:00&end=2011-07-09%2000:00:00", "num_user_post": " 402", "author": "Hans"}, {"date": "July 13, 2011 - 3:29 pm", "content": "Ha ha, it works!  Now I can see the older data, which I thought was lost and gone forever. Thank you for the info.", "num_user_post": " 7", "author": "jbeale"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/number-of-data-recorded-in-a-chart/", "posts": [{"date": "May 3, 2011 - 1:26 pm", "content": "Hi i am trying to use ThingSpeak Charts for the observation of my Home Control System. Can somebody give an answer why the recording is stopped after 24 hours? Is this a limitation of TS or is it the push=false problem?  ", "num_user_post": " 6", "author": "voyager"}, {"date": "May 4, 2011 - 12:38 pm", "content": "I'm also using ThingSpeak to track home control data and I have not had this problem.  Some of my channels have many thousands of points and I can display multiple days.  Since I can only retrieve 8,000 points at a time, I am limited to the number of days I can display at one time depending on the data rate but that has not been a problem.  You can always use the start= and end= API calls to display a different range.Here's a chart with two fields from one of my channels displaying the last 5 days:http://gardnerswebsite.com/thingspeak.htmlGood luck,Bob ", "num_user_post": " 12", "author": "bgardner"}, {"date": "May 4, 2011 - 2:17 pm", "content": "If you log less data, it's easier to display charts on a longer time frame.  If you log every 15 seconds, you reach 8000 data points in 1.4 days, but if you log every hour you can return over 300 days worth of data. We have to put the rate limits in place, otherwise getting a month's worth of data from 15 second intervals is extremely intensive on our systems.  For example, this would require a database call for 175,000 points, and then the web server might still have to slice that data into time slices and calculate averages for each of these time slices.", "num_user_post": " 457", "author": "lee"}, {"date": "June 10, 2011 - 12:54 pm", "content": "Shouldn't I be able to get a longer date range by changing the time scale? Going from timescale=10 to timescale=720 should increase the date range, but so far doesn't.  ", "num_user_post": " 1", "author": "ricklon"}, {"date": "June 10, 2011 - 6:17 pm", "content": "'timescale' is a data operation, like average or median. So, a timescale of 10 sets the channel output to even increments of 10 minute slices even if you have a 100 data points in a 10 minute windows, only 1 will be presented.To get an extended range, use results=200 or specify days=3.Does this make sense?", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/thingspeak-framework/", "posts": [{"date": "May 25, 2011 - 11:24 pm", "content": "I didn't see a forum branch to discuss the UI approach but this might be OK. Apologies if I've misplaced this post.I would like to understand the intention of the web application in terms of what is meant by a channel, a field, a device, etc.In my setup, I have:sensors attached to radio transmitters which send data toa receiver in agateway device which has scripts to communicate to an APIEach radio can have 1 to 5 sensors.  The gateway can support many radios. The scripts in the gateway can send sensor data to 1 or more web service APIs.If I have 6 radios with 2 sensors each, should I be setting up 6 'channels' with 2 'fields' each?  And if I add a radio with 5 sensors will I be defining 5 fields? On Pachube they seem to have a concept of Feeds and Datastreams.On Sen.se the seem to have Devices with Feeds with SenseRivers... ??? How about Feed comes from Sensor.  Feeds can be grouped/tagged/attributed for apps and/or charting in any combination required.  Like set lower threshold at 0 degrees C for any feeds tagged as 'temperature, outdoors' and do an action send a tweet alert that says 'pipes might freeze and plants might wilt'. Another for example.  All my radios have a temp sensor on them.  I'd like a single chart to show all my temp sensor data regardless of channel or device so I can see which rooms are not being vented properly.Seems a bit complicated so please help.  How should one set up his or her sensors for maximum flexibility and what does a channel refer to in regards to a physical sensor or data stream. Thanks,Chris.  ", "num_user_post": " 6", "author": "chrisjx"}, {"date": "May 26, 2011 - 1:17 am", "content": "A ThingSpeak Channel is a conduit for data. Inside a channel you can have 8 fields that store alphanumeric data, 3 location fields (lat/long/elevation), and one status field (this is like a status update).On the channel page, there is a link that says, 'View Charts'. This will show a chart for each of the 8 fields (the ones with data). Each chart has embed tag and you can customize it's meta data and options.if you want to customize a chart and show multiple lines of data, you can create a Plugin.So, a channel could be anything - the output of a sensor or a place to publish data from a process. With the addition of geolocation fields and status, you can also give the data more context. It would be trivial to be a location tracking mobile app with ThingSpeak.In your application, you would create a Channel, title it, add a description, and add tags. Then, assign and title a field for each sensor (1-8).The Devices tab is different than Channels. It's an app that lets you register a device, like an Arduino. It also allows you to store info about that device such as Public / Private IP addresses. If your devices needs a MAC address, you can generate a MAC address from our address pool. This MAC will be globally unique.The source for the API is available on GitHub for further inspection / complete customization for your application. We are currently hosting private / custom branches of ThingSpeak for customers that want a web service tied to their product.", "num_user_post": " 402", "author": "Hans"}, {"date": "May 26, 2011 - 4:25 pm", "content": "Thanks for the detailed description.  That's just what I needed. We are currently hosting private / custom branchesThat's cool.  Will keep that in mind as I think this through.Regards,Chris. ", "num_user_post": " 6", "author": "chrisjx"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/drop-outs/", "posts": [{"date": "May 24, 2011 - 9:33 am", "content": "Why am i having so many dropouts in my chart. In the last cleared and new set chart with a login of 30 minutes i have drops of 8 hours. How is this possible. I am controlling my system with a log datafile and this says that the data has been sent. I am also sending this data to another webserver which receives it correctly.Any help welcome. ", "num_user_post": " 6", "author": "voyager"}, {"date": "May 24, 2011 - 11:53 am", "content": "Hi, I assume you're referring to Channel 607.  I just looked through our log files, and I can see your requests coming to our server.  However, some of the data is missing the value for field2. Here's one of the normal requests:GET /update?key=XXXXXXXXX&field1=0&field1=23 May 2011 20:00:13&field2=627and one of the requests with missing data:GET /update?key=XXXXXXXXX&field1=0&field1=23 May 2011 23:00:17&field2= If you'd like the entire server log file for this channel, let me know and I can email it to you. ", "num_user_post": " 457", "author": "lee"}, {"date": "May 24, 2011 - 1:08 pm", "content": "Hi, i'll have to check the failure in my system. Be so kind and mail me the entire server log.Thanks for your fast response.  ", "num_user_post": " 6", "author": "voyager"}, {"date": "May 24, 2011 - 2:53 pm", "content": "Sent!", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/animated-chart/", "posts": [{"date": "April 2, 2011 - 1:01 pm", "content": "I’m unable to locate any information on how to generate an animated graph similar to Dynamic Light Levels graph on the main page.  Any guidance would be greatly appreciated.", "num_user_post": " 3", "author": "roebuj"}, {"date": "April 2, 2011 - 2:46 pm", "content": "Here's what we do to generate the chart on our home page: 1) We load up the last 15 entries on the channel and draw the charthttps://api.thingspeak.com/channels/9/field/1.json?callback=?&amp;results=15 2) After 15 seconds we request, the 'last' entry in the channel and update the chart if the last entry is newhttps://api.thingspeak.com/channels/9/feed/last.json?callback=? If you view the source of our home page, we have the process documented. You can use a ThingSpeak Plugins to make your own version with your own data. Let us know if you have anymore question. Have fun!  ", "num_user_post": " 402", "author": "Hans"}, {"date": "April 2, 2011 - 3:01 pm", "content": "I did view the source, thanks for the info!  I'll see what I can make of it. Thanks!", "num_user_post": " 3", "author": "roebuj"}, {"date": "April 3, 2011 - 9:05 pm", "content": "", "num_user_post": " 3", "author": "roebuj"}, {"date": "April 8, 2011 - 5:41 am", "content": "We made this easier for you, when you use the iframe embed code just put &dynamic=true on the end of the src attribute.  It should look something like this:<iframe width='450' height='250' style='border: 1px solid #cccccc;' src='https://api.thingspeak.com/channels/9/charts/1?round=2&results=15&dynamic=true'></iframe>", "num_user_post": " 457", "author": "lee"}, {"date": "April 12, 2011 - 4:43 am", "content": "I noticed the &dynamic=true option expands the graph (and compresses the data) and doesn't actually scroll the time range like the homepage chart-- anyway to make this another parameter or the default behaviour?", "num_user_post": " 3", "author": "Australian Robotics"}, {"date": "April 12, 2011 - 8:04 am", "content": "You're right that should be the default behavior.  It's changed now.  To prevent data from being pushed off the left side of the chart you can add &push=false as a querystring parameter.", "num_user_post": " 457", "author": "lee"}, {"date": "April 12, 2011 - 4:27 pm", "content": "Thanks lee, that works great now! Very nice charts btw.  ", "num_user_post": " 3", "author": "Australian Robotics"}, {"date": "May 13, 2011 - 9:42 am", "content": "Auto updates don't seem to work when the chart is embedded in the iframe_loader in Wordpress, any thoughts?", "num_user_post": " 1", "author": "Afulki"}, {"date": "May 13, 2011 - 4:05 pm", "content": "Can you provide the chart URL you are using? 'dynamic=true' must be on the Chart API URL.The demo is live on our documentation using the iframe_loader plugin.", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/clearing-a-channel-via-api-call/", "posts": [{"date": "May 10, 2011 - 3:43 pm", "content": "Hi,is there any way to clear a channel via API call. If so could you give a sample. ", "num_user_post": " 6", "author": "voyager"}, {"date": "May 10, 2011 - 6:00 pm", "content": "Sorry, this isn't possible.", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/axis-range-on-default-public-channel-graphs/", "posts": [{"date": "May 9, 2011 - 5:13 pm", "content": "Here is my public channel: https://thingspeak.com/channels/627This is an ambient light sensor. If you look the graph that appears on the above page, you will see that the vertical axis starts at -500. For some measurements, like this one (ambient light) the axis should not go below zero, because a negative light level is not physically meaningful. I'm just suggesting that there should be some place to specify that a given channel is measuring positive values only, so the graph can be forced to start at zero or a positive number. Maybe there is that option and I didn't see it, I'm new here.  Thanks for the very interesting website / service!regards,John", "num_user_post": " 7", "author": "jbeale"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/having-some-difficulties/", "posts": [{"date": "May 5, 2011 - 2:49 am", "content": "OK, below is my code that is causing a problem.  I've got a Channel with 4 fields.  The terminology is new to me.  I suppose a channel is for a device?  The fields are where the datastreams would go?So I have a board with an xbee radio and 4 sensors on it.  I've got a hacked Asus wifi router hooked up with openwrt and python.  The python script is polling the various radios in my house.  One of them is the multi-sensor device I'm trying to set up in Thingspeak.I've got it hard coded for field1 but eventually I'm going to want to pass in the field I want to update as a parametr and create the filed name (field1, field2, etc)I'm getting an error:Exception:  http://api.thingspeak.com:80  -  (7, 'no address associated with hostname.')I think it is happening on the line:conn.request('POST', '/update', params, headers)Any help would be appreciated,Chris.import urllib, urllib2, httplibTHINGSPEAKURL = 'http://api.thingspeak.com'THINGSPEAK_KEY = 'mynumber' def logtothing(lnSensorNum, lnAvgUnits, lcThingSpeakKey, fieldnum):        # lnSensorNum is the number of the xbee radio    # lnAvgUnits is the average of the last 5 minutes    # lcThingSpeakKey - the channel/device api key    # fieldnum (1,2,3,4) is the ADC input from each of the 4 sensors - relates to the ADCs on the xbee (0,1,2,3)    feedUrl = THINGSPEAKURL + ':80'    fieldname = 'field' + str(fieldnum +1)    try:    params = urllib.urlencode({'field1': lnAvgUnits,'key':lcThingSpeakKey})        headers = {'Content-type': 'application/x-www-form-urlencoded','Accept': 'text/plain'}                conn = httplib.HTTPConnection(feedUrl)        conn.request('POST', '/update', params, headers)        response = conn.getresponse()        data = response.read()conn.close()    except Exception, e:        print 'Exception: ', feedUrl, ' - ', str(e)        syslog.syslog('TLSM.logtothing exception: ' + feedUrl + ' - ' + str(e)) ", "num_user_post": " 6", "author": "chrisjx"}, {"date": "May 5, 2011 - 2:50 am", "content": "Hard to read my post in the embedded forum...  Sorry.", "num_user_post": " 6", "author": "chrisjx"}, {"date": "May 5, 2011 - 8:44 am", "content": "Based on the error message, it looks like you're not able to resolve the correct IP address from the hostname.Try using this instead:THINGSPEAKURL = http://184.106.153.149", "num_user_post": " 457", "author": "lee"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/import-functionality-via-api/", "posts": [{"date": "May 4, 2011 - 2:22 pm", "content": "Hi, I'm developing a monitoring device that will help us collecting data about the fermentation process of our homebrewed beer. Since I can't be sure that the internet connection will be up-and-running 100% of the time I've implemented a local logging system as well.The local logging happens like this:all entries are logged on a SD card for later extractionall failed calls to Thingspeak (or any future web service) are logged in local queueing files (small files for easier processing)A cool thing would be that I'm able to upload these queueing files to Thingspeak similar to the import method on the Channel page but using the API. It's just an idea, but it would be a nice feature (and not too difficult to implement, I suppose). Kind regards,Niels R.", "num_user_post": " 1", "author": "Niels"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/thingspeak-response/", "posts": [{"date": "April 13, 2011 - 1:02 pm", "content": "I'm working on using an AVR and a Wiznet module to update a Thingspeak channel and seem to be doing something wrong.  As a test, I wrote a very simple VB6 program using the same header and format and it works fine.However, sending the same header and data with my Wiznet module, I get the following response:<html><head><title>400 Bad Request</title></head><body bgcolor='white'><center><h1>400 Bad Request</h1></center><hr><center>nginx/0.8.53</center></body></html>The actual data I'm sending looks like:field1=80.0&field2=95.0So, is this response one that you're sending or I am on the wrong track?  Any idea why the request is so messed up?Any help appreciated.  Thanks,Bob ", "num_user_post": " 12", "author": "bgardner"}, {"date": "April 13, 2011 - 7:50 pm", "content": "Hi, can you show me the full request you're sending (without your api key) so I can take a look at it?  Also are you using GET or POST?  Since our nginx server is sending you an automatic 400, I don't think your response is even reaching our actual ThingSpeak application. As a quick test, go to this address in your browser: http://api.thingspeak.com/update?key=YOUR_WRITE_API_KEY&field1=80.0&field2=95.0replacing YOUR_WRITE_API_KEY appropriately.  It should update your channel.", "num_user_post": " 457", "author": "lee"}, {"date": "April 13, 2011 - 9:11 pm", "content": "Here's my full request: POST /update HTTP/1.1Host: api.thingspeak.comConnection: closeX-THINGSPEAKAPIKEY: ****************Content-Type: application/x-www-form-urlencodedContent-Length: 23 field1=80.0&field2=95.0 I'm sending it to 184.106.153.149 and Port 80.I copied this from the Arduino example on your site.I also tried the link from your reply and that worked correctly just like my VB6 program.Any thoughts? Thanks.Bob ", "num_user_post": " 12", "author": "bgardner"}, {"date": "April 13, 2011 - 11:33 pm", "content": "What version of the Arduino ISE are you running?When I wrote the tutorial, I used 22 and the Ethernet Shield with the Micro SD cart slot.", "num_user_post": " 402", "author": "Hans"}, {"date": "April 14, 2011 - 8:58 am", "content": "I guess I didn't explain myself very well.  I am not using an Arduino or an ethernet shield.  I am using a mega328 and a wiznet wiz810mj module.  This is basically the same processor and ethernet chip as the Arduino combination.  I am programming with Bascom AVR.  I have done several projects with this combination and it has worked very well.So apparently I am getting to your server but it doesn't like my request - is that correct?  Is there any way of finding out more detail or what the server is seeing?I feel like I'm really close but not quite there yet.Thanks,Bob ", "num_user_post": " 12", "author": "bgardner"}, {"date": "April 14, 2011 - 9:58 am", "content": "Can you send a post to this URL:http://posttestserver.com/post.phpaccording to the instructions here:http://posttestserver.com/If that works, please provide me with the link to your successful POST and I'll take a look at it.", "num_user_post": " 457", "author": "lee"}, {"date": "April 15, 2011 - 2:54 pm", "content": "I guess I'm not sure how to do that.  The wiznet module doesn't do DNS so I don't know how to send my post to another address.  I've still got a lot to learn.The good news is that I'm making progress.  I can now post to the channel with my wiznet - the first time - but after that, at least for several hours, I can't connect but, if I change my port say from 5000 to 5001, then I can post again.  If I change my port again to 5002 then I can post yet again.I don't understand why I have to change the port each time.  Is there some caching going on somewhere?  Why could I connect on a certain port and then not connect a second time a few minutes later but could connect quite a while later?Anybody able to shed any light on this issue?Thanks for all the help to date.Bob", "num_user_post": " 12", "author": "bgardner"}, {"date": "April 17, 2011 - 6:37 pm", "content": "Bob,We do not have much experience with the WizNet except for on the Arduino Ethernet Shield. All I know if that it locks up a lot. So, I have a watch dog timer that kills the connection and restarts the WizNet chip.I would check to see that you are closing the connection to the server. The ports 5000 that you are speaking of our local ports. A device makes a connection to the internet and has a source and destination IP and port. Our port is 80 (destination). 5000 ish would be the source port. Like I said, the only thing I can think of is that once you use a source port (socket), you are not closing it so it can be reused for the next connection. Also, check to see if you are using HTTP 1.0 or HTTP 1.1 – HTTP 1.1 allows for keep-alive and you do not have to shut off the port on every connection.Let us know what you find.", "num_user_post": " 402", "author": "Hans"}, {"date": "April 18, 2011 - 7:19 pm", "content": "Thanks for sticking with me on this.  I am using HTTP 1.1 and using 80 as the destination port.  After a successful channel update, I send a disconnect command to the module and the Wiznet status shows that the connection and socket are closed.  But I agree it seems like the connection is not being closed correctly.When I have a successful connection, here's the reply from your server:HTTP/1.1 200 OKServer: nginx/0.8.53Date: Fri, 15 Apr 2011 19:34:28 GMTContent-Type: text/html; charset=utf-8Transfer-Encoding: chunkedConnection: closeVary: Accept-EncodingStatus: 200ETag: '1aa48fc4880bb0c9b8a3bf979d3b917e'Cache-Control: max-age=0, private, must-revalidate38030If I send an update at a specific time to my channel, is there any way you can check on your end to see if the connection was properly closed?  Other than that, I'm really pushing my knowledge here.Thanks,Bob ", "num_user_post": " 12", "author": "bgardner"}, {"date": "April 19, 2011 - 10:24 pm", "content": "So I've done everything I can think to disconnect and close the connection correctly.  Unfortunately I still can't re-use the same port.  Although your server sends back a 'Connection: close', it just doesn't look like it's being closed.I do have a hack running that increments the port each post and then wraps around after a day or two.  The results can be seen here:http://gardnerswebsite.com/thingspeak.htmlI'll keep working on it.  Please let me know if you have any ideas.Thanks,Bob", "num_user_post": " 12", "author": "bgardner"}, {"date": "April 20, 2011 - 12:05 am", "content": "Looks like you are making more progress. Send us your project detail when you are ready. I will hold a spot for you in the contest 🙂", "num_user_post": " 402", "author": "Hans"}, {"date": "April 26, 2011 - 1:52 pm", "content": "So I finally got everything working correctly.  The port problem appeared to be caused by an ARP cache used by my ISP.  I have posted more information about the problem and the project on my site:http://gardnerswebsite.com/thingspeak/index.htmlI will post the Bascom source code in the next couple of days after I clean it up a little and add more documentation.Thanks for your help.Bob", "num_user_post": " 12", "author": "bgardner"}, {"date": "April 26, 2011 - 4:19 pm", "content": "Sweet writeup! And, glad it's working now.Email us at support@thingspeak.com ", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-api/query-channel-details/", "posts": [{"date": "April 22, 2011 - 5:09 pm", "content": "Hi,I'm having a great time with the API's (netduino uploads and a drupal module in the works) and I was wondering about some extra channel info.It would be really nice to be able to query some channel details, i.e. with a channel ID and API key, retrieve the available fields, etc.Is this doable currently?  I didn't see anything specific, so I can always parse them out, but a quick api call would be nice to have.Cheers", "num_user_post": " 8", "author": "H07R0D"}, {"date": "April 23, 2011 - 1:16 am", "content": "Currently, the channel info is returned at the beginning of a feed request.  Do you mean that you'd like to get ONLY the channel info and not the feed info?", "num_user_post": " 457", "author": "lee"}, {"date": "April 23, 2011 - 7:14 am", "content": "Yes, that's it.  I'm thinking of pulling the rest of a channel's info when a user provides channel ID and Read Key.  The more I can auto-populate the better I figure.", "num_user_post": " 8", "author": "H07R0D"}, {"date": "April 23, 2011 - 9:25 pm", "content": "http://api.thingspeak.com/channels/9/feed.json?results=0 Is this the data you want?", "num_user_post": " 457", "author": "lee"}, {"date": "April 24, 2011 - 9:59 am", "content": "Ah, that'll work just fine.  I can parse out the channel and skip the feeds.Perfect! Thanks.13", "num_user_post": " 8", "author": "H07R0D"}]}]}