{"url": "https://community.thingspeak.com/forum/thingspeak-apps/page-19/", "threads": [{"url": "https://community.thingspeak.com/forum/thingspeak-apps/api-through-a-proxy-thingtweet/", "posts": [{"date": "July 1, 2011 - 11:43 am", "content": "Hi – I've been working on using an arduino board to update a twitter status using ThingTweet. This works fine on a normal network without a proxy using the following snippet of code: Connect directly to the api endpoint (api.thingspeak.com) thenclient.print('POST /apps/thingtweet/1/statuses/update HTTP/1.1n');client.print('Host: api.thingspeak.comn');… etcAll is good….However, on another network with a non-transparent proxy, I've been trying:Connecting directly to the proxy (wwwcache.domainname.org) which doesn't have any form of local authentication, then trying a fully qualified POST:client.print('POST http://api.thingspeak.com/apps/thingtweet/1/statuses/update HTTP/1.1n');client.print('Host: api.thingspeak.comn');… etcWhich doesn't work.Any bright ideas on what I could try / should be doing?Many thanks,Graham", "num_user_post": " 3", "author": "Aghillo"}, {"date": "July 2, 2011 - 2:01 am", "content": "Here's the first thing comes to mind: do you have the Gateway address of the Arduino pointed to the proxy server?I did some searching on the Arduino forum and did not see and definitive answers. Maybe we will be the trend setters if we can come up with a fix for proxies.", "num_user_post": " 402", "author": "Hans"}, {"date": "July 2, 2011 - 7:23 am", "content": "That's a very good point - I will check Monday  and report back! ", "num_user_post": " 3", "author": "Aghillo"}, {"date": "July 4, 2011 - 10:40 am", "content": "All works fine now through a proxy - it was simply an extra 'rn' that I'd missed in the POST headers 🙂 Graham17", "num_user_post": " 3", "author": "Aghillo"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/homevision-plugin/", "posts": [{"date": "June 8, 2011 - 12:11 pm", "content": "For anyone using the Homevision controller for their home automation I have written a ThingSpeak plugin for the HomevisionXL software.  The plugin is written in TCL and allows the user to upload up to 8 Homevision variables to a ThingSpeak channel.  More information and documentation can be found at:http://gardnerswebsite.com/thingspeak/hvxlplugin.htmlHope you like it.Bob", "num_user_post": " 12", "author": "bgardner"}, {"date": "June 9, 2011 - 12:38 am", "content": "This is excellent. Thanks for sharing. I will get the word out as well.", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/tweetcontrol-integration/", "posts": [{"date": "June 8, 2011 - 6:17 am", "content": "I am using an Arduino Uno with Ethernet Shield to talk to ThingSpeak--though that is more or less irrelevant, as my question is more general than that. This is my first attempt at integrating web-control into the design of an imbedded system so some of the steps in facilitating communication between ThingSpeak and my hardware are new to me. The problem I am having is that I can not figure out how to get data to my Ethernet shield (with a known, local, static IP address) from my router (with some known public IP address). Anyone with some experience with this have any input? ", "num_user_post": " 8", "author": "mc"}, {"date": "June 8, 2011 - 10:48 am", "content": "With the Arduino+Ethernet you will have to do two things. One assign the Arduino an IP address and port number. Two, create a port forward rule on your router. This port forward takes the public IP and port number and forwards it to one internal (private) IP and port number.So, Arduino has an IP of 192.68.0.123 and port number 8000. Your router has a public IP of 90.123.123.123 and port 8000. You create that port forward rule in the router so the public IP / port forwards to the private IP /port. To access your Arduino, enter http://90.123.132.123:8000 in a web browser.I know that a few users are working on TweetControl projects. I will post when I get the details. ", "num_user_post": " 402", "author": "Hans"}, {"date": "June 8, 2011 - 12:03 pm", "content": "well that was easy! thanks so much! ", "num_user_post": " 8", "author": "mc"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/thinghttp-with-google-and-facebook/", "posts": [{"date": "June 4, 2011 - 5:47 am", "content": "Hello everyoneI'm new to the forum and I wanted to ask how I can interface thinghttp with google and facebook.From facebook I want to receive the rss feed of the my notificationsd, I tried using LabVIEW and the normal browser and it works, but if I use a GET with thinghttp nothing happenshow can I do?", "num_user_post": " 2", "author": "stefacc"}, {"date": "June 4, 2011 - 10:09 am", "content": "I just got it working for me.  Try using the RSS feed link from this page:http://www.facebook.com/notifications.phpYour feed URL should look something like:http://www.facebook.com/feeds/notifications.php?id=XXXXXXX&viewer=XXXXXX&key=XXXXXXXXXX&format=rss20I put that URL into the ThingHTTP URL and left all the default values alone, and was able to get my feed.I hope I was able to help, let me know if you still have issues!  ", "num_user_post": " 457", "author": "lee"}, {"date": "June 4, 2011 - 11:53 am", "content": "thanksssssssssss!!!!Now, however, must also work with various Google services", "num_user_post": " 2", "author": "stefacc"}, {"date": "June 7, 2011 - 7:00 pm", "content": "How are your apps going?", "num_user_post": " 402", "author": "Hans"}]}, {"url": "https://community.thingspeak.com/forum/thingspeak-apps/thingtweet/", "posts": [{"date": "January 27, 2011 - 3:24 pm", "content": "We just finished up work on a Twitter proxy app called, 'ThingTweet'.As you may or may not know, Twitter has introduced OAuth (Open Authentication) for third-party apps. OAuth is a little too much processing for a basic microcontroller to handle so we have created a service that handles the OAuth to Twitter and allows you to send status updates via the ThingSpeak API.To try it out, sign in to https://thingspeak.com/login, select Apps from the menu, and then click on ThingTweet.Under the ThingTweet App, select 'Link new Twitter account'. This will redirect you to Twitter to see if you want the app to have the ability to access your account. You can Allow or Deny the process. Once you have confirmed the right Twitter account, Twitter will send you back to ThingSpeak.We then generate a new API Key for you to use. If you send an HTTP POST with your key, then the message will be relayed to Twitter. All of the parameters from the Twitter API (statuses/update) are possible.The URI is:http://api.thingspeak.com/apps/thingtweet/1/statuses/updateWe made our URL / URI to be similar to the actual Twitter API so it may be a drop in / switch out with not much headache. The only new addition is that you must send an API Key along with the parameters or in the X-THINGSPEAKAPIKAY header.api_key=(thingtweet_api_key)&status=I just posted this from a microcontroller!!!I will get the full documentation on our docs page, but I wanted to give you some early access. Let me know how it works.", "num_user_post": " 402", "author": "Hans"}]}]}